// AnimBlueprintGeneratedClass ABP_Caretaker.ABP_Caretaker_C
// Size: 0x2308 (Inherited: 0x2d0)
struct UABP_Caretaker_C : UCaretagerBodyAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8(0x30)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x308(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x330(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x358(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x380(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x3a8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x3d0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3f8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x420(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x448(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x4c0(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x4f0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x568(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x598(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x610(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x640(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x6b8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x6e8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x760(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x790(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x808(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x838(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x8b0(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x8e0(0xb0)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x990(0xc0)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xa50(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xa78(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xaa0(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xac8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0xb40(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xb70(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xbe8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xc18(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xc90(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0xcc0(0xb0)
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0xd70(0xa0)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xe10(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xe38(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xe60(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xe88(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xf00(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xf30(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xfa8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xfd8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1050(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x1080(0xb0)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x1130(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1158(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1180(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x11a8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1220(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1250(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x12c8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x12f8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1370(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x13a0(0xb0)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1450(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1478(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x14a0(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x14c8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1540(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1570(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x15e8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1618(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1690(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x16c0(0xb0)
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1770(0x48)
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x17b8(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1858(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x18d0(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1948(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x19c0(0x78)
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1a38(0x48)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1a80(0x78)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1af8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1b20(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1b48(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1b70(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1b98(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1bc0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1be8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1c10(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1c38(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1cb0(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1ce0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1d58(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1d88(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1e00(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1e30(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1ea8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1ed8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1f50(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1f80(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1ff8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2028(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x20a0(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x20d0(0xb0)
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2180(0xc8)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2248(0x78)
	FAnimNode_Slot AnimGraphNode_Slot; // 0x22c0(0x48)

	void AnimGraph(FPoseLink AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Caretaker_AnimGraphNode_TransitionResult_864250F94AE2D2E784CC0C8FC8685AB7();
	void ExecuteUbergraph_ABP_Caretaker(int32_t EntryPoint);
};

