// Class ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size: 0x230 (Inherited: 0x30)
struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x30(0x50)
	enum class EDataSourceTypeEnum DataSourceType; // 0x80(0x01)
	int32_t DataProcessFrequency; // 0x84(0x04)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x88(0x04)
	bool DoSpawn; // 0x8c(0x01)
	FVector2D SpawnMultiplierMinMax; // 0x90(0x08)
	float SpawnChance; // 0x98(0x04)
	FVector2D ImpulseToSpawnMinMax; // 0x9c(0x08)
	FVector2D SpeedToSpawnMinMax; // 0xa4(0x08)
	FVector2D MassToSpawnMinMax; // 0xac(0x08)
	FVector2D ExtentMinToSpawnMinMax; // 0xb4(0x08)
	FVector2D ExtentMaxToSpawnMinMax; // 0xbc(0x08)
	FVector2D VolumeToSpawnMinMax; // 0xc4(0x08)
	FVector2D SolverTimeToSpawnMinMax; // 0xcc(0x08)
	int32_t SurfaceTypeToSpawn; // 0xd4(0x04)
	enum class ELocationFilteringModeEnum LocationFilteringMode; // 0xd8(0x01)
	enum class ELocationXToSpawnEnum LocationXToSpawn; // 0xd9(0x01)
	FVector2D LocationXToSpawnMinMax; // 0xdc(0x08)
	enum class ELocationYToSpawnEnum LocationYToSpawn; // 0xe4(0x01)
	FVector2D LocationYToSpawnMinMax; // 0xe8(0x08)
	enum class ELocationZToSpawnEnum LocationZToSpawn; // 0xf0(0x01)
	FVector2D LocationZToSpawnMinMax; // 0xf4(0x08)
	enum class EDataSortTypeEnum DataSortingType; // 0xfc(0x01)
	bool bGetExternalCollisionData; // 0xfd(0x01)
	bool DoSpatialHash; // 0xfe(0x01)
	FVector SpatialHashVolumeMin; // 0x100(0x0c)
	FVector SpatialHashVolumeMax; // 0x10c(0x0c)
	FVector SpatialHashVolumeCellSize; // 0x118(0x0c)
	int32_t MaxDataPerCell; // 0x124(0x04)
	bool bApplyMaterialsFilter; // 0x128(0x01)
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x130(0x50)
	bool bGetExternalBreakingData; // 0x180(0x01)
	bool bGetExternalTrailingData; // 0x181(0x01)
	FVector2D RandomPositionMagnitudeMinMax; // 0x184(0x08)
	float InheritedVelocityMultiplier; // 0x18c(0x04)
	enum class ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x190(0x01)
	FVector2D RandomVelocityMagnitudeMinMax; // 0x194(0x08)
	float SpreadAngleMax; // 0x19c(0x04)
	FVector VelocityOffsetMin; // 0x1a0(0x0c)
	FVector VelocityOffsetMax; // 0x1ac(0x0c)
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1b8(0x08)
	float MaxLatency; // 0x1c0(0x04)
	enum class EDebugTypeEnum DebugType; // 0x1c4(0x01)
	int32_t LastSpawnedPointID; // 0x1c8(0x04)
	float LastSpawnTime; // 0x1cc(0x04)
	float SolverTime; // 0x1e0(0x04)
	float TimeStampOfLastProcessedData; // 0x1e4(0x04)
};

