// UserDefinedStruct EndScreenMove.EndScreenMove
// Size: 0x48 (Inherited: 0x00)
struct FEndScreenMove {
	UAnimSequence* Walk_2_2D5808D7436DCFFCD4A0E9BBCDEFD20E; // 0x00(0x08)
	UAnimSequence* Pose_Optional_4_0C5B3E154236E596C7B98C8674399C23; // 0x08(0x08)
	UAnimSequence* Loop_6_27B6CF03496CE4F887DB9EA6A66910EF; // 0x10(0x08)
	TArray<UAnimSequence*> Breaks_9_1147962749C4EB29B65F459960CD7D35; // 0x18(0x10)
	AActor* Attachment_Class_22_EEC03C3F4B9D7EDB458BBBA919D7D9FC; // 0x28(0x08)
	UAnimSequence* Attachment_Walk_14_52090DCE439608881FD4209FC0978507; // 0x30(0x08)
	UAnimSequence* Attachment_Pose_17_3B4F2F6F4DC9CE21E3410BAB9AF65BE7; // 0x38(0x08)
	UAnimSequence* Attachment_Loop_18_F18D69F048465180117268B98657613C; // 0x40(0x08)
};

