// UserDefinedStruct EndScreenMoveSet.EndScreenMoveSet
// Size: 0x100 (Inherited: 0x00)
struct FEndScreenMoveSet {
	float Weight_20_9172AF0F49C74900EC45C29EEE7FB775; // 0x00(0x04)
	TArray<TSoftObjectPtr<UAnimSequence>> Walks_42_3B0B99FD43910DD750F305953173B9CB; // 0x08(0x10)
	TArray<TSoftObjectPtr<UAnimSequence>> Poses_Optional_43_3339A57A4D10CBD0C5C74690F351D108; // 0x18(0x10)
	TSoftObjectPtr<UAnimSequence> Loop_44_0E4E6C8A4331EA36DF87AA9DE7E30AB1; // 0x28(0x28)
	TArray<TSoftObjectPtr<UAnimSequence>> Breaks_45_342F70184394DAB7D1A06B927C9CEDA1; // 0x50(0x10)
	TSoftClassPtr<UObject> Attachment_Class_25_9EA6E9964122F7482D241BB69A8EE5B7; // 0x60(0x28)
	TSoftObjectPtr<UAnimSequence> Attachment_Walk_46_8D4D47EA48F66FA99BB048BCD07D34FB; // 0x88(0x28)
	TSoftObjectPtr<UAnimSequence> Attachment_Pose_47_9862A0C744322DD618B426902448DC92; // 0xb0(0x28)
	TSoftObjectPtr<UAnimSequence> Attachment_Loop_48_CB65E924422DC1F25BFB5194B0E606E5; // 0xd8(0x28)
};

