// WidgetBlueprintGeneratedClass HackingPod_HackScreenMiddle.HackingPod_HackScreenMiddle_C
// Size: 0x290 (Inherited: 0x238)
struct UHackingPod_HackScreenMiddle_C : UUI_HackingPod_Screen_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238(0x08)
	UWidgetAnimation* TextBoxPopup; // 0x240(0x08)
	UWidgetAnimation* AccessGranted2; // 0x248(0x08)
	UWidgetAnimation* AccessGranted1; // 0x250(0x08)
	UWidgetAnimation* CautionBlink; // 0x258(0x08)
	UImage* Image_94; // 0x260(0x08)
	UImage* IMG_Caution; // 0x268(0x08)
	UImage* IMG_Caution_2; // 0x270(0x08)
	UScrollingText02_C* ScrollingText; // 0x278(0x08)
	UScrollingText02_C* ScrollingText_2; // 0x280(0x08)
	UScrollingText02_C* ScrollingText_4; // 0x288(0x08)

	void Construct();
	void ExecuteUbergraph_HackingPod_HackScreenMiddle(int32_t EntryPoint);
};

