// WidgetBlueprintGeneratedClass HackingPod_HackScreenTop.HackingPod_HackScreenTop_C
// Size: 0x278 (Inherited: 0x238)
struct UHackingPod_HackScreenTop_C : UUI_HackingPod_Screen_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238(0x08)
	UWidgetAnimation* ButtonBlink; // 0x240(0x08)
	UImage* IMG_Caution; // 0x248(0x08)
	UImage* IMG_Caution_3; // 0x250(0x08)
	UImage* IMG_Caution_4; // 0x258(0x08)
	UImage* IMG_Caution_5; // 0x260(0x08)
	UScrollingText01_C* ScrollingText; // 0x268(0x08)
	UScrollingText03_C* ScrollingText_2; // 0x270(0x08)

	void Construct();
	void ExecuteUbergraph_HackingPod_HackScreenTop(int32_t EntryPoint);
};

