// WidgetBlueprintGeneratedClass HUD_CrossHair_Drills.HUD_CrossHair_Drills_C
// Size: 0x278 (Inherited: 0x230)
struct UHUD_CrossHair_Drills_C : UUserWidget {
	UWidgetAnimation* AnimFadeIn; // 0x230(0x08)
	UImage* Image_1; // 0x238(0x08)
	UImage* Image_2; // 0x240(0x08)
	UImage* Image_3; // 0x248(0x08)
	UImage* Image_4; // 0x250(0x08)
	UUI_SimpleAngleIndicator_C* UI_SimpleAngleIndicator; // 0x258(0x08)
	float Angle; // 0x260(0x04)
	float HeightOffset; // 0x264(0x04)
	FVector2D ClippingSize; // 0x268(0x08)
	float ArrowSize; // 0x270(0x04)
	float ArrowOffset; // 0x274(0x04)
};

