// WidgetBlueprintGeneratedClass ITM_ServerList_Warning.ITM_ServerList_Warning_C
// Size: 0x278 (Inherited: 0x230)
struct UITM_ServerList_Warning_C : UUserWidget {
	UBasic_Menu_ColorBar_C* Basic_Menu_ColorBar; // 0x230(0x08)
	UBasic_Menu_ColorBar_C* Basic_Menu_ColorBar_C_1; // 0x238(0x08)
	UBlurBackground_C* BlurBackground; // 0x240(0x08)
	UTextBlock* Description; // 0x248(0x08)
	UTextBlock* Header; // 0x250(0x08)
	UImage* Image_1; // 0x258(0x08)
	UImage* Image_2; // 0x260(0x08)
	UITM_ServerList_AttentionBox_C* ITM_ServerList_AttentionBox; // 0x268(0x08)
	UITM_ServerList_AttentionBox_C* ITM_ServerList_AttentionBox_2; // 0x270(0x08)
};

