// AnimBlueprintGeneratedClass ABP_InfectedMuleTurret.ABP_InfectedMuleTurret_C
// Size: 0xa48 (Inherited: 0x270)
struct UABP_InfectedMuleTurret_C : UConvertedRobotTurretAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x278(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x460(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x488(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x500(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x530(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x5a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x5d8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x650(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x680(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x6f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x728(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x7a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x848(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x878(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x8f0(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x920(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x950(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xa00(0x48)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_InfectedMuleTurret.ABP_InfectedMuleTurret_C.AnimGraph
	void ExecuteUbergraph_ABP_InfectedMuleTurret(int32_t EntryPoint); // Function ABP_InfectedMuleTurret.ABP_InfectedMuleTurret_C.ExecuteUbergraph_ABP_InfectedMuleTurret
};

