// AnimBlueprintGeneratedClass ABP_FP_Dwarf.ABP_FP_Dwarf_C
// Size: 0x2ad8 (Inherited: 0x440)
struct UABP_FP_Dwarf_C : UPlayerFPAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x440(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x448(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x478(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x4c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x4e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x510(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x538(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x560(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x5b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x5d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x808(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x830(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x858(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x8a8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x8d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x8f0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x9f8(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xa18(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xa90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xac0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xb38(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xb68(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xbe0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xc38(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xcb0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xce0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xd88(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xe00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xe30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xea8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xed8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xf78(0x78)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0xff0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x10f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x1118(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1138(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x11b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x11e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1258(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1288(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1300(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1330(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x13a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1448(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x14c0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x14f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x15f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1618(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1638(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x16b0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1750(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x17c8(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x17f8(0xc8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x18c0(0x18)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18d8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1998(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1a10(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1a88(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x1b28(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1c30(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1c50(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1c70(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1ce8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1d60(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1e00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1e30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ea8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ed8(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1f88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x1fa8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x20b0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x20d0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2188(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x21b0(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x21f8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x2300(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2408(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2510(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2618(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x26b8(0x78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2730(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2750(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2770(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2878(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2918(0x78)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2990(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x29b0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2ab8(0x20)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimGraph
	void AnimNotify_Mine(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_Mine
	void StartInspectWeapon(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.StartInspectWeapon
	void StopInspectWeapon(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.StopInspectWeapon
	void AnimNotify_BeginBuild(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_BeginBuild
	void AnimNotify_EndBuild(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_EndBuild
	void ExecuteUbergraph_ABP_FP_Dwarf(int32_t EntryPoint); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.ExecuteUbergraph_ABP_FP_Dwarf
};

