// AnimBlueprintGeneratedClass ABP_Bosco.ABP_Bosco_C
// Size: 0x1490 (Inherited: 0x2a0)
struct UABP_Bosco_C : UBoscoAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2a8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x3a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x5a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x5d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x5f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x620(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x648(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x670(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x6c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x6e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x710(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x738(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x7b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x7e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x858(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x888(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x900(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x930(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x9a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x9d8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xa50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xa80(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xaf8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xb28(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xba0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xbd0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xc48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xc78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xcf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xd20(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xdc8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xe40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xe70(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xee8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xf18(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xf90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xfc0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1038(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1068(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x10e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1110(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1188(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x11b8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1230(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1260(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x12d8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1308(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x13b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1400(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1448(0x48)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_Bosco.ABP_Bosco_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_4210E8D0438F626F0E4D59B0905F0238(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_4210E8D0438F626F0E4D59B0905F0238
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_0D42714B4E07EE59C224B6AA5BA921EE(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_0D42714B4E07EE59C224B6AA5BA921EE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_DEE9FCD1470CCB102ED91EA81D4E7E1E(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_DEE9FCD1470CCB102ED91EA81D4E7E1E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_E97316F74C131834F52E939615D6EB9F(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_E97316F74C131834F52E939615D6EB9F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_E393F0194FCE38452A8905B4D30BB79F(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_E393F0194FCE38452A8905B4D30BB79F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_AC6E7F4141767F676AB4B7ABB9BCF08B(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_AC6E7F4141767F676AB4B7ABB9BCF08B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_2C87CB004D2625203839959DD2898B0F(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_2C87CB004D2625203839959DD2898B0F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_AE7C675B491AD99BA560EF80DF56A191(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_AE7C675B491AD99BA560EF80DF56A191
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_B234EC8445E906CA1BB3FEA4CF754B26(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_B234EC8445E906CA1BB3FEA4CF754B26
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_17AED0154078A27DA892FB904C2082E8(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_17AED0154078A27DA892FB904C2082E8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_41E16860408AC6C966BA7293316AABA7(); // Function ABP_Bosco.ABP_Bosco_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Bosco_AnimGraphNode_TransitionResult_41E16860408AC6C966BA7293316AABA7
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Bosco.ABP_Bosco_C.BlueprintUpdateAnimation
	void BlueprintInitializeAnimation(); // Function ABP_Bosco.ABP_Bosco_C.BlueprintInitializeAnimation
	void ExecuteUbergraph_ABP_Bosco(int32_t EntryPoint); // Function ABP_Bosco.ABP_Bosco_C.ExecuteUbergraph_ABP_Bosco
};

