// AnimBlueprintGeneratedClass ABP_Refinery.ABP_Refinery_C
// Size: 0xb40 (Inherited: 0x270)
struct UABP_Refinery_C : UFSDRefineryAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x278(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x438(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x460(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x4d8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x550(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x580(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x5f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x628(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x6a0(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x6d0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x718(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x748(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x7c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x7f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x868(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x898(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x910(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x940(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x9b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x9e8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xa60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xa90(0xb0)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_Refinery.ABP_Refinery_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_BF1140244D58CC413D54F6A3AE5F295A(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_BF1140244D58CC413D54F6A3AE5F295A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_EDDD7EE44F4DEC2A804B369E71407983(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_EDDD7EE44F4DEC2A804B369E71407983
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_0A65A9824961E33E599CEF96B5EB7DFC(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_0A65A9824961E33E599CEF96B5EB7DFC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_D7D253B24F1FE6407BC756828FC5E5C1(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_D7D253B24F1FE6407BC756828FC5E5C1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_AD2005BC490D7374134D96856DF2F9A5(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_AD2005BC490D7374134D96856DF2F9A5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_727D1E45471B7D26D1067C90711CF4F7(); // Function ABP_Refinery.ABP_Refinery_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Refinery_AnimGraphNode_TransitionResult_727D1E45471B7D26D1067C90711CF4F7
	void AnimNotify_RocketLaunched(); // Function ABP_Refinery.ABP_Refinery_C.AnimNotify_RocketLaunched
	void ExecuteUbergraph_ABP_Refinery(int32_t EntryPoint); // Function ABP_Refinery.ABP_Refinery_C.ExecuteUbergraph_ABP_Refinery
};

