// AnimBlueprintGeneratedClass ABP_LootBugTest.ABP_LootBugTest_C
// Size: 0xd08 (Inherited: 0x990)
struct UABP_LootBugTest_C : UTestAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x990(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x998(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9c8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x9f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xa68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa98(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb10(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xb88(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc58(0xb0)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_LootBugTest.ABP_LootBugTest_C.AnimGraph
	void ExecuteUbergraph_ABP_LootBugTest(int32_t EntryPoint); // Function ABP_LootBugTest.ABP_LootBugTest_C.ExecuteUbergraph_ABP_LootBugTest
};

