// AnimBlueprintGeneratedClass ABP_WoodlouseNew.ABP_WoodlouseNew_C
// Size: 0x1208 (Inherited: 0x430)
struct UABP_WoodlouseNew_C : UWoodLouseAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x430(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x438(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x4b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x5a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x5d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x5f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x620(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x648(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x670(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6c0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x6e8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7c8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x7f8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x8d8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x908(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x9e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xa18(0x78)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0xa90(0x188)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xc18(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xc48(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xcc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xcf0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xd68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xd98(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xe10(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xe40(0x188)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xfc8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1040(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1070(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1120(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x11c0(0x48)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_WoodlouseNew.ABP_WoodlouseNew_C.AnimGraph
	void ExecuteUbergraph_ABP_WoodlouseNew(int32_t EntryPoint); // Function ABP_WoodlouseNew.ABP_WoodlouseNew_C.ExecuteUbergraph_ABP_WoodlouseNew
};

