// AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C
// Size: 0x690c (Inherited: 0x5e0)
struct UABP_TP_Dwarf_C : UPlayerTPAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5e0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5e8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x6b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x6e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x8c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x8e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x9b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x9d8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0xa00(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0xaa0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xb40(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xc08(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xc50(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xd18(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xd60(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xda8(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xdf0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0xe38(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0xe80(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xf88(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xfa8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xfc8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0xff8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x1098(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x1138(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x11b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x1228(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x12a0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x1360(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x13d8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x1450(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x14f0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1520(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1628(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1730(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1750(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x1770(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x1810(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x18b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x1928(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x19a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x19d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1a48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x1a78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1af0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x1b20(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1b98(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x1bc8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1c10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x1c40(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1cb8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1ce8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1d88(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x1e28(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x1ea0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x1f18(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1f90(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x2050(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x20c8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x2140(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x21e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x2210(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2288(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x22b8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x2330(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x23d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2448(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x2478(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x24f0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x2590(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2608(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x2638(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x26d8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x27e0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2800(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x2820(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x28c0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x2938(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x29d8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x2a78(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x2b18(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x2bb8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x2c30(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2ca8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x2d48(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x2dc0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x2e38(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x2ed8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x2f78(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x2ff0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3068(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x3108(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x3180(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x31f8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x3298(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x3310(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x33b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x3428(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x34a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x3540(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x35b8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3658(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x36f8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x3770(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x37e8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x3888(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x3900(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x3978(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x3a18(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x3ab8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x3b58(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x3bd0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x3c48(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x3ce8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x3d60(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x3dd8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x3e78(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x3f18(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x3f60(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x4000(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x4078(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x4138(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x41b0(0x78)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x4228(0xd0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x42f8(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4330(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4358(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4380(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x43a8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x43d0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4418(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x4448(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4490(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x44c0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4538(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x4568(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x4618(0x78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x4690(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x46b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x47b8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x48c0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x48e0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4958(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x49f8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x4a70(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x4ae8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x4b88(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x4c00(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x4c78(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x4d18(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x4d90(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x4e08(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x4ea8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x4f20(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x4f98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x5038(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x50b0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x5128(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x51c8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5240(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x52b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5358(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x53d0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5448(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x54e8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x5560(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x5600(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5678(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x56f0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x5790(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x5830(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x58d0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5970(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5990(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5a98(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5ab8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5b58(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x5c08(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x5ca8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x5d48(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x5de8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5e88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5eb8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x5f68(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x5fb0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x6050(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x6108(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6130(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x61f0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x6238(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x6280(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x62a8(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x6360(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x63a8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x63f0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6418(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x64b8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x64e0(0x188)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x6668(0x188)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x67f0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x6838(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6880(0x78)
	float StrafeBlendDuration; // 0x68f8(0x04)
	bool LeftFootIKOn; // 0x68fc(0x01)
	char UnknownData_68FD[0x3]; // 0x68fd(0x03)
	struct FVector LeftFootIKLocation; // 0x6900(0x0c)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimGraph
	void AnimNotify_StartBuild(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_StartBuild
	void AnimNotify_EndBuild(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_EndBuild
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintUpdateAnimation
	void BlueprintInitializeAnimation(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintInitializeAnimation
	void AnimNotify_Mine(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_Mine
	void BlueprintBeginPlay(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintBeginPlay
	void ExecuteUbergraph_ABP_TP_Dwarf(int32_t EntryPoint); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.ExecuteUbergraph_ABP_TP_Dwarf
};

