// BlueprintGeneratedClass BP_Azure_UmbraSeeker.BP_Azure_UmbraSeeker_C
// Size: 0x2a8 (Inherited: 0x220)
struct ABP_Azure_UmbraSeeker_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x220(0x08)
	struct UCapsuleComponent* Capsule3; // 0x228(0x08)
	struct UCapsuleComponent* Capsule2; // 0x230(0x08)
	struct UCapsuleComponent* Capsule1; // 0x238(0x08)
	struct USphereComponent* Sphere; // 0x240(0x08)
	struct UCapsuleComponent* Capsule; // 0x248(0x08)
	struct USkeletalMeshComponent* SK_Biome_AzureWeald_Flower_Godetia; // 0x250(0x08)
	struct UTerrainDetectComponent* TerrainDetect; // 0x258(0x08)
	struct USimpleObjectInfoComponent* SimpleObjectInfo; // 0x260(0x08)
	struct UPathfinderCollisionComponent* PathfinderCollision; // 0x268(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x270(0x08)
	struct UAudioComponent* AzureFlowerIdle_Cue; // 0x278(0x08)
	struct UPointLightComponent* PointLight; // 0x280(0x08)
	struct USimpleHealthComponent* SimpleHealth; // 0x288(0x08)
	struct UTerrainPlacementComponent* terrainPlacement; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Biome_AzureWeald_Flower_01; // 0x298(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x2a0(0x08)

	void BndEvt__SimpleHealth_K2Node_ComponentBoundEvent_0_DeathSig__DelegateSignature(struct UHealthComponentBase* HealthComponent); // Function BP_Azure_UmbraSeeker.BP_Azure_UmbraSeeker_C.BndEvt__SimpleHealth_K2Node_ComponentBoundEvent_0_DeathSig__DelegateSignature
	void ExecuteUbergraph_BP_Azure_UmbraSeeker(int32_t EntryPoint); // Function BP_Azure_UmbraSeeker.BP_Azure_UmbraSeeker_C.ExecuteUbergraph_BP_Azure_UmbraSeeker
};

