// BlueprintGeneratedClass BP_DropPod_Base.BP_DropPod_Base_C
// Size: 0x83a (Inherited: 0x368)
struct ABP_DropPod_Base_C : AMiningPod {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x368(0x08)
	struct UAutoCarverComponent* AutoCarverArm; // 0x370(0x08)
	struct UAudioComponent* Audio_Molly_Loadbeam; // 0x378(0x08)
	struct USkeletalMeshComponent* SK_DropPod_DroneBay; // 0x380(0x08)
	struct USkeletalMeshComponent* SK_DropPod_MuleBay; // 0x388(0x08)
	struct UBoxComponent* Ramp_DwarfDetector; // 0x390(0x08)
	struct UPathfinderCollisionComponent* PathfinderWalkable; // 0x398(0x08)
	struct UPathfinderCollisionComponent* PathfinderBlockerDrill_Walk; // 0x3a0(0x08)
	struct UPathfinderCollisionComponent* PathfinderBlockerDrill_Block; // 0x3a8(0x08)
	struct UStaticMeshComponent* Monitor_Right; // 0x3b0(0x08)
	struct UStaticMeshComponent* Monitor_Left; // 0x3b8(0x08)
	struct UStaticMeshComponent* DrillBlocker; // 0x3c0(0x08)
	struct UPointLightComponent* light_filler2; // 0x3c8(0x08)
	struct UPointLightComponent* light_filler1; // 0x3d0(0x08)
	struct UChildActorComponent* Widget_RandomCode6; // 0x3d8(0x08)
	struct UChildActorComponent* Widget_RandomCode5; // 0x3e0(0x08)
	struct UChildActorComponent* Widget_RandomCode4; // 0x3e8(0x08)
	struct UChildActorComponent* Widget_RandomCode3; // 0x3f0(0x08)
	struct UChildActorComponent* Widget_RandomCode1; // 0x3f8(0x08)
	struct UPointLightComponent* light_readySign1; // 0x400(0x08)
	struct USceneComponent* RedLights; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x410(0x08)
	struct UPointLightComponent* light_display4; // 0x418(0x08)
	struct UPointLightComponent* light_display3; // 0x420(0x08)
	struct UStaticMeshComponent* SM_DropPod_ClimbTread; // 0x428(0x08)
	struct UStaticMeshComponent* SM_DropPod_ClimbTread3; // 0x430(0x08)
	struct UStaticMeshComponent* SM_DropPod_ClimbTread2; // 0x438(0x08)
	struct UStaticMeshComponent* SM_DropPod_ClimbTread1; // 0x440(0x08)
	struct USkeletalMeshComponent* OreBox_Left; // 0x448(0x08)
	struct USkeletalMeshComponent* OreBox_Right; // 0x450(0x08)
	struct USkeletalMeshComponent* OreBox_Back; // 0x458(0x08)
	struct UChildActorComponent* BP_TruckerBalls1; // 0x460(0x08)
	struct UChildActorComponent* BP_TruckerBalls; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x498(0x08)
	struct UPointLightComponent* PointLight15; // 0x4a0(0x08)
	struct UPointLightComponent* PointLight14; // 0x4a8(0x08)
	struct UPointLightComponent* PointLight13; // 0x4b0(0x08)
	struct UPointLightComponent* PointLight12; // 0x4b8(0x08)
	struct UPointLightComponent* PointLight11; // 0x4c0(0x08)
	struct UPointLightComponent* PointLight10; // 0x4c8(0x08)
	struct UPointLightComponent* PointLight9; // 0x4d0(0x08)
	struct UPointLightComponent* PointLight8; // 0x4d8(0x08)
	struct UPointLightComponent* PointLight7; // 0x4e0(0x08)
	struct UPointLightComponent* PointLight6; // 0x4e8(0x08)
	struct UPointLightComponent* PointLight5; // 0x4f0(0x08)
	struct UPointLightComponent* PointLight4; // 0x4f8(0x08)
	struct UBoxComponent* InSidePodArea; // 0x500(0x08)
	struct UOxygenSourceComponent* OxygenSource; // 0x508(0x08)
	struct UChildActorComponent* Widget_RandomCode2; // 0x510(0x08)
	struct UChildActorComponent* Widget_RandomCode; // 0x518(0x08)
	struct UChildActorComponent* Widget_MissionData; // 0x520(0x08)
	struct UChildActorComponent* Widget_CaveData; // 0x528(0x08)
	struct UChildActorComponent* Widget_DangerLevel2; // 0x530(0x08)
	struct UChildActorComponent* Widget_DangerLevel; // 0x538(0x08)
	struct UChildActorComponent* Widget_ResourceScreen2; // 0x540(0x08)
	struct UChildActorComponent* Widget_ResourceScreen; // 0x548(0x08)
	struct UAudioComponent* AudioCenter; // 0x550(0x08)
	struct UAudioComponent* AudioBack; // 0x558(0x08)
	struct UAudioComponent* AudioFront; // 0x560(0x08)
	struct UAudioComponent* AudioRight; // 0x568(0x08)
	struct UAudioComponent* AudioLeft; // 0x570(0x08)
	struct UAutoCarverComponent* PrettyCarver; // 0x578(0x08)
	struct UChildActorComponent* Widget_CountDown02; // 0x580(0x08)
	struct UChildActorComponent* Widget_CountDown01; // 0x588(0x08)
	struct UTerrainPlacementComponent* terrainPlacement; // 0x590(0x08)
	struct USphereComponent* KillSphere; // 0x598(0x08)
	struct UBoxComponent* DwarfChecker; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x5c8(0x08)
	struct UPathfinderCollisionComponent* PathfinderBlocker; // 0x5d0(0x08)
	struct UBoxComponent* Box; // 0x5d8(0x08)
	struct USceneComponent* DonkeyReturnDropPosition; // 0x5e0(0x08)
	struct USceneComponent* DonkeySpawnPosition; // 0x5e8(0x08)
	struct USkeletalMeshComponent* Ramp; // 0x5f0(0x08)
	struct UChildActorComponent* BP_Drop_CamShake; // 0x5f8(0x08)
	struct UChildActorComponent* Spawn2; // 0x600(0x08)
	struct UChildActorComponent* Spawn1; // 0x608(0x08)
	struct UChildActorComponent* Spawn4; // 0x610(0x08)
	struct USkeletalMeshComponent* SK_DropPod_Drill; // 0x618(0x08)
	struct UWidgetComponent* Widget_SeatMonitorRight; // 0x620(0x08)
	struct UWidgetComponent* Widget_SeatMonitorLeft; // 0x628(0x08)
	struct UPointLightComponent* PointLight1; // 0x630(0x08)
	struct UPointLightComponent* PointLight; // 0x638(0x08)
	struct USceneComponent* floorCollision; // 0x640(0x08)
	struct UStaticMeshComponent* Spot2; // 0x648(0x08)
	struct UStaticMeshComponent* Spot1; // 0x650(0x08)
	struct USceneComponent* hull; // 0x658(0x08)
	struct USceneComponent* seats; // 0x660(0x08)
	struct USceneComponent* lights_interior; // 0x668(0x08)
	struct USkeletalMeshComponent* SK_DropPod_Airlock; // 0x670(0x08)
	struct UChildActorComponent* Spawn3; // 0x678(0x08)
	struct USimpleObjectInfoComponent* SimpleObjectInfo; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x6b0(0x08)
	struct UStaticMeshComponent* Cone2; // 0x6b8(0x08)
	struct USpotLightComponent* SpotLight2; // 0x6c0(0x08)
	struct USpotLightComponent* SpotLight1; // 0x6c8(0x08)
	struct UStaticMeshComponent* Cone1; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_DropPod_Hull; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_DropPod_Hull_NoCol; // 0x6e0(0x08)
	struct UStaticMeshComponent* Seat_Empty4; // 0x6e8(0x08)
	struct UStaticMeshComponent* Seat_Empty3; // 0x6f0(0x08)
	struct UStaticMeshComponent* Seat_Empty2; // 0x6f8(0x08)
	struct UStaticMeshComponent* Seat_Empty1; // 0x700(0x08)
	struct UPointLightComponent* light_display2; // 0x708(0x08)
	struct UPointLightComponent* light_display1; // 0x710(0x08)
	float Timeline_1_LerpDelay_3C91DA044E3AE316CFE9988822F28BC8; // 0x718(0x04)
	float Timeline_1_Lerp_3C91DA044E3AE316CFE9988822F28BC8; // 0x71c(0x04)
	char Timeline_1__Direction_3C91DA044E3AE316CFE9988822F28BC8; // 0x720(0x01)
	char UnknownData_721[0x7]; // 0x721(0x07)
	struct UTimelineComponent* Timeline_2; // 0x728(0x08)
	float Timeline_5_LerpDelay_BD4E08A7452DF28657A134A2565D0A25; // 0x730(0x04)
	float Timeline_5_Lerp_BD4E08A7452DF28657A134A2565D0A25; // 0x734(0x04)
	char Timeline_5__Direction_BD4E08A7452DF28657A134A2565D0A25; // 0x738(0x01)
	char UnknownData_739[0x7]; // 0x739(0x07)
	struct UTimelineComponent* Timeline_6; // 0x740(0x08)
	float Timeline_0_RedLightIntensity_2F2B1CD4469260DD2E665FA77E175746; // 0x748(0x04)
	char Timeline_0__Direction_2F2B1CD4469260DD2E665FA77E175746; // 0x74c(0x01)
	char UnknownData_74D[0x3]; // 0x74d(0x03)
	struct UTimelineComponent* Timeline_1; // 0x750(0x08)
	float light_readysign_intensity; // 0x758(0x04)
	char UnknownData_75C[0x4]; // 0x75c(0x04)
	struct UAudioComponent* DrillSound; // 0x760(0x08)
	struct AMULE* MuleInstance; // 0x768(0x08)
	struct FTransform MuleTransform; // 0x770(0x30)
	bool MuleSequenceComplete; // 0x7a0(0x01)
	bool OpenDoorsOnLanding; // 0x7a1(0x01)
	bool UnloadMule; // 0x7a2(0x01)
	char UnknownData_7A3[0x5]; // 0x7a3(0x05)
	struct FTimerHandle CarverRotationTimer; // 0x7a8(0x08)
	bool ShouldTurnOnHeadlight; // 0x7b0(0x01)
	bool CanControlHeadlight; // 0x7b1(0x01)
	char DoorState; // 0x7b2(0x01)
	char UnknownData_7B3[0x5]; // 0x7b3(0x05)
	struct UMaterialInstanceDynamic* LightFlickerMaterial; // 0x7b8(0x08)
	struct UParticleSystemComponent* MulebayParticle; // 0x7c0(0x08)
	struct FMulticastInlineDelegate DoorStateChanged; // 0x7c8(0x10)
	char UnknownData_7D8[0x8]; // 0x7d8(0x08)
	struct FTransform MuleUnloadTransform; // 0x7e0(0x30)
	bool MuleBayOpen; // 0x810(0x01)
	char UnknownData_811[0x7]; // 0x811(0x07)
	struct FMulticastInlineDelegate OnMuleBayOpenedDispatch; // 0x818(0x10)
	struct TArray<struct AMULE*> MulesToCollect; // 0x828(0x10)
	bool CarvingComplete; // 0x838(0x01)
	bool MuleWasLoaded; // 0x839(0x01)

	void OnRep_MuleSequenceComplete(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRep_MuleSequenceComplete
	void CollectMule(struct AMULE* MULE); // Function BP_DropPod_Base.BP_DropPod_Base_C.CollectMule
	void OnRep_MuleUnloadTransform(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRep_MuleUnloadTransform
	void GetMuleUnloadTarget(struct AMULE* MULE, struct FTransform RelativeTransform); // Function BP_DropPod_Base.BP_DropPod_Base_C.GetMuleUnloadTarget
	void EnableMulebay(); // Function BP_DropPod_Base.BP_DropPod_Base_C.EnableMulebay
	void OnRep_DoorState(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRep_DoorState
	float OperateMuleBay(bool Open, struct UAnimMontage* Montage); // Function BP_DropPod_Base.BP_DropPod_Base_C.OperateMuleBay
	bool AnyPlayersOnRamp(); // Function BP_DropPod_Base.BP_DropPod_Base_C.AnyPlayersOnRamp
	void HandleRampPhotosensitivity(); // Function BP_DropPod_Base.BP_DropPod_Base_C.HandleRampPhotosensitivity
	void SetPathBlockersEnabled(bool enable); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetPathBlockersEnabled
	void DestroyIfClose(struct TArray<struct AActor*> Actors, float DistanceSQ); // Function BP_DropPod_Base.BP_DropPod_Base_C.DestroyIfClose
	void RemoveDangerousCaveItems(float Distance); // Function BP_DropPod_Base.BP_DropPod_Base_C.RemoveDangerousCaveItems
	void SetAllPlayersAnsel(bool Active); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetAllPlayersAnsel
	struct FVector GetDonkeyReturnPickupLocation(); // Function BP_DropPod_Base.BP_DropPod_Base_C.GetDonkeyReturnPickupLocation
	void SetDoorState(char DoorState); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetDoorState
	void GetCountDown(bool First, struct ABP_Widget_DropPod_AltitudeMeter_C* AsBP Count Down Actor); // Function BP_DropPod_Base.BP_DropPod_Base_C.GetCountDown
	void OnRep_MuleInstance(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRep_MuleInstance
	void OnMuleLoaded(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnMuleLoaded
	void GetMule(struct ADonkeyCharacter* Donkey); // Function BP_DropPod_Base.BP_DropPod_Base_C.GetMule
	void SetStandingDown(bool IsStandingDown); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetStandingDown
	void CloseRamp(); // Function BP_DropPod_Base.BP_DropPod_Base_C.CloseRamp
	void OpenRamp(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OpenRamp
	void OnAllPlayersLeftPod(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnAllPlayersLeftPod
	void SetPreferredCharacter(struct UChildActorComponent* Spawn, struct UPlayerCharacterID* Class); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetPreferredCharacter
	void UserConstructionScript(); // Function BP_DropPod_Base.BP_DropPod_Base_C.UserConstructionScript
	void Timeline_5__FinishedFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_5__FinishedFunc
	void Timeline_5__UpdateFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_5__UpdateFunc
	void Timeline_1__FinishedFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_1__FinishedFunc
	void Timeline_1__UpdateFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_1__UpdateFunc
	void Timeline_0__FinishedFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Timeline_0__UpdateFunc
	void ReceiveBeginPlay(); // Function BP_DropPod_Base.BP_DropPod_Base_C.ReceiveBeginPlay
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function BP_DropPod_Base.BP_DropPod_Base_C.ReceiveActorBeginOverlap
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function BP_DropPod_Base.BP_DropPod_Base_C.ReceiveActorEndOverlap
	void StartDeparture(); // Function BP_DropPod_Base.BP_DropPod_Base_C.StartDeparture
	void OnDroppodImpact(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnDroppodImpact
	void Start Donkey Unload Sequence(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Start Donkey Unload Sequence
	void Unload Donkey(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Unload Donkey
	void OnDrillingStarted(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnDrillingStarted
	void Load Donkey(struct AMULE* MULE); // Function BP_DropPod_Base.BP_DropPod_Base_C.Load Donkey
	void Fade to Black(); // Function BP_DropPod_Base.BP_DropPod_Base_C.Fade to Black
	void BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_DropPod_Base.BP_DropPod_Base_C.BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BP_DropPod_Base.BP_DropPod_Base_C.BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	void BndEvt__KillSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_DropPod_Base.BP_DropPod_Base_C.BndEvt__KillSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void DrillRotate(); // Function BP_DropPod_Base.BP_DropPod_Base_C.DrillRotate
	void OnCharacterEnter(struct APlayerCharacter* Character); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnCharacterEnter
	void OnCharacterExit(struct APlayerCharacter* Character); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnCharacterExit
	void SetMuleInstance(struct ADonkeyCharacter* Donkey); // Function BP_DropPod_Base.BP_DropPod_Base_C.SetMuleInstance
	void DropPodSetAnsel(bool Active); // Function BP_DropPod_Base.BP_DropPod_Base_C.DropPodSetAnsel
	void AllSetAnsel(bool Active); // Function BP_DropPod_Base.BP_DropPod_Base_C.AllSetAnsel
	void BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_DropPod_Base.BP_DropPod_Base_C.BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BP_DropPod_Base.BP_DropPod_Base_C.BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
	void MakeTruckerDicesMove(); // Function BP_DropPod_Base.BP_DropPod_Base_C.MakeTruckerDicesMove
	void OnRep_RampState(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRep_RampState
	void OnFirstPlayerLeftPod(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnFirstPlayerLeftPod
	void ReceiveDestroyed(); // Function BP_DropPod_Base.BP_DropPod_Base_C.ReceiveDestroyed
	void OnRepDoorState(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnRepDoorState
	void LowerMuleToGround(); // Function BP_DropPod_Base.BP_DropPod_Base_C.LowerMuleToGround
	void OpenMuleBay(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OpenMuleBay
	void OnMuleBayOpenedDispatch_Event_1(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnMuleBayOpenedDispatch_Event_1
	void OnGeneratedMissionChanged(struct UGeneratedMission* OutGeneratedMission); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnGeneratedMissionChanged
	void ExecuteUbergraph_BP_DropPod_Base(int32_t EntryPoint); // Function BP_DropPod_Base.BP_DropPod_Base_C.ExecuteUbergraph_BP_DropPod_Base
	void OnMuleBayOpenedDispatch__DelegateSignature(); // Function BP_DropPod_Base.BP_DropPod_Base_C.OnMuleBayOpenedDispatch__DelegateSignature
	void DoorStateChanged__DelegateSignature(char DoorState); // Function BP_DropPod_Base.BP_DropPod_Base_C.DoorStateChanged__DelegateSignature
};

