// BlueprintGeneratedClass BP_EscortMule.BP_EscortMule_C
// Size: 0x8dd (Inherited: 0x490)
struct ABP_EscortMule_C : AEscortMule {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x490(0x08)
	struct UBoxComponent* Collision_Drill_Pawn; // 0x498(0x08)
	struct USceneComponent* ForwardTracePointTop; // 0x4a0(0x08)
	struct UBoxComponent* Collision_Platform1; // 0x4a8(0x08)
	struct UBoxComponent* Collision_Platform; // 0x4b0(0x08)
	struct UAutoCarverComponent* AutoCarverSmall; // 0x4b8(0x08)
	struct UAutoCarverComponent* AutoCarverbig; // 0x4c0(0x08)
	struct USceneComponent* CarverRoot; // 0x4c8(0x08)
	struct UNiagaraComponent* P_LTracks; // 0x4d0(0x08)
	struct UNiagaraComponent* P_RTracks; // 0x4d8(0x08)
	struct UNiagaraComponent* P_LeftBoxDamagedLow; // 0x4e0(0x08)
	struct UNiagaraComponent* P_LeftBoxDamagedHigh; // 0x4e8(0x08)
	struct UNiagaraComponent* P_LeftBoxDamagedMedium; // 0x4f0(0x08)
	struct USceneComponent* LeftBoxParticleNormal; // 0x4f8(0x08)
	struct UNiagaraComponent* P_RightBoxDamagedHigh; // 0x500(0x08)
	struct UNiagaraComponent* P_RightBoxDamagedLow; // 0x508(0x08)
	struct UNiagaraComponent* P_RightBoxDamagedMedium; // 0x510(0x08)
	struct USceneComponent* RightBoxParticleNormal; // 0x518(0x08)
	struct USceneComponent* LeftBoxParticleMainBody; // 0x520(0x08)
	struct USceneComponent* RightBoxParticleMainBody; // 0x528(0x08)
	struct UNiagaraComponent* EngineStoppedSmoke; // 0x530(0x08)
	struct UPointLightComponent* Box_Light_L; // 0x538(0x08)
	struct UPointLightComponent* Box_Light_R; // 0x540(0x08)
	struct UPointLightComponent* PointLight6; // 0x548(0x08)
	struct UPointLightComponent* PointLight5; // 0x550(0x08)
	struct UNiagaraComponent* JetFlame; // 0x558(0x08)
	struct USceneComponent* impactLocation; // 0x560(0x08)
	struct UNiagaraComponent* P_DrillHeartstone; // 0x568(0x08)
	struct USkeletalMeshComponent* Mesh_DrillHead; // 0x570(0x08)
	struct USceneComponent* DrillRotator; // 0x578(0x08)
	struct UNiagaraComponent* ExhaustRight; // 0x580(0x08)
	struct UNiagaraComponent* ExhaustLeft; // 0x588(0x08)
	struct UWidgetComponent* Widget_Canister2; // 0x590(0x08)
	struct UWidgetComponent* Widget_Canister1; // 0x598(0x08)
	struct USpotLightComponent* SpotLight3; // 0x5a0(0x08)
	struct UStaticMeshComponent* Cone3; // 0x5a8(0x08)
	struct UStaticMeshComponent* Cone2; // 0x5b0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x5b8(0x08)
	struct USceneComponent* SpotlightRight; // 0x5c0(0x08)
	struct USceneComponent* SpotlightLeft; // 0x5c8(0x08)
	struct UStaticMeshComponent* DrillDozerGuts_Right; // 0x5d0(0x08)
	struct UStaticMeshComponent* DrillDozerGuts_Left; // 0x5d8(0x08)
	struct UBoxComponent* Collision_RepairBoxBody; // 0x5e0(0x08)
	struct UPointLightComponent* Red Button Light; // 0x5e8(0x08)
	struct UPointLightComponent* DorettaPointLight; // 0x5f0(0x08)
	struct USpotLightComponent* Doretta_SpotLight; // 0x5f8(0x08)
	struct UStaticMeshComponent* Doretta_Cone; // 0x600(0x08)
	struct UStaticMeshComponent* SM_WallLamp_004; // 0x608(0x08)
	struct UPointLightComponent* PointLight2; // 0x610(0x08)
	struct UBoxComponent* Achievement_Riding_Collider; // 0x618(0x08)
	struct USphereComponent* Collision_Drill_Damage; // 0x620(0x08)
	struct UBoxComponent* Colission_Doretta; // 0x628(0x08)
	struct UInstantUsable* PetDorettaUsable; // 0x630(0x08)
	struct USceneComponent* FlameHover; // 0x638(0x08)
	struct UAudioComponent* Drilldozer_JetEngine_Start_Cue; // 0x640(0x08)
	struct UAudioComponent* Drilldozer_JetEninge_Cue; // 0x648(0x08)
	struct UChildActorComponent* OxygenTank01; // 0x650(0x08)
	struct UOxygenSourceComponent* OxygenSource; // 0x658(0x08)
	struct USkeletalMeshComponent* Cannister_02; // 0x660(0x08)
	struct USkeletalMeshComponent* Cannister_01; // 0x668(0x08)
	struct UWidgetComponent* Widget_Button; // 0x670(0x08)
	struct USphereComponent* UseSphere_Activate; // 0x678(0x08)
	struct USceneComponent* ButtonRoot; // 0x680(0x08)
	struct UNiagaraComponent* P_Drill; // 0x688(0x08)
	struct UBoxComponent* Collision_RepairBoxLeft; // 0x690(0x08)
	struct UBoxComponent* Collision_RepairBoxRight; // 0x698(0x08)
	struct USkeletalMeshComponent* RepairBoxRight; // 0x6a0(0x08)
	struct USkeletalMeshComponent* RepairBoxLeft; // 0x6a8(0x08)
	struct UOutlineComponent* outline; // 0x6b0(0x08)
	struct UBoxComponent* FearBox; // 0x6b8(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x6c0(0x08)
	struct UAudioComponent* DrillingVehicle_DrillingShell_Cue; // 0x6c8(0x08)
	struct UChildActorComponent* RTrack; // 0x6d0(0x08)
	struct UChildActorComponent* LTrack; // 0x6d8(0x08)
	struct USceneComponent* DrillHeadRoot; // 0x6e0(0x08)
	struct UDamageComponent* WeakpointDestroyedDamage; // 0x6e8(0x08)
	struct UDamageComponent* DrillDamage; // 0x6f0(0x08)
	struct UEscortMuleAttackerPositioning* EscortMuleAttackerPositioning; // 0x6f8(0x08)
	struct UAudioComponent* Engine_Cue; // 0x700(0x08)
	struct UAudioComponent* DrillHead_Cue; // 0x708(0x08)
	struct USceneComponent* ForwardTracePoint; // 0x710(0x08)
	struct UPointLightComponent* CannisterLight2; // 0x718(0x08)
	struct UPointLightComponent* CannisterLight1; // 0x720(0x08)
	struct USphereComponent* Sphere2; // 0x728(0x08)
	struct USphereComponent* Sphere1; // 0x730(0x08)
	struct UBP_EscortCannisterUsable_C* Cannister2Usable; // 0x738(0x08)
	struct UBP_EscortCannisterUsable_C* Cannister1Usable; // 0x740(0x08)
	struct UAudioComponent* DrillVehicle_RubbleSoftB_Cue; // 0x748(0x08)
	struct UAudioComponent* DrillVehicle_RubbleSoftA_Cue; // 0x750(0x08)
	struct UAudioComponent* DrillVehicleTrack2_Cue; // 0x758(0x08)
	struct UAudioComponent* Rubble_Cue; // 0x760(0x08)
	struct UAudioComponent* DrillVehicleTrack1_Cue; // 0x768(0x08)
	struct UPointLightComponent* PointLight1; // 0x770(0x08)
	struct UStaticMeshComponent* SM_WallLamp_003; // 0x778(0x08)
	struct USceneComponent* Center; // 0x780(0x08)
	struct USceneComponent* CarverScaler; // 0x788(0x08)
	struct URadarPointComponent* radarPoint; // 0x790(0x08)
	struct UStaticMeshComponent* TerrainScannerMesh; // 0x798(0x08)
	struct UPathfinderCollisionComponent* PathfinderCollision; // 0x7a0(0x08)
	struct USceneComponent* CarvParticleLocation; // 0x7a8(0x08)
	struct USingleUsableComponent* ActivateMachineUsable; // 0x7b0(0x08)
	struct UContinuousUsableComponent* ContinuousUsable; // 0x7b8(0x08)
	float Timeline_MoveDrillOut_Delta_1A396ACD40DA3371D46E58AD5DAAFC92; // 0x7c0(0x04)
	char Timeline_MoveDrillOut__Direction_1A396ACD40DA3371D46E58AD5DAAFC92; // 0x7c4(0x01)
	char UnknownData_7C5[0x3]; // 0x7c5(0x03)
	struct UTimelineComponent* Timeline_MoveDrillOut; // 0x7c8(0x08)
	float MoveCloser_Alpha_E35B04D84FB5313C58E2E18AE68DA5A2; // 0x7d0(0x04)
	char MoveCloser__Direction_E35B04D84FB5313C58E2E18AE68DA5A2; // 0x7d4(0x01)
	char UnknownData_7D5[0x3]; // 0x7d5(0x03)
	struct UTimelineComponent* MoveCloser; // 0x7d8(0x08)
	struct FVector HammerDrillTest_DrillHead_MoveVectorV2_FAAD5F0B4630F8F53E3DFB9B966534B9; // 0x7e0(0x0c)
	float HammerDrillTest_Hammer_FAAD5F0B4630F8F53E3DFB9B966534B9; // 0x7ec(0x04)
	char HammerDrillTest__Direction_FAAD5F0B4630F8F53E3DFB9B966534B9; // 0x7f0(0x01)
	char UnknownData_7F1[0x7]; // 0x7f1(0x07)
	struct UTimelineComponent* HammerDrillTest; // 0x7f8(0x08)
	struct FMulticastInlineDelegate ResourceFull; // 0x800(0x10)
	struct UEscortObjective* EscortObj; // 0x810(0x08)
	enum class EEscortMissionState State; // 0x818(0x01)
	char UnknownData_819[0x7]; // 0x819(0x07)
	struct UAudioComponent* Sound_Moving; // 0x820(0x08)
	struct UAudioComponent* Sound_Drilling; // 0x828(0x08)
	bool UnderAttack; // 0x830(0x01)
	char UnknownData_831[0x7]; // 0x831(0x07)
	struct UPrimitiveComponent* ActiveRepairCollider; // 0x838(0x08)
	struct FVector StartLoc; // 0x840(0x0c)
	struct FVector EndLoc; // 0x84c(0x0c)
	enum class EEscortMissionState oldState; // 0x858(0x01)
	char UnknownData_859[0x3]; // 0x859(0x03)
	float LastDamageSoundTime; // 0x85c(0x04)
	bool DrillPaused; // 0x860(0x01)
	char UnknownData_861[0x7]; // 0x861(0x07)
	struct UABP_DrillDozer_Drill_C* DrillHeadAnimBP; // 0x868(0x08)
	struct USkeletalMeshComponent* ActiveRepairMesh; // 0x870(0x08)
	struct FTimerHandle NotRepairedEvent; // 0x878(0x08)
	struct UHUDWarningWidget* HUDWarning; // 0x880(0x08)
	struct UHUDWarningWidget* HUDCellDestroyWarning; // 0x888(0x08)
	bool LastHoverTest; // 0x890(0x01)
	char UnknownData_891[0x3]; // 0x891(0x03)
	int32_t EnemiesKilled; // 0x894(0x04)
	struct UFSDAchievement* DrillByShooting; // 0x898(0x08)
	struct UMaterialInstanceDynamic* LeftBoxMaterial; // 0x8a0(0x08)
	struct UMaterialInstanceDynamic* RightBoxMaterial; // 0x8a8(0x08)
	struct UMaterialInstanceDynamic* BodyMaterial; // 0x8b0(0x08)
	bool DoRotateInterpOnServer; // 0x8b8(0x01)
	char UnknownData_8B9[0x3]; // 0x8b9(0x03)
	float DrillRotateSpeed; // 0x8bc(0x04)
	struct UNiagaraComponent* EngineStopSmoke; // 0x8c0(0x08)
	struct FMulticastInlineDelegate EscortStateChanged; // 0x8c8(0x10)
	int32_t MaxAttackersOmoranFight; // 0x8d8(0x04)
	bool IsPathReady; // 0x8dc(0x01)

	void RepComponentDamage(); // Function BP_EscortMule.BP_EscortMule_C.RepComponentDamage
	void UpdateRepairBoxLook(); // Function BP_EscortMule.BP_EscortMule_C.UpdateRepairBoxLook
	void UpdateBoxDamageEmitter(struct UNiagaraComponent* ParticlesLow, struct UNiagaraComponent* ParticlesMedium, struct UNiagaraComponent* ParticlesHigh, float HealthPercent); // Function BP_EscortMule.BP_EscortMule_C.UpdateBoxDamageEmitter
	void SetBothCannistersVisibility(bool IsVisible); // Function BP_EscortMule.BP_EscortMule_C.SetBothCannistersVisibility
	void IsFriendlyFire(struct AActor* Object, bool bSuccess); // Function BP_EscortMule.BP_EscortMule_C.IsFriendlyFire
	void OnRep_DrillPaused(); // Function BP_EscortMule.BP_EscortMule_C.OnRep_DrillPaused
	void TryPlayDamageSound(struct FVector Location); // Function BP_EscortMule.BP_EscortMule_C.TryPlayDamageSound
	void Update Moving FX(enum class EEscortMissionState InState); // Function BP_EscortMule.BP_EscortMule_C.Update Moving FX
	void SetupParticleMaterials(); // Function BP_EscortMule.BP_EscortMule_C.SetupParticleMaterials
	void HandleCannisterUsed(struct APlayerCharacter* User, struct UInstantUsable* Usable); // Function BP_EscortMule.BP_EscortMule_C.HandleCannisterUsed
	void CreateCanister(struct UInstantUsable* NewItem_Usable, struct USkinnedMeshComponent* MeshComponent, struct UWidgetComponent* Widget); // Function BP_EscortMule.BP_EscortMule_C.CreateCanister
	bool GetIsTargetable(); // Function BP_EscortMule.BP_EscortMule_C.GetIsTargetable
	struct FVector GetTargetCenterMass(); // Function BP_EscortMule.BP_EscortMule_C.GetTargetCenterMass
	struct UHealthComponentBase* GetTargetHealthComponent(); // Function BP_EscortMule.BP_EscortMule_C.GetTargetHealthComponent
	void UserConstructionScript(); // Function BP_EscortMule.BP_EscortMule_C.UserConstructionScript
	void HammerDrillTest__FinishedFunc(); // Function BP_EscortMule.BP_EscortMule_C.HammerDrillTest__FinishedFunc
	void HammerDrillTest__UpdateFunc(); // Function BP_EscortMule.BP_EscortMule_C.HammerDrillTest__UpdateFunc
	void HammerDrillTest__HitEvents__EventFunc(); // Function BP_EscortMule.BP_EscortMule_C.HammerDrillTest__HitEvents__EventFunc
	void MoveCloser__FinishedFunc(); // Function BP_EscortMule.BP_EscortMule_C.MoveCloser__FinishedFunc
	void MoveCloser__UpdateFunc(); // Function BP_EscortMule.BP_EscortMule_C.MoveCloser__UpdateFunc
	void Timeline_MoveDrillOut__FinishedFunc(); // Function BP_EscortMule.BP_EscortMule_C.Timeline_MoveDrillOut__FinishedFunc
	void Timeline_MoveDrillOut__UpdateFunc(); // Function BP_EscortMule.BP_EscortMule_C.Timeline_MoveDrillOut__UpdateFunc
	void OnNotifyEnd_654993624EF7011EBE481AB20B9D51EC(struct FName NotifyName); // Function BP_EscortMule.BP_EscortMule_C.OnNotifyEnd_654993624EF7011EBE481AB20B9D51EC
	void OnNotifyBegin_654993624EF7011EBE481AB20B9D51EC(struct FName NotifyName); // Function BP_EscortMule.BP_EscortMule_C.OnNotifyBegin_654993624EF7011EBE481AB20B9D51EC
	void OnInterrupted_654993624EF7011EBE481AB20B9D51EC(struct FName NotifyName); // Function BP_EscortMule.BP_EscortMule_C.OnInterrupted_654993624EF7011EBE481AB20B9D51EC
	void OnBlendOut_654993624EF7011EBE481AB20B9D51EC(struct FName NotifyName); // Function BP_EscortMule.BP_EscortMule_C.OnBlendOut_654993624EF7011EBE481AB20B9D51EC
	void OnCompleted_654993624EF7011EBE481AB20B9D51EC(struct FName NotifyName); // Function BP_EscortMule.BP_EscortMule_C.OnCompleted_654993624EF7011EBE481AB20B9D51EC
	void ReceiveBeginPlay(); // Function BP_EscortMule.BP_EscortMule_C.ReceiveBeginPlay
	void ReceiveTick(float DeltaSeconds); // Function BP_EscortMule.BP_EscortMule_C.ReceiveTick
	void BndEvt__ContinuousUsable_K2Node_ComponentBoundEvent_1_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__ContinuousUsable_K2Node_ComponentBoundEvent_1_UsedBySignature__DelegateSignature
	void OnObjectiveStateChanged(enum class EEscortMissionState NewState); // Function BP_EscortMule.BP_EscortMule_C.OnObjectiveStateChanged
	void BndEvt__StartMachineUsable_K2Node_ComponentBoundEvent_2_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__StartMachineUsable_K2Node_ComponentBoundEvent_2_UsedBySignature__DelegateSignature
	void BndEvt__StartMachineUsable_K2Node_ComponentBoundEvent_3_UsableChangedSignature__DelegateSignature(bool canUse); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__StartMachineUsable_K2Node_ComponentBoundEvent_3_UsableChangedSignature__DelegateSignature
	void StateChanged(enum class EEscortMissionState State); // Function BP_EscortMule.BP_EscortMule_C.StateChanged
	void EngineStartFX(); // Function BP_EscortMule.BP_EscortMule_C.EngineStartFX
	void EngineStopFX(); // Function BP_EscortMule.BP_EscortMule_C.EngineStopFX
	void RefuelCompleteFx(); // Function BP_EscortMule.BP_EscortMule_C.RefuelCompleteFx
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_5_DamageSig__DelegateSignature(float amount); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_5_DamageSig__DelegateSignature
	void DrillingAtDestinationFx(); // Function BP_EscortMule.BP_EscortMule_C.DrillingAtDestinationFx
	void ShellCrackedFx(); // Function BP_EscortMule.BP_EscortMule_C.ShellCrackedFx
	void RefreshPathfindingCollision(); // Function BP_EscortMule.BP_EscortMule_C.RefreshPathfindingCollision
	void VehicleDestroyedFx(); // Function BP_EscortMule.BP_EscortMule_C.VehicleDestroyedFx
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_6_HealthChangedSig__DelegateSignature(float Health); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_6_HealthChangedSig__DelegateSignature
	void BndEvt__Cannister1Usable_K2Node_ComponentBoundEvent_7_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Cannister1Usable_K2Node_ComponentBoundEvent_7_UsedBySignature__DelegateSignature
	void BndEvt__Cannister2Usable_K2Node_ComponentBoundEvent_8_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Cannister2Usable_K2Node_ComponentBoundEvent_8_UsedBySignature__DelegateSignature
	void OnExtractorSlotChanged(struct FEscortMuleExtractorSlot Slot, int32_t Index); // Function BP_EscortMule.BP_EscortMule_C.OnExtractorSlotChanged
	void ChechHover(); // Function BP_EscortMule.BP_EscortMule_C.ChechHover
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_4_HealthSegmentChange__DelegateSignature(int32_t currSegment, int32_t prevSegment); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_4_HealthSegmentChange__DelegateSignature
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Sphere_K2Node_ComponentBoundEvent_11_ComponentBeginOverlapSignature__DelegateSignature
	void SetActiveRepair(struct UPrimitiveComponent* Collider, struct USkeletalMeshComponent* ActiveRepairMest); // Function BP_EscortMule.BP_EscortMule_C.SetActiveRepair
	void ExplodeRepair(struct USkeletalMeshComponent* Collider); // Function BP_EscortMule.BP_EscortMule_C.ExplodeRepair
	void ShellCracked(int32_t numberOfShellsCracked); // Function BP_EscortMule.BP_EscortMule_C.ShellCracked
	void OnRep_IsCarvingTunnel(); // Function BP_EscortMule.BP_EscortMule_C.OnRep_IsCarvingTunnel
	void UpdateCarvingState(); // Function BP_EscortMule.BP_EscortMule_C.UpdateCarvingState
	void SetDrillAtTargetActive(bool IsActive); // Function BP_EscortMule.BP_EscortMule_C.SetDrillAtTargetActive
	void SetDrillCooldown(float Seconds); // Function BP_EscortMule.BP_EscortMule_C.SetDrillCooldown
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_10_BodypartHitSig__DelegateSignature(float amount, float BaseAmount, struct UPrimitiveComponent* Component, struct UFSDPhysicalMaterial* PhysMat, struct FName BoneName); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_10_BodypartHitSig__DelegateSignature
	void TryDamageSound(struct AActor* Attacker); // Function BP_EscortMule.BP_EscortMule_C.TryDamageSound
	void ShowDamageEffects(struct UParticleSystem* Particles, struct FVector Location, struct FRotator Orientation); // Function BP_EscortMule.BP_EscortMule_C.ShowDamageEffects
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_12_HitSig__DelegateSignature(float Damage, struct UDamageClass* DamageClass, struct AActor* DamageCauser, bool anyHealthLost); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_12_HitSig__DelegateSignature
	void All_PlayDamageSound(struct FVector_NetQuantize Location); // Function BP_EscortMule.BP_EscortMule_C.All_PlayDamageSound
	void SpawnDamageEffects(struct UParticleSystem* EmitterTemplate, struct FVector_NetQuantize Location, struct FRotator Rotation); // Function BP_EscortMule.BP_EscortMule_C.SpawnDamageEffects
	void BndEvt__HealthComponent_K2Node_ComponentBoundEvent_9_DamageSig__DelegateSignature(float amount); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__HealthComponent_K2Node_ComponentBoundEvent_9_DamageSig__DelegateSignature
	void CheckRepair(); // Function BP_EscortMule.BP_EscortMule_C.CheckRepair
	void BndEvt__Achievement_Collider_K2Node_ComponentBoundEvent_13_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Achievement_Collider_K2Node_ComponentBoundEvent_13_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__Achievement_Collider_K2Node_ComponentBoundEvent_14_ComponentEndOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__Achievement_Collider_K2Node_ComponentBoundEvent_14_ComponentEndOverlapSignature__DelegateSignature
	void On Damage Enemy While Riding(struct TScriptInterface<None> EnemyHealth, float Damage, float DamageModifier, float HealthRemaining, bool IsWeakPoint, bool IsRadial); // Function BP_EscortMule.BP_EscortMule_C.On Damage Enemy While Riding
	void BndEvt__PetDorettaUsable_K2Node_ComponentBoundEvent_15_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_EscortMule.BP_EscortMule_C.BndEvt__PetDorettaUsable_K2Node_ComponentBoundEvent_15_UsedBySignature__DelegateSignature
	void All_PlayPetAnimation(); // Function BP_EscortMule.BP_EscortMule_C.All_PlayPetAnimation
	void TestDorettaHead(); // Function BP_EscortMule.BP_EscortMule_C.TestDorettaHead
	void PathIsReady(); // Function BP_EscortMule.BP_EscortMule_C.PathIsReady
	void SetButtonUsable(bool canUse); // Function BP_EscortMule.BP_EscortMule_C.SetButtonUsable
	void OnCheat_SetMuleSpeed(float FloatValue); // Function BP_EscortMule.BP_EscortMule_C.OnCheat_SetMuleSpeed
	void ExecuteUbergraph_BP_EscortMule(int32_t EntryPoint); // Function BP_EscortMule.BP_EscortMule_C.ExecuteUbergraph_BP_EscortMule
	void EscortStateChanged__DelegateSignature(enum class EEscortMissionState State); // Function BP_EscortMule.BP_EscortMule_C.EscortStateChanged__DelegateSignature
	void ResourceFull__DelegateSignature(); // Function BP_EscortMule.BP_EscortMule_C.ResourceFull__DelegateSignature
};

