// BlueprintGeneratedClass BP_Gem_Jadiz.BP_Gem_Jadiz_C
// Size: 0x378 (Inherited: 0x321)
struct ABP_Gem_Jadiz_C : ABP_Gem_C {
	char UnknownData_321[0x7]; // 0x321(0x07)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x08)
	struct UAudioComponent* GemJadizIdle_Cue; // 0x330(0x08)
	struct UGemTracker* GemTracker; // 0x338(0x08)
	struct UPointLightComponent* PointLight6; // 0x340(0x08)
	struct UPointLightComponent* PointLight5; // 0x348(0x08)
	struct UPointLightComponent* PointLight4; // 0x350(0x08)
	struct UPointLightComponent* PointLight3; // 0x358(0x08)
	struct UPointLightComponent* PointLight2; // 0x360(0x08)
	struct UPointLightComponent* PointLight1; // 0x368(0x08)
	struct UPointLightComponent* PointLight; // 0x370(0x08)

	void All_PlayDugFree(); // Function BP_Gem_Jadiz.BP_Gem_Jadiz_C.All_PlayDugFree
	void ExecuteUbergraph_BP_Gem_Jadiz(int32_t EntryPoint); // Function BP_Gem_Jadiz.BP_Gem_Jadiz_C.ExecuteUbergraph_BP_Gem_Jadiz
};

