// BlueprintGeneratedClass BP_Hoxxes01.BP_Hoxxes01_C
// Size: 0x484 (Inherited: 0x220)
struct ABP_Hoxxes01_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x220(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part73; // 0x228(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part71; // 0x230(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part70; // 0x238(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part69; // 0x240(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part68; // 0x248(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part67; // 0x250(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part66; // 0x258(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part65; // 0x260(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part64; // 0x268(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part63; // 0x270(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part62; // 0x278(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part61; // 0x280(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part60; // 0x288(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part59; // 0x290(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part58; // 0x298(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part57; // 0x2a0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part56; // 0x2a8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part55; // 0x2b0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part54; // 0x2b8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part53; // 0x2c0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part52; // 0x2c8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part51; // 0x2d0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part50; // 0x2d8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part49; // 0x2e0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part48; // 0x2e8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part47; // 0x2f0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part46; // 0x2f8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part45; // 0x300(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part44; // 0x308(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part43; // 0x310(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part42; // 0x318(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part41; // 0x320(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part40; // 0x328(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part39; // 0x330(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part38; // 0x338(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part37; // 0x340(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part36; // 0x348(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part72; // 0x350(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part34; // 0x358(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part33; // 0x360(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part32; // 0x368(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part31; // 0x370(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part30; // 0x378(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part29; // 0x380(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part28; // 0x388(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part27; // 0x390(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part26; // 0x398(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part25; // 0x3a0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part24; // 0x3a8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part23; // 0x3b0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part22; // 0x3b8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part21; // 0x3c0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part20; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part19; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part18; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part17; // 0x3e0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part16; // 0x3e8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part15; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part14; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part13; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part12; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part11; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part10; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part09; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part08; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part07; // 0x430(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part06; // 0x438(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part05; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part04; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part03; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part02; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part01; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Hoxxes_Part35; // 0x468(0x08)
	struct USceneComponent* PlanetParts; // 0x470(0x08)
	struct USceneComponent* Scene; // 0x478(0x08)
	float Scale; // 0x480(0x04)

	void UserConstructionScript(); // Function BP_Hoxxes01.BP_Hoxxes01_C.UserConstructionScript
	void ReceiveBeginPlay(); // Function BP_Hoxxes01.BP_Hoxxes01_C.ReceiveBeginPlay
	void ExecuteUbergraph_BP_Hoxxes01(int32_t EntryPoint); // Function BP_Hoxxes01.BP_Hoxxes01_C.ExecuteUbergraph_BP_Hoxxes01
};

