// BlueprintGeneratedClass BP_Refinery.BP_Refinery_C
// Size: 0x630 (Inherited: 0x398)
struct ABP_Refinery_C : AFSDRefinery {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x398(0x08)
	struct UPathfinderCollisionComponent* PB_ButtonConsole; // 0x3a0(0x08)
	struct UPathfinderCollisionComponent* PB_UnderMainPlatform2; // 0x3a8(0x08)
	struct USkeletalMeshComponent* Refinery; // 0x3b0(0x08)
	struct USceneComponent* RespawnPoint; // 0x3b8(0x08)
	struct UCapsuleComponent* Capsule; // 0x3c0(0x08)
	struct USpotLightComponent* SpotLight; // 0x3c8(0x08)
	struct USphereComponent* HeatSource; // 0x3d0(0x08)
	struct UOutlineComponent* outline; // 0x3d8(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp06; // 0x3e0(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp08; // 0x3e8(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp07; // 0x3f0(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp05; // 0x3f8(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp02; // 0x400(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp04; // 0x408(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp03; // 0x410(0x08)
	struct UChildActorComponent* BP_Refinery_RocketLamp01; // 0x418(0x08)
	struct UChildActorComponent* BP_Refinery_Lamp04; // 0x420(0x08)
	struct UPointLightComponent* PointLight4; // 0x428(0x08)
	struct UChildActorComponent* BP_Refinery_Lamp03; // 0x430(0x08)
	struct UChildActorComponent* BP_Refinery_Lamp02; // 0x438(0x08)
	struct UChildActorComponent* BP_Refinery_Lamp01; // 0x440(0x08)
	struct UChildActorComponent* OxygenTank01; // 0x448(0x08)
	struct UChildActorComponent* OxygenTank03; // 0x450(0x08)
	struct UChildActorComponent* OxygenAudio; // 0x458(0x08)
	struct UChildActorComponent* OxygenTank02; // 0x460(0x08)
	struct UOxygenSourceComponent* OxygenSource; // 0x468(0x08)
	struct USphereComponent* KillSphere; // 0x470(0x08)
	struct UWidgetComponent* UseButtonWidget; // 0x478(0x08)
	struct UWidgetComponent* UseButtonMonitor; // 0x480(0x08)
	struct UStaticMeshComponent* UseButton; // 0x488(0x08)
	struct UChildActorComponent* BP_Refinery_ProjectorLight3; // 0x490(0x08)
	struct UChildActorComponent* BP_Refinery_ProjectorLight2; // 0x498(0x08)
	struct UChildActorComponent* BP_Refinery_ProjectorLight1; // 0x4a0(0x08)
	struct UAudioComponent* AudioDropStarted; // 0x4a8(0x08)
	struct USceneComponent* AudioRoot; // 0x4b0(0x08)
	struct UChildActorComponent* BP_Depositor_02; // 0x4b8(0x08)
	struct UChildActorComponent* BP_Depositor_01; // 0x4c0(0x08)
	struct USceneComponent* Active Refining Particles; // 0x4c8(0x08)
	struct UPathfinderCollisionComponent* PB_BottomPlatform; // 0x4d0(0x08)
	struct UPathfinderCollisionComponent* PB_Ramp03; // 0x4d8(0x08)
	struct UPathfinderCollisionComponent* PB_Ramp02; // 0x4e0(0x08)
	struct UPathfinderCollisionComponent* PB_Ramp01; // 0x4e8(0x08)
	struct UPathfinderCollisionComponent* PB_UnderMainPlatform; // 0x4f0(0x08)
	struct UPathfinderCollisionComponent* PB_Rocket; // 0x4f8(0x08)
	struct UPathfinderCollisionComponent* PC_BottomPlatform; // 0x500(0x08)
	struct UPathfinderCollisionComponent* PC_Ramp03; // 0x508(0x08)
	struct UPathfinderCollisionComponent* PC_Ramp02; // 0x510(0x08)
	struct UPathfinderCollisionComponent* PC_Ramp01; // 0x518(0x08)
	struct UPathfinderCollisionComponent* PC_MainPlatform; // 0x520(0x08)
	struct USceneComponent* PathfinderBlockers; // 0x528(0x08)
	struct UChildActorComponent* BP_Refinery_WarningLight3; // 0x530(0x08)
	struct UChildActorComponent* BP_Refinery_WarningLight2; // 0x538(0x08)
	struct UChildActorComponent* BP_Refinery_WarningLight1; // 0x540(0x08)
	struct UChildActorComponent* ProgressBar03; // 0x548(0x08)
	struct UChildActorComponent* ProgressBar02; // 0x550(0x08)
	struct UChildActorComponent* ProgressBar01; // 0x558(0x08)
	struct UTerrainScannerStaticMesh* TerrainScannerStaticMesh; // 0x560(0x08)
	struct UTerrainPlacementComponent* TerrainPlacement1; // 0x568(0x08)
	struct USphereComponent* UseButtonCollider; // 0x570(0x08)
	struct UMeshCarverComponent* MeshCarver; // 0x578(0x08)
	struct UChildActorComponent* PipeStart03; // 0x580(0x08)
	struct UChildActorComponent* PipeStart02; // 0x588(0x08)
	struct UChildActorComponent* PipeStart01; // 0x590(0x08)
	struct USpawnActorWithDebrisPosComponent* SpawnTarget; // 0x598(0x08)
	struct UPointLightComponent* PointLight3; // 0x5a0(0x08)
	struct UPointLightComponent* PointLight2; // 0x5a8(0x08)
	struct UPointLightComponent* PointLight1; // 0x5b0(0x08)
	struct UPointLightComponent* PointLight; // 0x5b8(0x08)
	struct USimpleObjectInfoComponent* SimpleObjectInfo; // 0x5c0(0x08)
	struct UActorTrackingComponent* ActorTracking; // 0x5c8(0x08)
	struct UTerrainPlacementComponent* terrainPlacement; // 0x5d0(0x08)
	struct USkeletalMeshComponent* Drill; // 0x5d8(0x08)
	struct UEnemyWaveController* ActiveRefiningWave; // 0x5e0(0x08)
	struct TArray<struct APipelineStart*> CompletedPipelines; // 0x5e8(0x10)
	struct UEnemyWaveController* ActiveRefiningWaveConstant; // 0x5f8(0x08)
	struct ABP_Refinery_LandingZone_C* LandinZoneInstance; // 0x600(0x08)
	struct UAudioComponent* DrillingSoundInstance; // 0x608(0x08)
	struct UParticleSystemComponent* DrillParticles01; // 0x610(0x08)
	struct UParticleSystemComponent* DrillParticles02; // 0x618(0x08)
	struct TArray<struct APlayerCharacter*> DeadPlayers; // 0x620(0x10)

	bool IsDeepDive(); // Function BP_Refinery.BP_Refinery_C.IsDeepDive
	void Spawn Landing Zone(); // Function BP_Refinery.BP_Refinery_C.Spawn Landing Zone
	void CheckPipelineMissionShout(struct APipelineStart* InPipelineStart, enum class EPipelineBuildState InPipelineState); // Function BP_Refinery.BP_Refinery_C.CheckPipelineMissionShout
	void ActivatePathfinderBlockers(); // Function BP_Refinery.BP_Refinery_C.ActivatePathfinderBlockers
	void UserConstructionScript(); // Function BP_Refinery.BP_Refinery_C.UserConstructionScript
	void OnDroppodImpact(); // Function BP_Refinery.BP_Refinery_C.OnDroppodImpact
	void ReceiveRefineryStateChanged(enum class ERefineryState InState); // Function BP_Refinery.BP_Refinery_C.ReceiveRefineryStateChanged
	void EnemiesOnStateChanged(); // Function BP_Refinery.BP_Refinery_C.EnemiesOnStateChanged
	void ReceiveBeginPlay(); // Function BP_Refinery.BP_Refinery_C.ReceiveBeginPlay
	void Mission Shouts on State Changed(); // Function BP_Refinery.BP_Refinery_C.Mission Shouts on State Changed
	void ReceivePipelineStateChanged(struct APipelineStart* InPipeline, enum class EPipelineBuildState InState); // Function BP_Refinery.BP_Refinery_C.ReceivePipelineStateChanged
	void BndEvt__UsableStartRefining_K2Node_ComponentBoundEvent_0_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_Refinery.BP_Refinery_C.BndEvt__UsableStartRefining_K2Node_ComponentBoundEvent_0_UsedBySignature__DelegateSignature
	void OnDrillingStarted(); // Function BP_Refinery.BP_Refinery_C.OnDrillingStarted
	void AudioOnStateChanged(); // Function BP_Refinery.BP_Refinery_C.AudioOnStateChanged
	void OnDropStartedGFX(); // Function BP_Refinery.BP_Refinery_C.OnDropStartedGFX
	void OnDropImpactGFX(); // Function BP_Refinery.BP_Refinery_C.OnDropImpactGFX
	void SetupUseButtonUI(); // Function BP_Refinery.BP_Refinery_C.SetupUseButtonUI
	void BndEvt__KillSphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_Refinery.BP_Refinery_C.BndEvt__KillSphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__HeatSource_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BP_Refinery.BP_Refinery_C.BndEvt__HeatSource_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__HeatSource_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BP_Refinery.BP_Refinery_C.BndEvt__HeatSource_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	void CameraShakeOnStateChange(); // Function BP_Refinery.BP_Refinery_C.CameraShakeOnStateChange
	void OnObjectivesCompleted_Event_1(); // Function BP_Refinery.BP_Refinery_C.OnObjectivesCompleted_Event_1
	void BndEvt__UsableStartRefining_K2Node_ComponentBoundEvent_2_UsableChangedSignature__DelegateSignature(bool canUse); // Function BP_Refinery.BP_Refinery_C.BndEvt__UsableStartRefining_K2Node_ComponentBoundEvent_2_UsableChangedSignature__DelegateSignature
	void BndEvt__UsableLaunchRocket_K2Node_ComponentBoundEvent_3_UsableChangedSignature__DelegateSignature(bool canUse); // Function BP_Refinery.BP_Refinery_C.BndEvt__UsableLaunchRocket_K2Node_ComponentBoundEvent_3_UsableChangedSignature__DelegateSignature
	void UpdateUseIcon(); // Function BP_Refinery.BP_Refinery_C.UpdateUseIcon
	void ExecuteUbergraph_BP_Refinery(int32_t EntryPoint); // Function BP_Refinery.BP_Refinery_C.ExecuteUbergraph_BP_Refinery
};

