// BlueprintGeneratedClass BP_UnknownArtifact.BP_UnknownArtifact_C
// Size: 0x394 (Inherited: 0x321)
struct ABP_UnknownArtifact_C : ABP_Gem_C {
	char UnknownData_321[0x7]; // 0x321(0x07)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x08)
	struct UOutlineComponent* outline; // 0x330(0x08)
	struct UPointLightComponent* PointLight6; // 0x338(0x08)
	struct UPointLightComponent* PointLight5; // 0x340(0x08)
	struct UPointLightComponent* PointLight4; // 0x348(0x08)
	struct UPointLightComponent* PointLight3; // 0x350(0x08)
	struct UPointLightComponent* PointLight2; // 0x358(0x08)
	struct UPointLightComponent* PointLight1; // 0x360(0x08)
	struct UPointLightComponent* light_center; // 0x368(0x08)
	float Timeline_0_NewTrack_0_26F6B6C743C5284D0A49D79127722B1A; // 0x370(0x04)
	char Timeline_0__Direction_26F6B6C743C5284D0A49D79127722B1A; // 0x374(0x01)
	char UnknownData_375[0x3]; // 0x375(0x03)
	struct UTimelineComponent* Timeline_1; // 0x378(0x08)
	float LightIntensity; // 0x380(0x04)
	struct FLinearColor LightColor; // 0x384(0x10)

	void Timeline_0__FinishedFunc(); // Function BP_UnknownArtifact.BP_UnknownArtifact_C.Timeline_0__FinishedFunc
	void Timeline_0__UpdateFunc(); // Function BP_UnknownArtifact.BP_UnknownArtifact_C.Timeline_0__UpdateFunc
	void ReceiveBeginPlay(); // Function BP_UnknownArtifact.BP_UnknownArtifact_C.ReceiveBeginPlay
	void All_PlayDugFree(); // Function BP_UnknownArtifact.BP_UnknownArtifact_C.All_PlayDugFree
	void ExecuteUbergraph_BP_UnknownArtifact(int32_t EntryPoint); // Function BP_UnknownArtifact.BP_UnknownArtifact_C.ExecuteUbergraph_BP_UnknownArtifact
};

