// BlueprintGeneratedClass BP_XharCustomizationConsole.BP_XharCustomizationConsole_C
// Size: 0x2a0 (Inherited: 0x220)
struct ABP_XharCustomizationConsole_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x220(0x08)
	struct UWidgetComponent* Widget3; // 0x228(0x08)
	struct UStaticMeshComponent* Mesh_Monitor4; // 0x230(0x08)
	struct UWidgetComponent* Widget1; // 0x238(0x08)
	struct UStaticMeshComponent* Mesh_Monitor2; // 0x240(0x08)
	struct UStaticMeshComponent* Mesh_LockerLeft1; // 0x248(0x08)
	struct UStaticMeshComponent* Mesh_LockerRight1; // 0x250(0x08)
	struct UChildActorComponent* ChildActor; // 0x258(0x08)
	struct UStaticMeshComponent* Mesh_LockerRight; // 0x260(0x08)
	struct UStaticMeshComponent* Mesh_LockerLeft; // 0x268(0x08)
	struct UWidgetComponent* Widget; // 0x270(0x08)
	struct UStaticMeshComponent* Mesh_Monitor; // 0x278(0x08)
	struct UTextRenderComponent* TextRender; // 0x280(0x08)
	struct UBoxComponent* InteractionCollider; // 0x288(0x08)
	struct UInstantUsable* InstantUsable; // 0x290(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x298(0x08)

	void ReceiveBeginPlay(); // Function BP_XharCustomizationConsole.BP_XharCustomizationConsole_C.ReceiveBeginPlay
	void BndEvt__InstantUsable_K2Node_ComponentBoundEvent_0_UsedBySignature__DelegateSignature(struct APlayerCharacter* User); // Function BP_XharCustomizationConsole.BP_XharCustomizationConsole_C.BndEvt__InstantUsable_K2Node_ComponentBoundEvent_0_UsedBySignature__DelegateSignature
	void ExecuteUbergraph_BP_XharCustomizationConsole(int32_t EntryPoint); // Function BP_XharCustomizationConsole.BP_XharCustomizationConsole_C.ExecuteUbergraph_BP_XharCustomizationConsole
};

