// Class FSD.AcceptInviteBlueprintCallProxy
// Size: 0x88 (Inherited: 0x30)
struct UAcceptInviteBlueprintCallProxy : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct UObject* WorldContextObject; // 0x50(0x08)
	char UnknownData_58[0x30]; // 0x58(0x30)

	struct UAcceptInviteBlueprintCallProxy* AcceptInvite(struct UObject* WorldContextObject, struct FString ListName, struct FString userId); // Function FSD.AcceptInviteBlueprintCallProxy.AcceptInvite
};

// Class FSD.Objective
// Size: 0x150 (Inherited: 0xb0)
struct UObjective : UActorComponent {
	struct FMulticastInlineDelegate OnObjectiveUpdated; // 0xb0(0x10)
	char UnknownData_C0[0x8]; // 0xc0(0x08)
	struct UObjectiveWidget* ObjectiveWidgetClass; // 0xc8(0x08)
	struct FMissionShouts MissionShouts; // 0xd0(0x38)
	struct FText MissionDescription; // 0x108(0x18)
	int32_t CompletionRewardInCredits; // 0x120(0x04)
	int32_t CompletionRewardInXP; // 0x124(0x04)
	bool ScaleObjectiveToMission; // 0x128(0x01)
	bool RequiredReturnObjectiveCompleted; // 0x129(0x01)
	char UnknownData_12A[0x6]; // 0x12a(0x06)
	struct UMissionStat* ObjectiveCompletedStat; // 0x130(0x08)
	int32_t IsPrimaryObjective; // 0x138(0x04)
	float MissionScale; // 0x13c(0x04)
	struct TArray<struct UBiome*> BannedInBiomes; // 0x140(0x10)

	void SignalObjectiveUpdated(); // Function FSD.Objective.SignalObjectiveUpdated
	void Receive_StartTracking(); // Function FSD.Objective.Receive_StartTracking
	void OnRep_IsPrimaryObjective(); // Function FSD.Objective.OnRep_IsPrimaryObjective
	bool IsTutorialObjective(); // Function FSD.Objective.IsTutorialObjective
	bool IsPrimary(); // Function FSD.Objective.IsPrimary
	bool IsObjectiveResource(struct UResourceData* InResource); // Function FSD.Objective.IsObjectiveResource
	bool IsFinalBattle(); // Function FSD.Objective.IsFinalBattle
	bool IsCompleted(); // Function FSD.Objective.IsCompleted
	bool HasReplicated(); // Function FSD.Objective.HasReplicated
	struct UObjectiveWidget* GetWidgetClassOrDefault(struct UObjectiveWidget* DefaultWidgetClass); // Function FSD.Objective.GetWidgetClassOrDefault
	int32_t GetRewardXP(); // Function FSD.Objective.GetRewardXP
	struct FCreditsReward GetRewardCredits(); // Function FSD.Objective.GetRewardCredits
	struct UOptionalObjectiveWidget* GetOptionalMissionWidget(); // Function FSD.Objective.GetOptionalMissionWidget
	struct FText GetObjectiveText(); // Function FSD.Objective.GetObjectiveText
	struct FObjectiveMissionIcon GetObjectiveMissionIconFromClass(struct UObjective* objectiveClass); // Function FSD.Objective.GetObjectiveMissionIconFromClass
	struct UTexture2D* GetObjectiveIconFromClass(struct UObjective* objectiveClass); // Function FSD.Objective.GetObjectiveIconFromClass
	struct UTexture2D* GetObjectiveIcon(); // Function FSD.Objective.GetObjectiveIcon
	struct FText GetObjectiveDescriptionFromClass(struct UObjective* objectiveClass, float missionLength); // Function FSD.Objective.GetObjectiveDescriptionFromClass
	struct FText GetObjectiveDescription(float missionLength); // Function FSD.Objective.GetObjectiveDescription
	int32_t GetObjectiveAmountFromClass(struct UObjective* objectiveClass, float missionLength); // Function FSD.Objective.GetObjectiveAmountFromClass
	int32_t GetObjectiveAmount(float missionLength); // Function FSD.Objective.GetObjectiveAmount
	struct FObjectiveMissionIcon GetMissionIcon(); // Function FSD.Objective.GetMissionIcon
	struct FText GetInMissionText(); // Function FSD.Objective.GetInMissionText
	struct FText GetInMissionCounterText(); // Function FSD.Objective.GetInMissionCounterText
	struct UTexture2D* GetInMissionCounterIcon(); // Function FSD.Objective.GetInMissionCounterIcon
};

// Class FSD.ActivationOjective
// Size: 0x158 (Inherited: 0x150)
struct UActivationOjective : UObjective {
	int32_t ObjectivesFound; // 0x150(0x04)
	int32_t ObjectivesToFind; // 0x154(0x04)

	void OnRep_ObjectivesToFind(int32_t prevAmount); // Function FSD.ActivationOjective.OnRep_ObjectivesToFind
	void OnRep_ObjectivesFound(int32_t prevAmount); // Function FSD.ActivationOjective.OnRep_ObjectivesFound
};

// Class FSD.ActivationObject
// Size: 0x230 (Inherited: 0x220)
struct AActivationObject : AActor {
	struct USingleUsableComponent* Usable; // 0x220(0x08)
	bool HasBeenUsed; // 0x228(0x01)
	char UnknownData_229[0x7]; // 0x229(0x07)

	void OnUsedBy(struct APlayerCharacter* User); // Function FSD.ActivationObject.OnUsedBy
};

// Class FSD.ActorFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActorFunctionLibrary : UBlueprintFunctionLibrary {

	void UnlockSpecificCharacters(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters, enum class ECharacterState UnlockIf, enum class ECharacterState UnlockTo); // Function FSD.ActorFunctionLibrary.UnlockSpecificCharacters
	void UnlockCharacters(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.UnlockCharacters
	float TimeSince(struct UObject* WorldContextObject, float Time); // Function FSD.ActorFunctionLibrary.TimeSince
	void SetScalarParameters(struct FName ParameterName, float Value, struct TArray<struct UMaterialInstanceDynamic*> Materials); // Function FSD.ActorFunctionLibrary.SetScalarParameters
	void PlayCueOnClient(struct APlayerController* Target, struct USoundCue* cue); // Function FSD.ActorFunctionLibrary.PlayCueOnClient
	void PlayCueOnAll(struct UObject* WorldContextObject, struct USoundCue* cue); // Function FSD.ActorFunctionLibrary.PlayCueOnAll
	float PingPong(float Time, float Length, bool normalize); // Function FSD.ActorFunctionLibrary.PingPong
	float MoveTowards(float current, float End, float step); // Function FSD.ActorFunctionLibrary.MoveTowards
	void LockSpecificCharactersIfState(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters, enum class ECharacterState stateToLock); // Function FSD.ActorFunctionLibrary.LockSpecificCharactersIfState
	void LockSpecificCharacters(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters); // Function FSD.ActorFunctionLibrary.LockSpecificCharacters
	bool LockSpecificCharacterIfState(struct UObject* WorldContextObject, struct APlayerCharacter* Character, enum class ECharacterState LockIf, enum class ECharacterState LockTo); // Function FSD.ActorFunctionLibrary.LockSpecificCharacterIfState
	void LockCharacters(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.LockCharacters
	struct UWindowWidget* LoadWindowWidgetClass(SoftClassProperty WidgetClass); // Function FSD.ActorFunctionLibrary.LoadWindowWidgetClass
	struct UUserWidget* LoadWidgetClass(SoftClassProperty WidgetClass); // Function FSD.ActorFunctionLibrary.LoadWidgetClass
	struct UObject* LoadClass(SoftClassProperty softReference); // Function FSD.ActorFunctionLibrary.LoadClass
	void KillActorWithEffects(struct AActor* Actor, struct USceneComponent* visualsToHide, struct USoundCue* deathSound, struct UFXSystemAsset* deathParticles, float particleScale, struct UPathfinderCollisionComponent* pathColliderToDisable); // Function FSD.ActorFunctionLibrary.KillActorWithEffects
	bool IsWeakPoint(struct UFSDPhysicalMaterial* Material); // Function FSD.ActorFunctionLibrary.IsWeakPoint
	bool IsSingleplayer(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.IsSingleplayer
	bool IsInRangeOfLocalPlayer(struct AActor* toActor, float MinDistance, float MaxDistance); // Function FSD.ActorFunctionLibrary.IsInRangeOfLocalPlayer
	bool IsCloseToLocalPlayer(struct AActor* toActor, float Distance); // Function FSD.ActorFunctionLibrary.IsCloseToLocalPlayer
	int32_t GetTotalHeroLevels(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetTotalHeroLevels
	struct FGuid GetSaveGameIDFromCharacterID(struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetSaveGameIDFromCharacterID
	struct FGuid GetSavegameID(struct UObject* objectClass); // Function FSD.ActorFunctionLibrary.GetSavegameID
	struct TArray<struct APlayerCharacter*> GetPlayersInRange(struct UObject* WorldContextObject, struct FVector Origin, float Radius, bool MustBeAlive); // Function FSD.ActorFunctionLibrary.GetPlayersInRange
	int32_t GetPlayerCount(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.GetPlayerCount
	struct UItemID* GetItemID(struct AActor* itemClass); // Function FSD.ActorFunctionLibrary.GetItemID
	float GetHeroXP(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroXP
	struct FText GetHeroSwitchToMessage(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroSwitchToMessage
	struct FString GetHeroSourceName(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroSourceName
	float GetHeroProgress(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroProgress
	struct FText GetHeroName(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroName
	int32_t GetHeroLevel(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroLevel
	struct UInventoryList* GetHeroInventoryList(struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroInventoryList
	struct FHeroInfo GetHeroInfo(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroInfo
	struct UTexture2D* GetHeroImageSmall(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImageSmall
	struct UTexture2D* GetHeroImageFullSize(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImageFullSize
	struct UTexture2D* GetHeroImage(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImage
	struct FLinearColor GetHeroColor(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroColor
	struct UActorComponent* GetComponentFromClass(struct AActor* Actor, struct UActorComponent* ComponentClass); // Function FSD.ActorFunctionLibrary.GetComponentFromClass
	struct UActorComponent* GetComponentByClass(struct AActor* Actor, struct UActorComponent* ComponentClass); // Function FSD.ActorFunctionLibrary.GetComponentByClass
	struct UPlayerCharacterID* GetCharacterIDFromCharacter(struct APlayerCharacter* Character); // Function FSD.ActorFunctionLibrary.GetCharacterIDFromCharacter
	struct UPlayerCharacterID* GetCharacterID(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetCharacterID
	struct TArray<struct APlayerCharacter*> GetAllPlayerCharacters(struct UObject* WorldContext); // Function FSD.ActorFunctionLibrary.GetAllPlayerCharacters
	struct FVector GetActorTargetCenter(struct AActor* TargetActor); // Function FSD.ActorFunctionLibrary.GetActorTargetCenter
	void FSDRemoveBlendable(struct UPostProcessComponent* PostProcessComponent, struct TScriptInterface<None> InBlendableObject); // Function FSD.ActorFunctionLibrary.FSDRemoveBlendable
	void FSDRemoveAllWidgets(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.FSDRemoveAllWidgets
	void FSDDumpCallStack(struct FString Msg); // Function FSD.ActorFunctionLibrary.FSDDumpCallStack
	struct APlayerCharacter* FindNearestPlayerCharacter(struct UObject* WorldContextObject, struct FVector fromLocation, float MaxRadius, bool MustBeAlive, bool MustBeUnparalyzed, bool MustHaveLineOfSight); // Function FSD.ActorFunctionLibrary.FindNearestPlayerCharacter
	struct FVector FindLatejoinDroppodLocation(struct AFSDGameMode* GameMode); // Function FSD.ActorFunctionLibrary.FindLatejoinDroppodLocation
	struct AActor* FindClosestEnemyFromLocation(struct FVector fromLocation, float Range, bool LineOfSightCheck, struct UObject* WorldContextObject, struct FVector Offset); // Function FSD.ActorFunctionLibrary.FindClosestEnemyFromLocation
	struct AActor* FindClosestEnemyFromActor(struct AActor* FromActor, float Range, bool LineOfSightCheck, struct FGameplayTagQuery tagQuery, struct FVector Offset); // Function FSD.ActorFunctionLibrary.FindClosestEnemyFromActor
	void FadeMaterials(struct UObject* WorldContextObject, struct UMeshComponent* Mesh, float Duration); // Function FSD.ActorFunctionLibrary.FadeMaterials
	float EvaluateRuntimeCurve(struct UObject* WorldContextObject, struct FRuntimeFloatCurve Curve, float Time); // Function FSD.ActorFunctionLibrary.EvaluateRuntimeCurve
	void DamagePlayersInArea(struct FVector Origin, struct AActor* Instigator, float Damage, float Radius, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamagePlayersInArea
	struct UHealthComponentBase* DamageIfInRange(float MaxDistance, float Damage, struct AActor* Target, struct AActor* Attacker, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageIfInRange
	void DamageAllInAreaExcept(struct FVector Origin, struct AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, struct TArray<struct AActor*> IgnoreActors, float friendlyFireModifier, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageAllInAreaExcept
	void DamageAllInArea(struct FVector Origin, struct AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, float friendlyFireModifier, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageAllInArea
	struct TArray<struct UMaterialInstanceDynamic*> CreateDynamicMaterialInstances(struct UMeshComponent* Mesh); // Function FSD.ActorFunctionLibrary.CreateDynamicMaterialInstances
	float AddHeroXP(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID, float amount); // Function FSD.ActorFunctionLibrary.AddHeroXP
	void AddEnemyKill(struct APlayerCharacter* Instigator, struct UEnemyComponent* EnemyComponent, struct AFSDGameState* GameState); // Function FSD.ActorFunctionLibrary.AddEnemyKill
	bool ActorMatchesTagQuery(struct FGameplayTagQuery Query, struct AActor* InActor); // Function FSD.ActorFunctionLibrary.ActorMatchesTagQuery
};

// Class FSD.StatusEffectsFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UStatusEffectsFunctionLibrary : UBlueprintFunctionLibrary {

	float GetMaxResistance(struct UStatusEffect* StatusEffect); // Function FSD.StatusEffectsFunctionLibrary.GetMaxResistance
	struct UDamageClass* GetDamageClass(struct UStatusEffect* StatusEffect); // Function FSD.StatusEffectsFunctionLibrary.GetDamageClass
	bool CanTrigger(struct UStatusEffect* StatusEffect, struct AActor* OtherActor); // Function FSD.StatusEffectsFunctionLibrary.CanTrigger
};

// Class FSD.FrontendBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFrontendBlueprintLibrary : UBlueprintFunctionLibrary {

	void OpenURLInExternalBrowser(struct FString URL); // Function FSD.FrontendBlueprintLibrary.OpenURLInExternalBrowser
	bool IsShippingBuild(); // Function FSD.FrontendBlueprintLibrary.IsShippingBuild
	enum class EFSDTargetPlatform FSDTargetPlatform(); // Function FSD.FrontendBlueprintLibrary.FSDTargetPlatform
};

// Class FSD.GameModeFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UGameModeFunctionLibrary : UBlueprintFunctionLibrary {

	struct FTransform FindRandomEscapePodLocation(struct UObject* WorldContextObject); // Function FSD.GameModeFunctionLibrary.FindRandomEscapePodLocation
	struct FTransform FindEscapePodLocationAtDistance(struct UObject* WorldContextObject, float Distance, float aboveDistanceBias, struct AActor* optionalFrom); // Function FSD.GameModeFunctionLibrary.FindEscapePodLocationAtDistance
};

// Class FSD.FSDConversionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFSDConversionLibrary : UBlueprintFunctionLibrary {

	struct FVector_NetQuantizeNormal VectorToNetQuantizeNormal(struct FVector Vec); // Function FSD.FSDConversionLibrary.VectorToNetQuantizeNormal
	struct FVector_NetQuantize VectorToNetQuantize(struct FVector Vec); // Function FSD.FSDConversionLibrary.VectorToNetQuantize
	struct FVector QuatToVector(struct FQuat Quat); // Function FSD.FSDConversionLibrary.QuatToVector
	struct FRotator QuatToRotator(struct FQuat Quat); // Function FSD.FSDConversionLibrary.QuatToRotator
	struct FVector_NetQuantizeNormal QuadToNetQuantizeNormal(struct FQuat Quat); // Function FSD.FSDConversionLibrary.QuadToNetQuantizeNormal
	struct FVector ComponentToWorldLocation(struct USceneComponent* Component); // Function FSD.FSDConversionLibrary.ComponentToWorldLocation
	struct FVector ActorToWorldLocation(struct AActor* Actor); // Function FSD.FSDConversionLibrary.ActorToWorldLocation
};

// Class FSD.ActorStateComponent
// Size: 0x100 (Inherited: 0xb0)
struct UActorStateComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBeginState; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnTickState; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnEndState; // 0xd0(0x10)
	struct UActorStateComponent* CurrentState; // 0xe0(0x08)
	struct UActorStateComponent* NextState; // 0xe8(0x08)
	struct UActorStateComponent* MasterState; // 0xf0(0x08)
	float StateActiveTime; // 0xf8(0x04)
	char UnknownData_FC[0x4]; // 0xfc(0x04)

	void OnRep_CurrentState(struct UActorStateComponent* PreviousState); // Function FSD.ActorStateComponent.OnRep_CurrentState
	bool IsStateActive(); // Function FSD.ActorStateComponent.IsStateActive
	void GotoState(); // Function FSD.ActorStateComponent.GotoState
};

// Class FSD.FSDUserWidget
// Size: 0x250 (Inherited: 0x230)
struct UFSDUserWidget : UUserWidget {
	struct FMulticastInlineDelegate OnVisibilityChanged; // 0x230(0x10)
	char UnknownData_240[0x8]; // 0x240(0x08)
	struct APlayerCharacter* Character; // 0x248(0x08)

	void SetOpacity(float alpha); // Function FSD.FSDUserWidget.SetOpacity
	void ScaleByBaseResolution(); // Function FSD.FSDUserWidget.ScaleByBaseResolution
	void Refresh(); // Function FSD.FSDUserWidget.Refresh
	void ReceiveNewVisibility(enum class ESlateVisibility NewVisibility); // Function FSD.FSDUserWidget.ReceiveNewVisibility
	void OnCloseMenuReleased(bool Handled); // Function FSD.FSDUserWidget.OnCloseMenuReleased
	void OnCloseMenuPressed(bool Handled); // Function FSD.FSDUserWidget.OnCloseMenuPressed
	bool HasCharacter(); // Function FSD.FSDUserWidget.HasCharacter
	float GetOpacity(); // Function FSD.FSDUserWidget.GetOpacity
	struct AFSDPlayerState* GetFSDPlayerState(); // Function FSD.FSDUserWidget.GetFSDPlayerState
	struct AItem* GetEquippedItem(); // Function FSD.FSDUserWidget.GetEquippedItem
	float GetBaseResolutionScale(); // Function FSD.FSDUserWidget.GetBaseResolutionScale
	void BP_OnRefresh(); // Function FSD.FSDUserWidget.BP_OnRefresh
};

// Class FSD.ActorTrackingWidget
// Size: 0x278 (Inherited: 0x250)
struct UActorTrackingWidget : UFSDUserWidget {
	struct FWeakObjectPtr<struct USceneComponent> TargetComponent; // 0x250(0x08)
	float WorldHeightOffset; // 0x258(0x04)
	float ScaleBy; // 0x25c(0x04)
	struct FMargin ScreenMargin; // 0x260(0x10)
	int32_t WidgetZOrder; // 0x270(0x04)
	bool bTrackCenterOfMass; // 0x274(0x01)
	char UnknownData_275[0x3]; // 0x275(0x03)

	void SetTargetComponent(struct USceneComponent* Component); // Function FSD.ActorTrackingWidget.SetTargetComponent
	void SetTarget(struct AActor* Actor); // Function FSD.ActorTrackingWidget.SetTarget
	void OnTargetSet(struct AActor* NewTarget); // Function FSD.ActorTrackingWidget.OnTargetSet
	void OnTargetDistanceChanged(float Distance); // Function FSD.ActorTrackingWidget.OnTargetDistanceChanged
	void OnShow(); // Function FSD.ActorTrackingWidget.OnShow
	void OnInViewChanged(bool inView, float Angle); // Function FSD.ActorTrackingWidget.OnInViewChanged
	struct AActor* GetTarget(); // Function FSD.ActorTrackingWidget.GetTarget
	struct FVector2D GetRenderTranslation(); // Function FSD.ActorTrackingWidget.GetRenderTranslation
	bool FindScreenPosition(struct APlayerController* PlayerController, struct FVector WorldLocation, struct FMargin Margin, struct FVector ScreenCord, float Angle); // Function FSD.ActorTrackingWidget.FindScreenPosition
	struct UActorTrackingWidget* CreateTrackingWidget(struct APlayerController* PlayerController, struct UActorTrackingWidget* WidgetType, struct USceneComponent* TargetComponent); // Function FSD.ActorTrackingWidget.CreateTrackingWidget
};

// Class FSD.ActorTrackingComponent
// Size: 0x210 (Inherited: 0x1f0)
struct UActorTrackingComponent : USceneComponent {
	struct UActorTrackingWidget* WidgetType; // 0x1f0(0x08)
	bool VisibleOnHoldTAB; // 0x1f8(0x01)
	bool VisibleFromStart; // 0x1f9(0x01)
	bool bIconHidden; // 0x1fa(0x01)
	char UnknownData_1FB[0x1]; // 0x1fb(0x01)
	struct FWeakObjectPtr<struct UActorTrackingWidget> Widget; // 0x1fc(0x08)
	char UnknownData_204[0xc]; // 0x204(0x0c)

	void ToggleIcon(bool Visible); // Function FSD.ActorTrackingComponent.ToggleIcon
	void OnHoldTAB(bool IsDown); // Function FSD.ActorTrackingComponent.OnHoldTAB
	bool IsIconVisible(); // Function FSD.ActorTrackingComponent.IsIconVisible
};

// Class FSD.AdicPuddle
// Size: 0x248 (Inherited: 0x220)
struct AAdicPuddle : AActor {
	struct USphereComponent* SphereTrigger; // 0x220(0x08)
	struct USoundBase* SpawnSound; // 0x228(0x08)
	struct UStatusEffect* InflictedStatusEffect; // 0x230(0x08)
	char UnknownData_238[0x8]; // 0x238(0x08)
	float LifeTime; // 0x240(0x04)
	char UnknownData_244[0x4]; // 0x244(0x04)

	void OnPuddleEndOverLap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FSD.AdicPuddle.OnPuddleEndOverLap
	void OnPuddleBeginOverLap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function FSD.AdicPuddle.OnPuddleBeginOverLap
};

// Class FSD.AdventureObjective
// Size: 0x150 (Inherited: 0x150)
struct UAdventureObjective : UObjective {
};

// Class FSD.AfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UAfflictionEffect : UObject {

	bool ShouldInstantiate(); // Function FSD.AfflictionEffect.ShouldInstantiate
	void ReceiveEndEffect(struct UPawnAfflictionComponent* Target); // Function FSD.AfflictionEffect.ReceiveEndEffect
	void ReceiveBeginEffect(struct UPawnAfflictionComponent* Target); // Function FSD.AfflictionEffect.ReceiveBeginEffect
};

// Class FSD.PawnFrozenUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnFrozenUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.PawnBurningUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnBurningUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SpawnAtLocationParticleAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct USpawnAtLocationParticleAfflictionEffect : UAfflictionEffect {
	struct FScaledEffect ScaledParticleEffect; // 0x28(0x10)
};

// Class FSD.AttachedParticlesAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct UAttachedParticlesAfflictionEffect : UAfflictionEffect {
	struct UFXSystemAsset* ParticleEffect; // 0x28(0x08)
	struct TArray<struct UFXSystemAsset*> ParticleEffects; // 0x30(0x10)
	enum class EAfflictionSocket Socket; // 0x40(0x01)
	bool ScaleToActor; // 0x41(0x01)
	bool UseVisibilityHack; // 0x42(0x01)
	char UnknownData_43[0x5]; // 0x43(0x05)
};

// Class FSD.CharacterShoutAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCharacterShoutAfflictionEffect : UAfflictionEffect {
	struct UDialogDataAsset* Shout; // 0x28(0x08)
};

// Class FSD.CameraParticleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCameraParticleAfflictionEffect : UAfflictionEffect {
	struct UParticleSystem* ParticleEffect; // 0x28(0x08)
};

// Class FSD.ShieldLinkedAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UShieldLinkedAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SoundAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct USoundAfflictionEffect : UAfflictionEffect {
	struct USoundCue* BeginSound; // 0x28(0x08)
	struct USoundCue* EndSound; // 0x30(0x08)
	bool Attach; // 0x38(0x01)
	char UnknownData_39[0x3]; // 0x39(0x03)
	struct FName AttachBone; // 0x3c(0x08)
	float FadeOnLoopEndDuration; // 0x44(0x04)
};

// Class FSD.AttachMeshesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAttachMeshesAfflictionEffect : UAfflictionEffect {
	struct TArray<struct FAttachMeshesAfflictionItem> AttachItems; // 0x28(0x10)
	struct UParticleSystem* OnRemoveEffect; // 0x38(0x08)
};

// Class FSD.FrozenAfflictionEffect
// Size: 0x58 (Inherited: 0x28)
struct UFrozenAfflictionEffect : UAfflictionEffect {
	struct TArray<struct FFrozenAfflictionItem> IceParts; // 0x28(0x10)
	struct UMaterialInterface* MaterialOverride; // 0x38(0x08)
	struct FName ParticleBone; // 0x40(0x08)
	struct TArray<struct UMaterialInterface*> IceMaterials; // 0x48(0x10)
};

// Class FSD.BurningAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UBurningAfflictionEffect : UAfflictionEffect {
	enum class EFrozenBitsSize FireParticleSize; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
};

// Class FSD.StaggeredAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UStaggeredAfflictionEffect : UAfflictionEffect {
	float StaggerStrength; // 0x28(0x04)
	char UnknownData_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.BoneParticlesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UBoneParticlesAfflictionEffect : UAfflictionEffect {
	struct TArray<struct UParticleSystem*> Particles; // 0x28(0x10)
	struct USoundCue* Sound; // 0x38(0x08)
};

// Class FSD.AnimatedItemParticleAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAnimatedItemParticleAfflictionEffect : UAfflictionEffect {
	enum class EItemCategory ItemCategory; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
	struct UParticleSystem* ParticleEffect; // 0x30(0x08)
	struct FName Socket; // 0x38(0x08)
};

// Class FSD.PlayerCharacterMontageAfflictionEffect
// Size: 0x50 (Inherited: 0x28)
struct UPlayerCharacterMontageAfflictionEffect : UAfflictionEffect {
	struct UAnimMontage* FP_Montage; // 0x28(0x08)
	struct UAnimMontage* TP_Montage; // 0x30(0x08)
	float BlendOut; // 0x38(0x04)
	char UnknownData_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FName> RandomStarts; // 0x40(0x10)
};

// Class FSD.EnemySkinAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct UEnemySkinAfflictionEffect : UAfflictionEffect {
	struct TArray<struct UMaterialInterface*> NewMaterials; // 0x28(0x10)
};

// Class FSD.EnemyScaleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UEnemyScaleAfflictionEffect : UAfflictionEffect {
	float Scale; // 0x28(0x04)
	bool RevertOnEndEffect; // 0x2c(0x01)
	char UnknownData_2D[0x3]; // 0x2d(0x03)
};

// Class FSD.HeroEnemyAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UHeroEnemyAfflictionEffect : UAfflictionEffect {
	struct FGameplayTag TagToAdd; // 0x28(0x08)
};

// Class FSD.FSDPawn
// Size: 0x2e8 (Inherited: 0x280)
struct AFSDPawn : APawn {
	char UnknownData_280[0x10]; // 0x280(0x10)
	struct FMulticastInlineDelegate OnFrozenEvent; // 0x290(0x10)
	struct UStatusEffectsComponent* StatusEffects; // 0x2a0(0x08)
	struct UEnemyTemperatureComponent* Temperature; // 0x2a8(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x2b0(0x20)
	struct UEnemyDescriptor* SpawnedFromDescriptor; // 0x2d0(0x08)
	bool IsFrozen; // 0x2d8(0x01)
	bool CanFlee; // 0x2d9(0x01)
	bool FleeInsteadOfBackingOff; // 0x2da(0x01)
	bool IsFleeing; // 0x2db(0x01)
	char UnknownData_2DC[0x4]; // 0x2dc(0x04)
	struct UPawnStatsComponent* PawnStatsInstance; // 0x2e0(0x08)

	void UnFreeze(); // Function FSD.FSDPawn.UnFreeze
	void StopFleeing(); // Function FSD.FSDPawn.StopFleeing
	void StartFleeing(struct FVector fromLocation); // Function FSD.FSDPawn.StartFleeing
	void SetAlerted(bool isAlerted); // Function FSD.FSDPawn.SetAlerted
	void Receive_Alerted(); // Function FSD.FSDPawn.Receive_Alerted
	void OnUnFrozen(); // Function FSD.FSDPawn.OnUnFrozen
	void OnStoppedFleeing(); // Function FSD.FSDPawn.OnStoppedFleeing
	void OnStartedFleeing(); // Function FSD.FSDPawn.OnStartedFleeing
	void OnRep_IsFrozen(); // Function FSD.FSDPawn.OnRep_IsFrozen
	void OnFrozen(struct AActor* Source); // Function FSD.FSDPawn.OnFrozen
	void OnFirstHostileDamageTaken(); // Function FSD.FSDPawn.OnFirstHostileDamageTaken
	void OnEnemyScaled(float NewScale); // Function FSD.FSDPawn.OnEnemyScaled
	void OnArmorPartsDestroyedFromRadialDamage(struct TArray<char> destroyedParts); // Function FSD.FSDPawn.OnArmorPartsDestroyedFromRadialDamage
	void OnAlerted(); // Function FSD.FSDPawn.OnAlerted
	void MakeRagdollMesh(struct USkeletalMeshComponent* Mesh); // Function FSD.FSDPawn.MakeRagdollMesh
	void MakeElite(); // Function FSD.FSDPawn.MakeElite
	bool GetIsAlerted(); // Function FSD.FSDPawn.GetIsAlerted
	struct UHealthComponentBase* GetHealthComponent(); // Function FSD.FSDPawn.GetHealthComponent
	struct AFSDAIController* GetFSDAIController(); // Function FSD.FSDPawn.GetFSDAIController
	enum class EPawnAttitude GetAttitude(); // Function FSD.FSDPawn.GetAttitude
	void Freeze(struct AActor* Source); // Function FSD.FSDPawn.Freeze
	void BackOffFromLocation(struct FVector fromLocation); // Function FSD.FSDPawn.BackOffFromLocation
	void All_ArmorPartsDestroyed(struct TArray<char> parts); // Function FSD.FSDPawn.All_ArmorPartsDestroyed
};

// Class FSD.DeepPathfinderCharacter
// Size: 0x378 (Inherited: 0x2e8)
struct ADeepPathfinderCharacter : AFSDPawn {
	char UnknownData_2E8[0x10]; // 0x2e8(0x10)
	struct UDeepPathfinderMovement* PathfinderMovement; // 0x2f8(0x08)
	struct USkeletalMeshComponent* Mesh; // 0x300(0x08)
	struct FName CenterMassSocketName; // 0x308(0x08)
	struct UDeepPatherFinderCharacterAfflictionComponent* affliction; // 0x310(0x08)
	float AnimationOffset; // 0x318(0x04)
	bool CanPlayerStandOn; // 0x31c(0x01)
	bool UseDormancy; // 0x31d(0x01)
	char UnknownData_31E[0x2]; // 0x31e(0x02)
	float StaggerDurationMultiplier; // 0x320(0x04)
	float StaggerImunityWindow; // 0x324(0x04)
	bool StaggerPauseLogic; // 0x328(0x01)
	bool IsHidden; // 0x329(0x01)
	bool IsStaggered; // 0x32a(0x01)
	bool FrozenPauseLogic; // 0x32b(0x01)
	char UnknownData_32C[0x1c]; // 0x32c(0x1c)
	float AttackerRadius; // 0x348(0x04)
	char UnknownData_34C[0x4]; // 0x34c(0x04)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x350(0x10)
	float AllowedInFormationChance; // 0x360(0x04)
	char UnknownData_364[0x14]; // 0x364(0x14)

	bool TryJoinFormation(); // Function FSD.DeepPathfinderCharacter.TryJoinFormation
	void SetHidden(bool shouldHide); // Function FSD.DeepPathfinderCharacter.SetHidden
	void OnPausedMovementElapsed(); // Function FSD.DeepPathfinderCharacter.OnPausedMovementElapsed
	void OnControlledByPlayer(bool IsControlled, bool IsLocallyControlled); // Function FSD.DeepPathfinderCharacter.OnControlledByPlayer
	void LeaveFormation(); // Function FSD.DeepPathfinderCharacter.LeaveFormation
};

// Class FSD.FlyingDeepPathfinderCharacter
// Size: 0x3a8 (Inherited: 0x378)
struct AFlyingDeepPathfinderCharacter : ADeepPathfinderCharacter {
	char UnknownData_378[0x10]; // 0x378(0x10)
	struct UPhysicalMaterial* FrozenMaterial; // 0x388(0x08)
	struct UPhysicsAsset* FrozenAsset; // 0x390(0x08)
	struct USoundCue* FrozenDeathSound; // 0x398(0x08)
	struct UParticleSystem* FrozenDeathparticles; // 0x3a0(0x08)

	void TriggerFrozenRagdoll(); // Function FSD.FlyingDeepPathfinderCharacter.TriggerFrozenRagdoll
	void OnFreezeImpact(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult Hit); // Function FSD.FlyingDeepPathfinderCharacter.OnFreezeImpact
	void BP_FreezeImpact(); // Function FSD.FlyingDeepPathfinderCharacter.BP_FreezeImpact
};

// Class FSD.FlyingEnemyDeepPathfinderCharacter
// Size: 0x3c8 (Inherited: 0x3a8)
struct AFlyingEnemyDeepPathfinderCharacter : AFlyingDeepPathfinderCharacter {
	char UnknownData_3A8[0x8]; // 0x3a8(0x08)
	struct UEnemyHealthComponent* HealthComponent; // 0x3b0(0x08)
	struct FQueuedMontage QueuedMontage; // 0x3b8(0x10)

	void OnRep_QueuedMontage(); // Function FSD.FlyingEnemyDeepPathfinderCharacter.OnRep_QueuedMontage
};

// Class FSD.AFlyingBug
// Size: 0x478 (Inherited: 0x3c8)
struct AAFlyingBug : AFlyingEnemyDeepPathfinderCharacter {
	struct UEnemyComponent* EnemyComponent; // 0x3c8(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x3d0(0x08)
	struct UOutlineComponent* outline; // 0x3d8(0x08)
	struct UPawnSensingComponent* Senses; // 0x3e0(0x08)
	struct UPawnAlertComponent* Alert; // 0x3e8(0x08)
	struct USphereComponent* ExplosionSphere; // 0x3f0(0x08)
	struct UAudioComponent* WingSoundComponent; // 0x3f8(0x08)
	struct FMulticastInlineDelegate OnStartFizzle; // 0x400(0x10)
	struct TArray<struct UAnimSequenceBase*> HitReactions; // 0x410(0x10)
	struct FVector_NetQuantize RagdollImpact; // 0x420(0x0c)
	char UnknownData_42C[0x14]; // 0x42c(0x14)
	struct AActor* RotateTarget; // 0x440(0x08)
	struct UPhysicsAsset* PhysicalAssetAfterDeath; // 0x448(0x08)
	struct USoundBase* ChatterSound; // 0x450(0x08)
	float FirstHitReactBlendIn; // 0x458(0x04)
	float OverrideHitReactBlendIn; // 0x45c(0x04)
	float DistanceForAttackMode; // 0x460(0x04)
	float MinChatterDelay; // 0x464(0x04)
	float MaxChatterDelay; // 0x468(0x04)
	float AttackModeRotationSpeed; // 0x46c(0x04)
	bool UsesAttackStance; // 0x470(0x01)
	bool SetLifeTime; // 0x471(0x01)
	bool AttackStance; // 0x472(0x01)
	bool LookStraight; // 0x473(0x01)
	bool UseDefaultRagdoll; // 0x474(0x01)
	char UnknownData_475[0x3]; // 0x475(0x03)

	void StartFizzle(); // Function FSD.AFlyingBug.StartFizzle
	void SetRotateTarget(struct AActor* aTarget); // Function FSD.AFlyingBug.SetRotateTarget
	void SetExternallyControlled(bool isExternallyControlled); // Function FSD.AFlyingBug.SetExternallyControlled
	void SetAttackStance(bool isAttackStance); // Function FSD.AFlyingBug.SetAttackStance
	void Ragdoll(bool applyForce, struct FVector force); // Function FSD.AFlyingBug.Ragdoll
	void PlayVoice(); // Function FSD.AFlyingBug.PlayVoice
	void OnRep_RagdollImpact(); // Function FSD.AFlyingBug.OnRep_RagdollImpact
	void OnRep_AttackStance(); // Function FSD.AFlyingBug.OnRep_AttackStance
	void OnRagdoll(); // Function FSD.AFlyingBug.OnRagdoll
	void OnDamaged(float amount); // Function FSD.AFlyingBug.OnDamaged
	void OnBugDeath(struct UHealthComponentBase* Health); // Function FSD.AFlyingBug.OnBugDeath
	float GetMidZpointFromCielingAndFloor(float distanceFromCieling, float distanceFromFloor); // Function FSD.AFlyingBug.GetMidZpointFromCielingAndFloor
	bool GetIsInAttackStance(); // Function FSD.AFlyingBug.GetIsInAttackStance
	void AlertNearbyEnemies(); // Function FSD.AFlyingBug.AlertNearbyEnemies
};

// Class FSD.EnemyAnimInstance
// Size: 0x2c0 (Inherited: 0x270)
struct UEnemyAnimInstance : UAnimInstance {
	struct FMulticastInlineDelegate OnRangedAttackNotify; // 0x268(0x10)
	struct FMulticastInlineDelegate OnMeleeAttackNotify; // 0x278(0x10)
	struct FMulticastInlineDelegate OnStopLeadingNotify; // 0x288(0x10)
	struct FMulticastInlineDelegate OnIsAttackingChanged; // 0x298(0x10)
	bool IsAttacking; // 0x2a8(0x01)
	bool IsAlive; // 0x2a9(0x01)
	float RandomStartPosition; // 0x2ac(0x04)
	struct UHealthComponentBase* HealthComponent; // 0x2b0(0x08)
	char UnknownData_2BE[0x2]; // 0x2be(0x02)

	bool IsSlotPlayingAnyAnimation(struct FName SlotNodeName); // Function FSD.EnemyAnimInstance.IsSlotPlayingAnyAnimation
	struct USkeletalMeshComponent* GetSkeletalMesh(); // Function FSD.EnemyAnimInstance.GetSkeletalMesh
};

// Class FSD.SimpleMovingEnemyAnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct USimpleMovingEnemyAnimInstance : UEnemyAnimInstance {
	float Speed; // 0x2b8(0x04)
	struct FVector Velocity; // 0x2bc(0x0c)
	float WalkCycleSpeed; // 0x2c8(0x04)
	float StartMovingSpeed; // 0x2cc(0x04)
	float StopMovingSpeed; // 0x2d0(0x04)
	float WalkCycleMinRate; // 0x2d4(0x04)
	float WalkCyclePlayRate; // 0x2d8(0x04)
	float MeshScale; // 0x2dc(0x04)
	bool IsMoving; // 0x2e0(0x01)
	char UnknownData_2E9[0x7]; // 0x2e9(0x07)

	void SetMeshScale(float NewScale); // Function FSD.SimpleMovingEnemyAnimInstance.SetMeshScale
};

// Class FSD.FlyingBugAnimInstance
// Size: 0x2f0 (Inherited: 0x2f0)
struct UFlyingBugAnimInstance : USimpleMovingEnemyAnimInstance {
	bool IsInAttackMode; // 0x2e8(0x01)
	bool IsStaggered; // 0x2e9(0x01)
};

// Class FSD.AIFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIFunctionLibrary : UBlueprintFunctionLibrary {

	void SetAICanSense(bool canSense); // Function FSD.AIFunctionLibrary.SetAICanSense
	int32_t MakeEnemiesFleeFromArea(struct UObject* WorldContextObject, struct FVector Center, float Radius, int32_t maxEnemiesAffected); // Function FSD.AIFunctionLibrary.MakeEnemiesFleeFromArea
	void MakeEnemiesBackOutOfArea(struct UObject* WorldContextObject, struct FVector Center, float Radius); // Function FSD.AIFunctionLibrary.MakeEnemiesBackOutOfArea
	bool IsEnemyAlertet(struct APawn* enemy); // Function FSD.AIFunctionLibrary.IsEnemyAlertet
	struct APlayerCharacter* GetPlayerTarget(struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, struct AActor* ignoreTarget, bool IsFlying); // Function FSD.AIFunctionLibrary.GetPlayerTarget
	struct UAttackerPositioningComponent* GetAttackableTarget(struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, struct AActor* ignoreTarget, bool IsFlying); // Function FSD.AIFunctionLibrary.GetAttackableTarget
	struct APlayerCharacter* ConsiderChangingTarget(struct APlayerCharacter* CurrentTarget, struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool CurrentTargetMustBeAlive, bool IsFlying); // Function FSD.AIFunctionLibrary.ConsiderChangingTarget
	void AlertEnemy(struct APawn* enemy); // Function FSD.AIFunctionLibrary.AlertEnemy
	void AlertEnemiesInRange(struct UObject* WorldContextObject, struct FVector Origin, float Range, struct APawn* alerter); // Function FSD.AIFunctionLibrary.AlertEnemiesInRange
};

// Class FSD.AIPlayerControlComponent
// Size: 0x160 (Inherited: 0xb0)
struct UAIPlayerControlComponent : UActorComponent {
	struct FRotator AngularAcceleration; // 0xb0(0x0c)
	struct FRotator AngularDampening; // 0xbc(0x0c)
	struct FRotator MaxAngularVelocity; // 0xc8(0x0c)
	struct FRotator MaxRotation; // 0xd4(0x0c)
	float SpeedTarget; // 0xe0(0x04)
	float SpeedMin; // 0xe4(0x04)
	float SpeedMax; // 0xe8(0x04)
	float AccelerationBase; // 0xec(0x04)
	float AccelerationMultiplier; // 0xf0(0x04)
	float DecelerationMultiplier; // 0xf4(0x04)
	float AccelerationOnSlopeMultiplier; // 0xf8(0x04)
	float DecelerationOnSlopeMultiplier; // 0xfc(0x04)
	float InitialConnectionBlendTime; // 0x100(0x04)
	char UnknownData_104[0x4]; // 0x104(0x04)
	struct UAnimMontage* GetOnMontageAI; // 0x108(0x08)
	struct UAnimMontage* GetOnMontagePlayer; // 0x110(0x08)
	struct UAnimMontage* LetGoMontageAI; // 0x118(0x08)
	struct UAnimMontage* LetGoMontagePlayer; // 0x120(0x08)
	struct UDialogDataAsset* GetOnShout; // 0x128(0x08)
	struct UDialogDataAsset* LetGoShout; // 0x130(0x08)
	struct UControlEnemyUsable* Usable; // 0x138(0x08)
	char UnknownData_140[0x20]; // 0x140(0x20)
};

// Class FSD.EnemyGroupDescriptor
// Size: 0x50 (Inherited: 0x30)
struct UEnemyGroupDescriptor : UDataAsset {
	struct TArray<struct FEnemyGroupDescriptorItem> Enemies; // 0x30(0x10)
	struct FRandInterval Diversity; // 0x40(0x10)
};

// Class FSD.AmberEventEnemyPool
// Size: 0x68 (Inherited: 0x50)
struct UAmberEventEnemyPool : UEnemyGroupDescriptor {
	float MaxTimeBetweenSpawn; // 0x50(0x04)
	float MinTimeBetweenSpawn; // 0x54(0x04)
	int32_t MaxEnemyCap; // 0x58(0x04)
	int32_t AmbersNeededdToComplete; // 0x5c(0x04)
	int32_t AmbersNeededOnePlayer; // 0x60(0x04)
	char UnknownData_64[0x4]; // 0x64(0x04)
};

// Class FSD.GameEvent
// Size: 0x358 (Inherited: 0x220)
struct AGameEvent : AActor {
	char UnknownData_220[0x8]; // 0x220(0x08)
	struct FMulticastInlineDelegate EventTriggeredDelegate; // 0x228(0x10)
	struct FMulticastInlineDelegate EventFinishedDelegate; // 0x238(0x10)
	struct FMulticastInlineDelegate StageCompleteDelegate; // 0x248(0x10)
	struct FMulticastInlineDelegate ProgressChangedDelegate; // 0x258(0x10)
	struct FMulticastInlineDelegate TimeProgressChanged; // 0x268(0x10)
	struct FMulticastInlineDelegate ObjectivesPerStageChanged; // 0x278(0x10)
	struct TArray<struct AEventStarterButton*> StarterObjects; // 0x288(0x10)
	bool bGameEventSetup; // 0x298(0x01)
	char UnknownData_299[0x7]; // 0x299(0x07)
	struct FText EventName; // 0x2a0(0x18)
	struct FText ObjectiveText; // 0x2b8(0x18)
	struct FName AnalyticsName; // 0x2d0(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x2d8(0x20)
	struct UChildActorComponent* StartEventObject; // 0x2f8(0x08)
	struct UDialogDataAsset* EventTriggeredShout; // 0x300(0x08)
	struct UDialogDataAsset* EventFinishedShout; // 0x308(0x08)
	struct UDialogDataAsset* EventFailedShout; // 0x310(0x08)
	float EventTriggeredShoutDelay; // 0x318(0x04)
	float EventFinishedShoutDelay; // 0x31c(0x04)
	float StageProgress; // 0x320(0x04)
	float TimeLimit; // 0x324(0x04)
	float DelayUITime; // 0x328(0x04)
	char UnknownData_32C[0x4]; // 0x32c(0x04)
	int32_t objectivesPerStage; // 0x330(0x04)
	char UnknownData_334[0x4]; // 0x334(0x04)
	bool EventStartersActive; // 0x338(0x01)
	bool StopScriptedWavesWhileActive; // 0x339(0x01)
	bool StopNormalWavesWhileActive; // 0x33a(0x01)
	bool EventStarted; // 0x33b(0x01)
	bool FailedEvent; // 0x33c(0x01)
	bool ShowRemainingTimeOnHUD; // 0x33d(0x01)
	bool ShowScoreStatusOnHUD; // 0x33e(0x01)
	char UnknownData_33F[0x1]; // 0x33f(0x01)
	bool SkipEventStarters; // 0x340(0x01)
	char UnknownData_341[0x7]; // 0x341(0x07)
	struct TArray<struct AActor*> EventParticipants; // 0x348(0x10)

	void TrySetupGameEvent(); // Function FSD.GameEvent.TrySetupGameEvent
	void TriggerEvent(); // Function FSD.GameEvent.TriggerEvent
	void StartShout(); // Function FSD.GameEvent.StartShout
	void StageObjectiveCompleted(); // Function FSD.GameEvent.StageObjectiveCompleted
	struct ARessuplyPod* SpawnEventPod(struct ARessuplyPod* podClass, struct FVector aSpawnLocation, int32_t Delay); // Function FSD.GameEvent.SpawnEventPod
	struct AActor* SpawnEventActor(struct AActor* eventActorClass, struct FTransform aSpawnLocation); // Function FSD.GameEvent.SpawnEventActor
	void SetStageProgress(float Progress); // Function FSD.GameEvent.SetStageProgress
	void SetObjectivesPerStage(int32_t objectivesPerStage); // Function FSD.GameEvent.SetObjectivesPerStage
	void RemoveParticipant(struct AActor* participant); // Function FSD.GameEvent.RemoveParticipant
	void OnStarterObjectUsed(struct AEventStarterButton* eventStarter); // Function FSD.GameEvent.OnStarterObjectUsed
	void OnStageProgress(float Progress); // Function FSD.GameEvent.OnStageProgress
	void OnStageComplete(int32_t Stage); // Function FSD.GameEvent.OnStageComplete
	void OnRep_StageProgress(); // Function FSD.GameEvent.OnRep_StageProgress
	void OnRep_ObjectivesPerStage(); // Function FSD.GameEvent.OnRep_ObjectivesPerStage
	void OnRep_IsEventStartersActive(); // Function FSD.GameEvent.OnRep_IsEventStartersActive
	void OnRep_FailedEvent(); // Function FSD.GameEvent.OnRep_FailedEvent
	void OnRep_EventStarted(); // Function FSD.GameEvent.OnRep_EventStarted
	void OnRep_EventParticipants(); // Function FSD.GameEvent.OnRep_EventParticipants
	void OnEventTriggered(); // Function FSD.GameEvent.OnEventTriggered
	void OnEventFinished(bool eventSuccess); // Function FSD.GameEvent.OnEventFinished
	void OnEventBooted(); // Function FSD.GameEvent.OnEventBooted
	bool IsEventActive(); // Function FSD.GameEvent.IsEventActive
	float GetStageProgress(); // Function FSD.GameEvent.GetStageProgress
	bool GetShowTimeOnHUD(); // Function FSD.GameEvent.GetShowTimeOnHUD
	bool GetShowScoreOnHUD(); // Function FSD.GameEvent.GetShowScoreOnHUD
	struct FText GetObjectiveText(); // Function FSD.GameEvent.GetObjectiveText
	int32_t GetObjectivesPerStage(); // Function FSD.GameEvent.GetObjectivesPerStage
	struct FText GetEventName(); // Function FSD.GameEvent.GetEventName
	bool GetEventFailed(); // Function FSD.GameEvent.GetEventFailed
	float GetDelayUITime(); // Function FSD.GameEvent.GetDelayUITime
	void EndShout(); // Function FSD.GameEvent.EndShout
	struct FTransform DebreePositionPoint(struct AProceduralSetup* setup, struct FVector fromLocation, float Radius, struct UDebrisPositioning* DebrisPositioning, struct AActor* terrainPlacement, struct TArray<struct FVector> locationsToAvoid, struct UCurveFloat* avoidCostCurve, float maxPathLength); // Function FSD.GameEvent.DebreePositionPoint
	void BootUpEvent(); // Function FSD.GameEvent.BootUpEvent
	void AddStageProgress(float progressToAdd); // Function FSD.GameEvent.AddStageProgress
};

// Class FSD.AmberEvent
// Size: 0x3a8 (Inherited: 0x358)
struct AAmberEvent : AGameEvent {
	struct UDamageComponent* EndExplosionDamage; // 0x358(0x08)
	struct TArray<struct UAmberEventEnemyPool*> EnemyPools; // 0x360(0x10)
	struct TArray<struct AFSDPawn*> spawnedEnemies; // 0x370(0x10)
	char UnknownData_380[0x8]; // 0x380(0x08)
	struct FWeakObjectPtr<struct UAmberEventEnemyPool> CurrentPool; // 0x388(0x08)
	float InitialDelayBeforeSpawn; // 0x390(0x04)
	float MaxSpawnRange; // 0x394(0x04)
	char UnknownData_398[0x10]; // 0x398(0x10)

	void OnSpawnedDeath(struct UHealthComponentBase* spawnedHealthComponent); // Function FSD.AmberEvent.OnSpawnedDeath
	void OnEnemySpawned(struct APawn* Pawn); // Function FSD.AmberEvent.OnEnemySpawned
};

// Class FSD.AmmoCountWidget
// Size: 0x250 (Inherited: 0x230)
struct UAmmoCountWidget : UUserWidget {
	struct APlayerCharacter* Character; // 0x230(0x08)
	struct AItem* Item; // 0x238(0x08)
	struct UItemAggregator* Aggregator; // 0x240(0x08)
	char UnknownData_248[0x8]; // 0x248(0x08)

	void OnVisibleChanged(bool Visible, bool showClipCount); // Function FSD.AmmoCountWidget.OnVisibleChanged
	void OnTotalVisibleChanged(bool Visible); // Function FSD.AmmoCountWidget.OnTotalVisibleChanged
	void OnTotalChanged(int32_t Total); // Function FSD.AmmoCountWidget.OnTotalChanged
	void OnItemTotalChanged(int32_t Value); // Function FSD.AmmoCountWidget.OnItemTotalChanged
	void OnItemEquipped(struct AItem* NewItem); // Function FSD.AmmoCountWidget.OnItemEquipped
	void OnItemAmountChanged(int32_t Value); // Function FSD.AmmoCountWidget.OnItemAmountChanged
	void OnAmountChanged(int32_t count); // Function FSD.AmmoCountWidget.OnAmountChanged
	void DoItemEquipped(); // Function FSD.AmmoCountWidget.DoItemEquipped
};

// Class FSD.Item
// Size: 0x318 (Inherited: 0x220)
struct AItem : AActor {
	char UnknownData_220[0x38]; // 0x220(0x38)
	struct FVector FPCameraOffset; // 0x258(0x0c)
	bool EnableDangerousSaveGameIDEditing; // 0x264(0x01)
	char UnknownData_265[0x3]; // 0x265(0x03)
	struct FGuid SavegameID; // 0x268(0x10)
	struct UItemID* ItemID; // 0x278(0x08)
	struct APlayerCharacter* Character; // 0x280(0x08)
	struct UUpgradableItemComponent* UpgradableItem; // 0x288(0x08)
	struct UCameraShake* CameraShake; // 0x290(0x08)
	bool CameraShakeOnStartUsing; // 0x298(0x01)
	bool CameraShakeOnEquip; // 0x299(0x01)
	char UnknownData_29A[0xe]; // 0x29a(0x0e)
	struct UCurveFloat* HeatCurve; // 0x2a8(0x08)
	float ManualHeatPerUse; // 0x2b0(0x04)
	float CooldownRate; // 0x2b4(0x04)
	float ManualCooldownDelay; // 0x2b8(0x04)
	float UnjamDuration; // 0x2bc(0x04)
	char UnknownData_2C0[0x4]; // 0x2c0(0x04)
	float CurrentTemperature; // 0x2c4(0x04)
	struct USoundBase* AudioTemperature; // 0x2c8(0x08)
	float AudioTemperatureFadeout; // 0x2d0(0x04)
	struct FName TemperatureFloatParam; // 0x2d4(0x08)
	char UnknownData_2DC[0x4]; // 0x2dc(0x04)
	struct UAudioComponent* TemperatureAudioComponent; // 0x2e0(0x08)
	bool Overheated; // 0x2e8(0x01)
	char UnknownData_2E9[0x7]; // 0x2e9(0x07)
	struct UDialogDataAsset* ShoutOverheated; // 0x2f0(0x08)
	bool bAimAssistEnabled; // 0x2f8(0x01)
	char UnknownData_2F9[0x3]; // 0x2f9(0x03)
	float MovementRateWhileUsing; // 0x2fc(0x04)
	bool CanPlayLedgeClimbWhileUsing; // 0x300(0x01)
	bool CanInspectItem; // 0x301(0x01)
	bool CanSprintWithItem; // 0x302(0x01)
	char UnknownData_303[0x5]; // 0x303(0x05)
	struct UItemsBarIcon* CustomIconWidget; // 0x308(0x08)
	bool IsEquipped; // 0x310(0x01)
	bool IsUsing; // 0x311(0x01)
	char UnknownData_312[0x6]; // 0x312(0x06)

	void UpdateSkin(); // Function FSD.Item.UpdateSkin
	void Server_StartUsing(bool IsUsing); // Function FSD.Item.Server_StartUsing
	void Resupply(float percentage); // Function FSD.Item.Resupply
	void RemovedFromInventory(struct ACharacter* oldCharacter); // Function FSD.Item.RemovedFromInventory
	void RecieveUnequipped(); // Function FSD.Item.RecieveUnequipped
	void RecieveStopUsing(); // Function FSD.Item.RecieveStopUsing
	void RecieveStartUsing(); // Function FSD.Item.RecieveStartUsing
	void RecieveEquipped(); // Function FSD.Item.RecieveEquipped
	void RecieveCycledItem(); // Function FSD.Item.RecieveCycledItem
	void Recieve_UpdateMeshses(bool IsFirstPerson); // Function FSD.Item.Recieve_UpdateMeshses
	void ReceiveResupply(float percentage); // Function FSD.Item.ReceiveResupply
	void Receive_Overheated(); // Function FSD.Item.Receive_Overheated
	struct UStaticMeshComponent* Receive_GetTPAnimationEventMesh(); // Function FSD.Item.Receive_GetTPAnimationEventMesh
	struct UFirstPersonStaticMeshComponent* Receive_GetFPAnimationEventMesh(); // Function FSD.Item.Receive_GetFPAnimationEventMesh
	void OnTemperatureChanged(float Temperature, bool Overheated); // Function FSD.Item.OnTemperatureChanged
	void OnSkinChanged(struct USkinEffect* Skin); // Function FSD.Item.OnSkinChanged
	void OnRep_IsUsing(bool OldValue); // Function FSD.Item.OnRep_IsUsing
	void OnOwnerDestroyed(struct AActor* owningActor); // Function FSD.Item.OnOwnerDestroyed
	bool IsLocallyControlled(); // Function FSD.Item.IsLocallyControlled
	bool IsFirstPerson(); // Function FSD.Item.IsFirstPerson
	struct AActor* GetWeaponViewClass(); // Function FSD.Item.GetWeaponViewClass
	struct FItemLoadoutAnimations GetLoadoutAnimations(); // Function FSD.Item.GetLoadoutAnimations
	struct FText GetItemName(); // Function FSD.Item.GetItemName
	struct UTexture2D* GetItemIconLine(); // Function FSD.Item.GetItemIconLine
	struct UTexture2D* GetItemIconBG(); // Function FSD.Item.GetItemIconBG
	struct AItem* GetItemDefaultObject(struct AItem* itemClass); // Function FSD.Item.GetItemDefaultObject
	struct FText GetItemCategory(); // Function FSD.Item.GetItemCategory
	struct USceneComponent* GetHeatingAudioSceneComponent(); // Function FSD.Item.GetHeatingAudioSceneComponent
	struct UItemCharacterAnimationSet* GetCharacterAnimationSet(); // Function FSD.Item.GetCharacterAnimationSet
	struct FString GetAnalyticsItemName(); // Function FSD.Item.GetAnalyticsItemName
	struct FString GetAnalyticsItemCategory(); // Function FSD.Item.GetAnalyticsItemCategory
	void AddedToInventory(struct APlayerCharacter* ItemOwner); // Function FSD.Item.AddedToInventory
};

// Class FSD.AnimatedItem
// Size: 0x368 (Inherited: 0x318)
struct AAnimatedItem : AItem {
	struct USkinnableComponent* Skinnable; // 0x318(0x08)
	struct UPlayerAnimInstance* FPAnimInstance; // 0x320(0x08)
	struct UPlayerAnimInstance* TPAnimInstance; // 0x328(0x08)
	struct USkeletalMeshComponent* FPMesh; // 0x330(0x08)
	struct USkeletalMeshComponent* TPMesh; // 0x338(0x08)
	struct UAnimMontage* FP_EquipAnimation; // 0x340(0x08)
	struct UAnimMontage* TP_EquipAnimation; // 0x348(0x08)
	float EquipDuration; // 0x350(0x04)
	char UnknownData_354[0x4]; // 0x354(0x04)
	struct UItemCharacterAnimationSet* CharacterAnimationSet; // 0x358(0x08)
	char UnknownData_360[0x8]; // 0x360(0x08)

	void OnReceiveEquippedFinished(); // Function FSD.AnimatedItem.OnReceiveEquippedFinished
	struct FTransform GetMuzzle(); // Function FSD.AnimatedItem.GetMuzzle
	struct USkeletalMeshComponent* GetItemMesh(); // Function FSD.AnimatedItem.GetItemMesh
};

// Class FSD.AmmoDrivenWeapon
// Size: 0x690 (Inherited: 0x368)
struct AAmmoDrivenWeapon : AAnimatedItem {
	char UnknownData_368[0x20]; // 0x368(0x20)
	struct FMulticastInlineDelegate OnClipCountChanged; // 0x388(0x10)
	struct FMulticastInlineDelegate OnTryReloadEvent; // 0x398(0x10)
	struct FMulticastInlineDelegate OnReloadingEvent; // 0x3a8(0x10)
	struct FMulticastInlineDelegate OnStoppedUsingEvent; // 0x3b8(0x10)
	struct UWeaponFireComponent* WeaponFire; // 0x3c8(0x08)
	struct UAmmoDriveWeaponAggregator* Aggregator; // 0x3d0(0x08)
	bool LoopFireAnimation; // 0x3d8(0x01)
	char UnknownData_3D9[0x3]; // 0x3d9(0x03)
	float LoopFireAnimationBlendoutTime; // 0x3dc(0x04)
	struct UAnimMontage* FP_FireAnimation; // 0x3e0(0x08)
	struct UAnimMontage* TP_FireAnimation; // 0x3e8(0x08)
	struct UAnimMontage* FP_ReloadAnimation; // 0x3f0(0x08)
	struct FItemAnimationItem OverheatAnimation; // 0x3f8(0x18)
	struct TArray<struct FItemAnimationItem> GunslingAnimations; // 0x410(0x10)
	struct UAnimMontage* TP_ReloadAnimation; // 0x420(0x08)
	struct UAnimMontage* WPN_Fire; // 0x428(0x08)
	struct UAnimMontage* WPN_FireLastBullet; // 0x430(0x08)
	struct UAnimMontage* WPN_Reload; // 0x438(0x08)
	struct UAnimMontage* WPN_Reload_TP; // 0x440(0x08)
	struct UFXSystemAsset* MuzzleParticles; // 0x448(0x08)
	struct UFXSystemAsset* TPMuzzleParticles; // 0x450(0x08)
	bool UseTriggeredMuzzleParticles; // 0x458(0x01)
	char UnknownData_459[0xf]; // 0x459(0x0f)
	struct FTracerData Tracer; // 0x468(0x30)
	struct UParticleSystem* TracerParticles; // 0x498(0x08)
	struct UParticleSystem* TrailParticles; // 0x4a0(0x08)
	float MinTracerDistance; // 0x4a8(0x04)
	float TracerSpeed; // 0x4ac(0x04)
	float TracerOffset; // 0x4b0(0x04)
	char UnknownData_4B4[0x4]; // 0x4b4(0x04)
	struct UFXSystemAsset* CasingParticles; // 0x4b8(0x08)
	bool UseTriggeredCasingParticleSystem; // 0x4c0(0x01)
	char UnknownData_4C1[0xf]; // 0x4c1(0x0f)
	struct ULightComponent* MuzzleFlashLight; // 0x4d0(0x08)
	struct FRuntimeFloatCurve MuzzleFlashLightCurve; // 0x4d8(0x88)
	char UnknownData_560[0x8]; // 0x560(0x08)
	struct USoundCue* FireSound; // 0x568(0x08)
	struct USoundCue* RicochetSound; // 0x570(0x08)
	struct UFXSystemAsset* RicochetParticle; // 0x578(0x08)
	float FireSoundDelayToTail; // 0x580(0x04)
	char UnknownData_584[0xc]; // 0x584(0x0c)
	struct USoundCue* FireSoundTail; // 0x590(0x08)
	bool IsFireSoundTail2D; // 0x598(0x01)
	char UnknownData_599[0x7]; // 0x599(0x07)
	struct UForceFeedbackEffect* FireForceFeedbackEffect; // 0x5a0(0x08)
	struct UAudioComponent* FireSoundInstance; // 0x5a8(0x08)
	float FireSoundFadeDuration; // 0x5b0(0x04)
	char UnknownData_5B4[0x4]; // 0x5b4(0x04)
	struct USoundCue* ReloadSound; // 0x5b8(0x08)
	int32_t BulletsRemainingForNearEmptySound; // 0x5c0(0x04)
	char UnknownData_5C4[0x4]; // 0x5c4(0x04)
	struct USoundCue* NearEmptySound; // 0x5c8(0x08)
	struct USoundCue* WeaponEmptySound; // 0x5d0(0x08)
	struct UDialogDataAsset* ShoutShotFired; // 0x5d8(0x08)
	struct UDialogDataAsset* ShoutOutOfAmmo; // 0x5e0(0x08)
	struct UDialogDataAsset* ShoutReloading; // 0x5e8(0x08)
	int32_t MaxAmmo; // 0x5f0(0x04)
	int32_t ClipSize; // 0x5f4(0x04)
	int32_t ShotCost; // 0x5f8(0x04)
	float RateOfFire; // 0x5fc(0x04)
	int32_t BurstCount; // 0x600(0x04)
	float BurstCycleTime; // 0x604(0x04)
	float ReloadDuration; // 0x608(0x04)
	int32_t AmmoCount; // 0x60c(0x04)
	int32_t ClipCount; // 0x610(0x04)
	float AutoReloadDuration; // 0x614(0x04)
	struct USoundCue* AutoReloadCompleteCue; // 0x618(0x08)
	struct FMulticastInlineDelegate OnItemAutoReloaded; // 0x620(0x10)
	char UnknownData_630[0x4]; // 0x630(0x04)
	float SupplyStatusWeight; // 0x634(0x04)
	float CycleTimeLeft; // 0x638(0x04)
	char UnknownData_63C[0x4]; // 0x63c(0x04)
	float ReloadTimeLeft; // 0x640(0x04)
	bool AutomaticReload; // 0x644(0x01)
	bool CanReload; // 0x645(0x01)
	char UnknownData_646[0x2]; // 0x646(0x02)
	struct FRecoilSettings RecoilSettings; // 0x648(0x28)
	bool HasAutomaticFire; // 0x670(0x01)
	bool IsFiring; // 0x671(0x01)
	char UnknownData_672[0x18]; // 0x672(0x18)
	enum class EAmmoWeaponState WeaponState; // 0x68a(0x01)
	char UnknownData_68B[0x5]; // 0x68b(0x05)

	void Upgraded_Blueprint_Implementation(struct TArray<struct UItemUpgrade*> Upgrades); // Function FSD.AmmoDrivenWeapon.Upgraded_Blueprint_Implementation
	void Server_StopReload(); // Function FSD.AmmoDrivenWeapon.Server_StopReload
	void Server_ReloadWeapon(); // Function FSD.AmmoDrivenWeapon.Server_ReloadWeapon
	void Server_PlayBurstFire(char shotCount); // Function FSD.AmmoDrivenWeapon.Server_PlayBurstFire
	void Server_Gunsling(char Index); // Function FSD.AmmoDrivenWeapon.Server_Gunsling
	void RecieveFiredWeapon(); // Function FSD.AmmoDrivenWeapon.RecieveFiredWeapon
	void Receive_ReloadEnd(); // Function FSD.AmmoDrivenWeapon.Receive_ReloadEnd
	void Receive_ReloadBegin(); // Function FSD.AmmoDrivenWeapon.Receive_ReloadBegin
	void Receive_IsFiringChanged(bool NewValue); // Function FSD.AmmoDrivenWeapon.Receive_IsFiringChanged
	void OnWeaponFireEnded(); // Function FSD.AmmoDrivenWeapon.OnWeaponFireEnded
	void OnWeaponFired(struct FVector Location); // Function FSD.AmmoDrivenWeapon.OnWeaponFired
	void OnRicochet(struct FVector Origin, struct FVector Location, struct FVector Normal); // Function FSD.AmmoDrivenWeapon.OnRicochet
	void OnRep_IsFiring(); // Function FSD.AmmoDrivenWeapon.OnRep_IsFiring
	bool IsClipFull(); // Function FSD.AmmoDrivenWeapon.IsClipFull
	void InstantlyReload(); // Function FSD.AmmoDrivenWeapon.InstantlyReload
	void CustomEvent1(); // Function FSD.AmmoDrivenWeapon.CustomEvent1
	void Client_RefillAmmo(float percentage); // Function FSD.AmmoDrivenWeapon.Client_RefillAmmo
	void All_StopReload(); // Function FSD.AmmoDrivenWeapon.All_StopReload
	void All_StartReload(); // Function FSD.AmmoDrivenWeapon.All_StartReload
	void All_PlayBurstFire(char shotCount); // Function FSD.AmmoDrivenWeapon.All_PlayBurstFire
	void All_Gunsling(char Index); // Function FSD.AmmoDrivenWeapon.All_Gunsling
};

// Class FSD.ItemAggregator
// Size: 0xc8 (Inherited: 0xb0)
struct UItemAggregator : UActorComponent {
	struct FText CounterText; // 0xb0(0x18)

	void UnbindAllEvents(); // Function FSD.ItemAggregator.UnbindAllEvents
};

// Class FSD.ClipBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UClipBasedItemAggregator : UItemAggregator {
	struct FMulticastInlineDelegate OnClipAmountChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnTotalAmountChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	struct FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	struct FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool ShowTotalAmount; // 0x138(0x01)
	char UnknownData_139[0x7]; // 0x139(0x07)

	void ReloadStarted(); // Function FSD.ClipBasedItemAggregator.ReloadStarted
	void ReloadComplete(); // Function FSD.ClipBasedItemAggregator.ReloadComplete
	int32_t GetTotalAmount(); // Function FSD.ClipBasedItemAggregator.GetTotalAmount
	int32_t GetClipAmount(); // Function FSD.ClipBasedItemAggregator.GetClipAmount
};

// Class FSD.AmmoDriveWeaponAggregator
// Size: 0x148 (Inherited: 0x140)
struct UAmmoDriveWeaponAggregator : UClipBasedItemAggregator {
	struct AAmmoDrivenWeapon* Weapon; // 0x140(0x08)
};

// Class FSD.AmmoDrivenWeaponAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAmmoDrivenWeaponAnimInstance : UAnimInstance {
	struct AAmmoDrivenWeapon* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ClipFullPercentage; // 0x274(0x04)
	char UnknownData_27D[0x3]; // 0x27d(0x03)

	bool IsFull(); // Function FSD.AmmoDrivenWeaponAnimInstance.IsFull
	bool IsEmpty(); // Function FSD.AmmoDrivenWeaponAnimInstance.IsEmpty
};

// Class FSD.PlatformGunAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UPlatformGunAnimInstance : UAmmoDrivenWeaponAnimInstance {
	float SpinRate; // 0x278(0x04)
	float NormalSpinRate; // 0x27c(0x04)
	float LerpSpeed; // 0x280(0x04)
	float FiredSpinRate; // 0x284(0x04)

	void WeaponFired(); // Function FSD.PlatformGunAnimInstance.WeaponFired
};

// Class FSD.AnchorTurner
// Size: 0x2c0 (Inherited: 0x220)
struct AAnchorTurner : AActor {
	struct USceneComponent* Root; // 0x220(0x08)
	struct USkeletalMeshComponent* Mesh; // 0x228(0x08)
	struct USphereComponent* PushCollider1; // 0x230(0x08)
	struct USphereComponent* PushCollider2; // 0x238(0x08)
	struct USphereComponent* PushCollider3; // 0x240(0x08)
	struct USphereComponent* PushCollider4; // 0x248(0x08)
	struct FMulticastInlineDelegate OnSpunUp; // 0x250(0x10)
	char UnknownData_260[0x20]; // 0x260(0x20)
	struct FVector AttatchmentOffset; // 0x280(0x0c)
	char UnknownData_28C[0x4]; // 0x28c(0x04)
	struct TArray<struct FName> AttachmentPoints; // 0x290(0x10)
	float PerPlayerMultiplier; // 0x2a0(0x04)
	float TurnSpeed; // 0x2a4(0x04)
	float Progress; // 0x2a8(0x04)
	float MaxProgress; // 0x2ac(0x04)
	char UnknownData_2B0[0x4]; // 0x2b0(0x04)
	bool Finished; // 0x2b4(0x01)
	char UnknownData_2B5[0x3]; // 0x2b5(0x03)
	float DecaySpeed; // 0x2b8(0x04)
	char UnknownData_2BC[0x4]; // 0x2bc(0x04)

	void OnRep_Finished(); // Function FSD.AnchorTurner.OnRep_Finished
	void OnLeftPushpoint(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FSD.AnchorTurner.OnLeftPushpoint
	void OnEnteredPushpoint(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function FSD.AnchorTurner.OnEnteredPushpoint
	void GeneratorSpunUp(); // Function FSD.AnchorTurner.GeneratorSpunUp
};

// Class FSD.AnchorTurnerAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAnchorTurnerAnimInstance : UAnimInstance {
	float ModuleRotation; // 0x268(0x04)
	float Percent; // 0x26c(0x04)
	float TurnSpeed; // 0x270(0x04)
	bool IsFinished; // 0x274(0x01)
	char UnknownData_27D[0x3]; // 0x27d(0x03)
};

// Class FSD.BaseArmorDamageComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UBaseArmorDamageComponent : UActorComponent {
	bool ArmorDamageEnabled; // 0xb0(0x01)
	char UnknownData_B1[0x7]; // 0xb1(0x07)
	struct TArray<struct UParticleSystem*> ArmorBreakParticles; // 0xb8(0x10)
	struct TArray<struct UFSDPhysicalMaterial*> ArmorPhysMats; // 0xc8(0x10)
	struct USkeletalMeshComponent* Mesh; // 0xd8(0x08)
};

// Class FSD.SimpleArmorDamageComponent
// Size: 0x148 (Inherited: 0xe0)
struct USimpleArmorDamageComponent : UBaseArmorDamageComponent {
	struct FMulticastInlineDelegate OnRadialArmorPartsDestroyedEvent; // 0xe0(0x10)
	float ArmorStrength; // 0xf0(0x04)
	char UnknownData_F4[0x4]; // 0xf4(0x04)
	struct TMap<struct FName, struct FDestructableBodypartItem> PhysBoneToArmor; // 0xf8(0x50)

	void DamageArmor_All(struct TArray<char> parts); // Function FSD.SimpleArmorDamageComponent.DamageArmor_All
};

// Class FSD.ArmorHealthDamageComponent
// Size: 0x148 (Inherited: 0xe0)
struct UArmorHealthDamageComponent : UBaseArmorDamageComponent {
	struct FMulticastInlineDelegate OnArmorPartDestroyedEvent; // 0xe0(0x10)
	struct TMap<struct FName, struct FArmorHealthItem> PhysBoneToArmor; // 0xf0(0x50)
	uint32_t ArmorDamageIndex; // 0x140(0x04)
	bool AffectedByAmorBreak; // 0x144(0x01)
	char UnknownData_145[0x3]; // 0x145(0x03)

	bool SetHealthOnBodypartItem(struct FName BoneName, float newHealth); // Function FSD.ArmorHealthDamageComponent.SetHealthOnBodypartItem
	void SetHealthOnAllItems(float newHealth); // Function FSD.ArmorHealthDamageComponent.SetHealthOnAllItems
	void RegrowAllArmor(float baseHealth); // Function FSD.ArmorHealthDamageComponent.RegrowAllArmor
	void OnRep_ArmorDamageIndex(uint32_t OldValue); // Function FSD.ArmorHealthDamageComponent.OnRep_ArmorDamageIndex
};

// Class FSD.CompositeArmorComponent
// Size: 0xf0 (Inherited: 0xe0)
struct UCompositeArmorComponent : UBaseArmorDamageComponent {
	struct TArray<struct FCompositeArmorItem> ArmorItems; // 0xe0(0x10)

	void AddArmorPart(struct UPrimitiveComponent* Primitive, float Health); // Function FSD.CompositeArmorComponent.AddArmorPart
};

// Class FSD.ArmorPiece
// Size: 0x2a8 (Inherited: 0x220)
struct AArmorPiece : AActor {
	char UnknownData_220[0x18]; // 0x220(0x18)
	struct UUpgradableGearComponent* Upgradable; // 0x238(0x08)
	struct TMap<struct UPawnStat*, float> StatModifiers; // 0x240(0x50)
	struct ALoadoutItemProxy* LoadoutProxy; // 0x290(0x08)
	struct UItemID* ItemID; // 0x298(0x08)
	struct AActor* WeaponPreviewClass; // 0x2a0(0x08)

	struct AActor* GetWeaponViewClass(); // Function FSD.ArmorPiece.GetWeaponViewClass
	struct AArmorPiece* GetArmorPieceDefaultObject(struct AArmorPiece* armorPieceClass); // Function FSD.ArmorPiece.GetArmorPieceDefaultObject
};

// Class FSD.ThrowableItem
// Size: 0x3e0 (Inherited: 0x368)
struct AThrowableItem : AAnimatedItem {
	char UnknownData_368[0x8]; // 0x368(0x08)
	struct AThrowableActor* ThrowableClass; // 0x370(0x08)
	struct UAnimMontage* FPThrowMontage; // 0x378(0x08)
	struct UAnimMontage* TPThrowMontage; // 0x380(0x08)
	float ThrowVelocity; // 0x388(0x04)
	float InheritOwnerVelocityScale; // 0x38c(0x04)
	float ThrowAngle; // 0x390(0x04)
	float CooldownAfterThrow; // 0x394(0x04)
	float CooldownAfterDetonation; // 0x398(0x04)
	bool CanThrowBeforeEquipAnimFinish; // 0x39c(0x01)
	char UnknownData_39D[0x3]; // 0x39d(0x03)
	float ThrowDelay; // 0x3a0(0x04)
	float ThrowZOffset; // 0x3a4(0x04)
	float CooldownLeft; // 0x3a8(0x04)
	char UnknownData_3AC[0x4]; // 0x3ac(0x04)
	struct TArray<struct UItemUpgrade*> Upgrades; // 0x3b0(0x10)
	struct AItem* LoadoutItem; // 0x3c0(0x08)
	struct TArray<struct FWeakObjectPtr<struct AThrowableActor>> ThrownActors; // 0x3c8(0x10)
	char UnknownData_3D8[0x8]; // 0x3d8(0x08)

	void Simulate_Throw(struct AThrowableActor* ActorClass); // Function FSD.ThrowableItem.Simulate_Throw
	void Server_Throw(struct AThrowableActor* ActorClass); // Function FSD.ThrowableItem.Server_Throw
	void ReceiveItemThrown(struct AThrowableActor* thrownActor); // Function FSD.ThrowableItem.ReceiveItemThrown
	void ReceiveItemSpawned(struct AThrowableActor* thrownActor); // Function FSD.ThrowableItem.ReceiveItemSpawned
	void OnThrownActorDestroyed(struct AActor* Actor); // Function FSD.ThrowableItem.OnThrownActorDestroyed
	struct FVector GetThrowLocation(); // Function FSD.ThrowableItem.GetThrowLocation
};

// Class FSD.ArmorRegeneratorItem
// Size: 0x458 (Inherited: 0x3e0)
struct AArmorRegeneratorItem : AThrowableItem {
	char UnknownData_3E0[0x10]; // 0x3e0(0x10)
	struct UCapacityHoldingItemAggregator* ChargeCapacity; // 0x3f0(0x08)
	struct UCapacityHoldingItemAggregator* CarryCapacity; // 0x3f8(0x08)
	float RechargeDuration; // 0x400(0x04)
	int32_t UnchargedCount; // 0x404(0x04)
	float RechargeProgress; // 0x408(0x04)
	float SupplyStatusWeight; // 0x40c(0x04)
	struct UDialogDataAsset* ShoutRecarged; // 0x410(0x08)
	struct FCoolDownProgressStyle RechargeProgressUI; // 0x418(0x40)

	void ReceiveGeneratorReturned(); // Function FSD.ArmorRegeneratorItem.ReceiveGeneratorReturned
	void ReceiveGeneratorRechargeProgress(float Progress); // Function FSD.ArmorRegeneratorItem.ReceiveGeneratorRechargeProgress
	void ReceiveGeneratorRecharged(); // Function FSD.ArmorRegeneratorItem.ReceiveGeneratorRecharged
	void OnRep_UnchargedCount(int32_t OldCount); // Function FSD.ArmorRegeneratorItem.OnRep_UnchargedCount
	bool GetIsRecharging(); // Function FSD.ArmorRegeneratorItem.GetIsRecharging
	void GeneratorReturned(); // Function FSD.ArmorRegeneratorItem.GeneratorReturned
};

// Class FSD.ThrowableActor
// Size: 0x230 (Inherited: 0x220)
struct AThrowableActor : AActor {
	struct UProjectileMovementComponent* Movement; // 0x220(0x08)
	bool IsMoving; // 0x228(0x01)
	bool IgnoreFellOutOfWorld; // 0x229(0x01)
	bool IgnoreOwnersCollision; // 0x22a(0x01)
	char UnknownData_22B[0x5]; // 0x22b(0x05)

	void ReceiveIgnoreCharacter(struct APlayerCharacter* Character); // Function FSD.ThrowableActor.ReceiveIgnoreCharacter
	void ReceiveHitObject(); // Function FSD.ThrowableActor.ReceiveHitObject
	void OnRep_IsMoving(); // Function FSD.ThrowableActor.OnRep_IsMoving
};

// Class FSD.ArmorRegeneratorActor
// Size: 0x240 (Inherited: 0x230)
struct AArmorRegeneratorActor : AThrowableActor {
	float GeneratorRadius; // 0x230(0x04)
	float DeployDelay; // 0x234(0x04)
	bool bPushStatusEffectOnExit; // 0x238(0x01)
	char UnknownData_239[0x3]; // 0x239(0x03)
	float GeneratorLifetime; // 0x23c(0x04)
};

// Class FSD.AsyncLevelPersistanceActor
// Size: 0x240 (Inherited: 0x220)
struct AAsyncLevelPersistanceActor : AActor {
	struct TArray<struct UObject*> References; // 0x220(0x10)
	char UnknownData_230[0x10]; // 0x230(0x10)
};

// Class FSD.AsyncManager
// Size: 0x58 (Inherited: 0x30)
struct UAsyncManager : UGameInstanceSubsystem {
	struct TArray<struct UObject*> PermanentReferences; // 0x30(0x10)
	char UnknownData_40[0x18]; // 0x40(0x18)

	void AsyncLoadSoftObjects(struct TArray<struct TSoftObjectPtr<struct UObject>> Items, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftObjects
	void AsyncLoadSoftObject(struct TSoftObjectPtr<struct UObject> Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftObject
	void AsyncLoadSoftClass(SoftClassProperty Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftClass
	void AsyncLoadAssets(struct TArray<struct FSoftObjectPath> Items, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadAssets
	void AsyncLoadAsset(struct FSoftObjectPath Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadAsset
};

// Class FSD.AttackBaseComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UAttackBaseComponent : UActorComponent {
	char UnknownData_B0[0x10]; // 0xb0(0x10)
	struct FName AttackName; // 0xc0(0x08)
	float MaxSurfaceAngle; // 0xc8(0x04)
	struct FFloatInterval Range; // 0xcc(0x08)
	float MinRange; // 0xd4(0x04)
	float MaxRange; // 0xd8(0x04)
	char UnknownData_DC[0x14]; // 0xdc(0x14)

	struct UAttackBaseComponent* ReplaceAttackComponent(struct UAttackBaseComponent* componentToReplace, struct UAttackBaseComponent* newComponentClass); // Function FSD.AttackBaseComponent.ReplaceAttackComponent
	void ReceiveAttackTarget(struct AActor* Target); // Function FSD.AttackBaseComponent.ReceiveAttackTarget
	void ReceiveAbortAttack(); // Function FSD.AttackBaseComponent.ReceiveAbortAttack
	void CompleteAttack(bool success); // Function FSD.AttackBaseComponent.CompleteAttack
};

// Class FSD.AttackEffect
// Size: 0x28 (Inherited: 0x28)
struct UAttackEffect : UObject {
};

// Class FSD.AttackCooldownComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackCooldownComponent : UActorComponent {
	struct TArray<struct FAttackCooldown> AttackCooldowns; // 0xb0(0x10)

	void SetCooldown(struct FName AttackName, float cooldownSeconds); // Function FSD.AttackCooldownComponent.SetCooldown
	bool IsAttackOffCooldown(struct FName AttackName); // Function FSD.AttackCooldownComponent.IsAttackOffCooldown
	bool IsAnyAttackOffCooldown(); // Function FSD.AttackCooldownComponent.IsAnyAttackOffCooldown
	void AttackUsed(struct FName Name); // Function FSD.AttackCooldownComponent.AttackUsed
};

// Class FSD.AttackerManagerComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackerManagerComponent : UActorComponent {
	struct TArray<struct UAttackerPositioningComponent*> Components; // 0xb0(0x10)
};

// Class FSD.AttackerPositioningComponent
// Size: 0x108 (Inherited: 0xb0)
struct UAttackerPositioningComponent : UActorComponent {
	bool DebugPositions; // 0xb0(0x01)
	char UnknownData_B1[0x3]; // 0xb1(0x03)
	int32_t MaxAttackers; // 0xb4(0x04)
	struct TArray<struct FAttackerInfo> Attackers; // 0xb8(0x10)
	struct TArray<int32_t> FreePositions; // 0xc8(0x10)
	struct TArray<struct FAttackerInfo> FlyingAttackers; // 0xd8(0x10)
	struct TArray<int32_t> FlyingFreePositions; // 0xe8(0x10)
	float CharacterPersonalSphere; // 0xf8(0x04)
	float CharacterHalfHeight; // 0xfc(0x04)
	float CostModifier; // 0x100(0x04)
	char UnknownData_104[0x4]; // 0x104(0x04)

	void UnregisterAttacker(struct AActor* Attacker, bool IsFlying); // Function FSD.AttackerPositioningComponent.UnregisterAttacker
	void RegisterAttacker(struct AActor* Attacker, bool IsFlying); // Function FSD.AttackerPositioningComponent.RegisterAttacker
	void OnFlyingAttackerDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.AttackerPositioningComponent.OnFlyingAttackerDeath
	void OnAttackerDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.AttackerPositioningComponent.OnAttackerDeath
	struct FVector GetFlyingAttackerPosition(struct AActor* Attacker, float AttackerRadius); // Function FSD.AttackerPositioningComponent.GetFlyingAttackerPosition
	struct FVector GetAttackerPosition(struct AActor* Attacker, float AttackerRadius); // Function FSD.AttackerPositioningComponent.GetAttackerPosition
};

// Class FSD.PlayerAttackPositionComponent
// Size: 0x110 (Inherited: 0x108)
struct UPlayerAttackPositionComponent : UAttackerPositioningComponent {
	float OnZiplineFlyingModifier; // 0x108(0x04)
	float OnZiplineWalkingModifier; // 0x10c(0x04)
};

// Class FSD.ObjectAttackerPositioning
// Size: 0x110 (Inherited: 0x108)
struct UObjectAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
};

// Class FSD.CustomObjectAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UCustomObjectAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
	struct TArray<struct FVector> AttackerPositions; // 0x110(0x10)
};

// Class FSD.EnemyAttackerPositioningComponent
// Size: 0x108 (Inherited: 0x108)
struct UEnemyAttackerPositioningComponent : UAttackerPositioningComponent {
};

// Class FSD.EscortMuleAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UEscortMuleAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
	struct TArray<struct FVector> AttackerPositions; // 0x110(0x10)

	void SetNewMaxAttackers(int32_t newMaxAttackers); // Function FSD.EscortMuleAttackerPositioning.SetNewMaxAttackers
	void SetCostModifier(float newModifier); // Function FSD.EscortMuleAttackerPositioning.SetCostModifier
};

// Class FSD.AttackingPointInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttackingPointInterface : UInterface {
};

// Class FSD.AudioFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAudioFunctionLibrary : UBlueprintFunctionLibrary {

	float SetSoundClassVolume(struct USoundClass* SoundClass, float Volume); // Function FSD.AudioFunctionLibrary.SetSoundClassVolume
	void PushTimedSoundMix(struct UObject* contextObject, struct USoundMix* mix, float Duration); // Function FSD.AudioFunctionLibrary.PushTimedSoundMix
	float GetSoundClassVolume(struct USoundClass* SoundClass); // Function FSD.AudioFunctionLibrary.GetSoundClassVolume
};

// Class FSD.SoundClassWidget
// Size: 0x230 (Inherited: 0x230)
struct USoundClassWidget : UUserWidget {
};

// Class FSD.AutoCannon
// Size: 0x758 (Inherited: 0x690)
struct AAutoCannon : AAmmoDrivenWeapon {
	float StartingFireRate; // 0x690(0x04)
	float MaxFireRate; // 0x694(0x04)
	struct FRuntimeFloatCurve FireRateCurve; // 0x698(0x88)
	float FireTimeReductionScale; // 0x720(0x04)
	float FireTimeIncreaseScale; // 0x724(0x04)
	float MaxFireTimeCap; // 0x728(0x04)
	float DamageBonusAtFullROF; // 0x72c(0x04)
	bool StatusEffectAtFullROF; // 0x730(0x01)
	char UnknownData_731[0x3]; // 0x731(0x03)
	float FireTimeOffsetForMaxRateOfFireBonus; // 0x734(0x04)
	float StartLoopingSoundAt; // 0x738(0x04)
	char UnknownData_73C[0x4]; // 0x73c(0x04)
	struct UStatusEffect* StatusAtFullROF; // 0x740(0x08)
	struct UAnimMontage* WPN_Fire_3; // 0x748(0x08)
	float CurrentFireTime; // 0x750(0x04)
	char UnknownData_754[0x4]; // 0x754(0x04)

	void Server_SetStatusActive(bool IsActive); // Function FSD.AutoCannon.Server_SetStatusActive
};

// Class FSD.AutoCannonAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UAutoCannonAnimInstance : UAnimInstance {
};

// Class FSD.AutoCarverComponent
// Size: 0x4c0 (Inherited: 0x480)
struct UAutoCarverComponent : UStaticMeshComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	float Frequency; // 0x488(0x04)
	float ExpensiveNoise; // 0x48c(0x04)
	float MinDistanceMoved; // 0x490(0x04)
	enum class ECarveFilterType Filter; // 0x494(0x01)
	char UnknownData_495[0x3]; // 0x495(0x03)
	struct FMulticastInlineDelegate OnCarveDoneEvent; // 0x498(0x10)
	char UnknownData_4A8[0x18]; // 0x4a8(0x18)

	void ForceCarve(); // Function FSD.AutoCarverComponent.ForceCarve
};

// Class FSD.STLMeshCarverComponent
// Size: 0x410 (Inherited: 0x3f0)
struct USTLMeshCarverComponent : UPrimitiveComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x3f0(0x08)
	struct USTLMeshCarver* MeshCarver; // 0x3f8(0x08)
	enum class ECarveFilterType Filter; // 0x400(0x01)
	bool PreviewEnabled; // 0x401(0x01)
	char UnknownData_402[0xe]; // 0x402(0x0e)
};

// Class FSD.MeshCarverComponent
// Size: 0x4a0 (Inherited: 0x480)
struct UMeshCarverComponent : UStaticMeshComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	enum class ECarveFilterType Filter; // 0x488(0x01)
	char UnknownData_489[0x3]; // 0x489(0x03)
	float ExpensiveNoise; // 0x48c(0x04)
	enum class CarveOptionsCellSize CarverSize; // 0x490(0x01)
	char UnknownData_491[0xf]; // 0x491(0x0f)

	void Carve(); // Function FSD.MeshCarverComponent.Carve
};

// Class FSD.LevelGenerationCarverComponent
// Size: 0x420 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent : UPrimitiveComponent {
	struct USTLMeshCarver* MeshCarver; // 0x3f0(0x08)
	struct UStaticMesh* ConvexCarver; // 0x3f8(0x08)
	struct UStaticMeshCarver* StaticMeshCarver; // 0x400(0x08)
	struct UTerrainMaterialBase* TerrainMaterial; // 0x408(0x08)
	enum class ECarveFilterType Filter; // 0x410(0x01)
	char UnknownData_411[0x3]; // 0x411(0x03)
	float ConvexExpensiveNoise; // 0x414(0x04)
	enum class CarveOptionsCellSize CarveCellSize; // 0x418(0x01)
	bool PreviewEnabled; // 0x419(0x01)
	bool CarvingDisabled; // 0x41a(0x01)
	bool SelfActivate; // 0x41b(0x01)
	char UnknownData_41C[0x4]; // 0x41c(0x04)
};

// Class FSD.RandomizedInstantMeshCarver
// Size: 0x268 (Inherited: 0x220)
struct ARandomizedInstantMeshCarver : AActor {
	struct TArray<struct UStaticMesh*> CarvingMeshes; // 0x220(0x10)
	struct TArray<struct USTLMeshCarver*> STLCarvingMeshes; // 0x230(0x10)
	struct TArray<struct UStaticMeshCarver*> StaticMeshCarvers; // 0x240(0x10)
	struct FRandRange RandomScale; // 0x250(0x08)
	struct UTerrainMaterialBase* TerrainMaterial; // 0x258(0x08)
	enum class ECarveFilterType Filter; // 0x260(0x01)
	char UnknownData_261[0x7]; // 0x261(0x07)
};

// Class FSD.LevelGenerationCarverComponent2
// Size: 0x550 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent2 : UPrimitiveComponent {
	struct ACSGBuilder* Carver; // 0x3f0(0x08)
	bool CarvingDisabled; // 0x3f8(0x01)
	char UnknownData_3F9[0x3]; // 0x3f9(0x03)
	int32_t PreviewSeed; // 0x3fc(0x04)
	struct FBakeSettings CarverSettings; // 0x400(0x140)
	bool SelfActivate; // 0x540(0x01)
	char UnknownData_541[0x7]; // 0x541(0x07)
	struct UCSGPreviewComponent* PreviewComponent; // 0x548(0x08)
};

// Class FSD.Ball
// Size: 0xb0 (Inherited: 0xb0)
struct UBall : UActorComponent {
};

// Class FSD.WindowWidget
// Size: 0x270 (Inherited: 0x230)
struct UWindowWidget : UUserWidget {
	struct FMulticastInlineDelegate OnWindowClosed; // 0x230(0x10)
	char UnknownData_240[0x28]; // 0x240(0x28)
	bool bHandleCloseCommand; // 0x268(0x01)
	bool bResolutionDownscaleWhenOpen; // 0x269(0x01)
	char UnknownData_26A[0x6]; // 0x26a(0x06)

	void WindowDelegate__DelegateSignature(struct UWindowWidget* Window); // DelegateFunction FSD.WindowWidget.WindowDelegate__DelegateSignature
	void ReceiveSelectPreviousCommand(); // Function FSD.WindowWidget.ReceiveSelectPreviousCommand
	void ReceiveSelectNextCommand(); // Function FSD.WindowWidget.ReceiveSelectNextCommand
	void ReceiveSelectCharacterCommand(); // Function FSD.WindowWidget.ReceiveSelectCharacterCommand
	void ReceiveOkCommand(); // Function FSD.WindowWidget.ReceiveOkCommand
	void ReceiveCloseCommand(); // Function FSD.WindowWidget.ReceiveCloseCommand
	void OnShown(); // Function FSD.WindowWidget.OnShown
	void OnNewTopWindow(); // Function FSD.WindowWidget.OnNewTopWindow
	void OnClosed(); // Function FSD.WindowWidget.OnClosed
	void ConsumeCommand(); // Function FSD.WindowWidget.ConsumeCommand
	void CloseThisWindow(); // Function FSD.WindowWidget.CloseThisWindow
};

// Class FSD.BarMenuWidget
// Size: 0x278 (Inherited: 0x270)
struct UBarMenuWidget : UWindowWidget {
	struct FWeakObjectPtr<struct ASpaceRigBar> SpaceRigBar; // 0x270(0x08)
};

// Class FSD.WeaponFireComponent
// Size: 0x110 (Inherited: 0xb0)
struct UWeaponFireComponent : UActorComponent {
	char UnknownData_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnWeaponFired; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnWeaponFireEnded; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnRicochetEvent; // 0xd8(0x10)
	char UnknownData_E8[0x10]; // 0xe8(0x10)
	struct TScriptInterface<None> Weapon; // 0xf8(0x10)
	char UnknownData_108[0x8]; // 0x108(0x08)

	void StopFire(); // Function FSD.WeaponFireComponent.StopFire
	void Server_SetShotPower(float shotPower); // Function FSD.WeaponFireComponent.Server_SetShotPower
	void Fire(struct FVector Origin, struct FVector_NetQuantizeNormal Direction); // Function FSD.WeaponFireComponent.Fire
};

// Class FSD.BasicWeaponFireComponent
// Size: 0x110 (Inherited: 0x110)
struct UBasicWeaponFireComponent : UWeaponFireComponent {

	void Server_FireWeapon(); // Function FSD.BasicWeaponFireComponent.Server_FireWeapon
	void Server_EndFire(); // Function FSD.BasicWeaponFireComponent.Server_EndFire
	void All_WeaponFired(); // Function FSD.BasicWeaponFireComponent.All_WeaponFired
};

// Class FSD.BeltDrivenWeapon
// Size: 0x6c0 (Inherited: 0x690)
struct ABeltDrivenWeapon : AAmmoDrivenWeapon {
	struct UAudioComponent* BarrelAudio; // 0x690(0x08)
	struct USoundCue* BarrelSound; // 0x698(0x08)
	float BarrelFadeIn; // 0x6a0(0x04)
	float BarrelFadeOut; // 0x6a4(0x04)
	struct UCurveFloat* BarrelPitchCurve; // 0x6a8(0x08)
	float BarrelSpinUpTime; // 0x6b0(0x04)
	float BarrelSpinDownTime; // 0x6b4(0x04)
	float CurrentSpinRate; // 0x6b8(0x04)
	bool Simulate_SpinBarrel; // 0x6bc(0x01)
	char UnknownData_6BD[0x3]; // 0x6bd(0x03)

	void Server_StopBarrel(); // Function FSD.BeltDrivenWeapon.Server_StopBarrel
	void Server_StartBarrel(); // Function FSD.BeltDrivenWeapon.Server_StartBarrel
};

// Class FSD.GatlingGun
// Size: 0x720 (Inherited: 0x6c0)
struct AGatlingGun : ABeltDrivenWeapon {
	bool BarrelProximityDamageEnabled; // 0x6c0(0x01)
	char UnknownData_6C1[0x3]; // 0x6c1(0x03)
	float BarrelProximityDamageDistance; // 0x6c4(0x04)
	float BarrelProximityDamageRadius; // 0x6c8(0x04)
	float BarrelProximityDamageLength; // 0x6cc(0x04)
	float TimeBetweenProximityDamageTicks; // 0x6d0(0x04)
	char UnknownData_6D4[0x14]; // 0x6d4(0x14)
	float DamageMultiplierAtMaxStabilization; // 0x6e8(0x04)
	char UnknownData_6EC[0x4]; // 0x6ec(0x04)
	struct UFXSystemAsset* HotShellsTracerParticles; // 0x6f0(0x08)
	char UnknownData_6F8[0x8]; // 0x6f8(0x08)
	float HeatRemovedOnKill; // 0x700(0x04)
	bool CriticalOverheatEnabled; // 0x704(0x01)
	bool HotShellsOn; // 0x705(0x01)
	char UnknownData_706[0x2]; // 0x706(0x02)
	float HotShellsTemperatureRequired; // 0x708(0x04)
	char UnknownData_70C[0x4]; // 0x70c(0x04)
	struct UDamageComponent* DamageComponent; // 0x710(0x08)
	struct UDamageComponent* BarrelProximityDamageComponent; // 0x718(0x08)

	void Server_SetHotShellsOn(bool hotShellsIsOn); // Function FSD.GatlingGun.Server_SetHotShellsOn
	void OnRep_HotShellsTracerOn(); // Function FSD.GatlingGun.OnRep_HotShellsTracerOn
	void OnGatlingTemperatureChanged(float Temperature, bool isOverheated); // Function FSD.GatlingGun.OnGatlingTemperatureChanged
	void OnEnemyKilled(struct AActor* Target, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.GatlingGun.OnEnemyKilled
	void Client_RemoveHeat(); // Function FSD.GatlingGun.Client_RemoveHeat
};

// Class FSD.BeltDrivenAnimInstance
// Size: 0x2a0 (Inherited: 0x270)
struct UBeltDrivenAnimInstance : UAnimInstance {
	float BarrelSpinRate; // 0x268(0x04)
	float CurrentBarrelSpinRate; // 0x26c(0x04)
	bool IsFiring; // 0x270(0x01)
	bool Overheated; // 0x271(0x01)
	struct FVector ExternalForce; // 0x274(0x0c)
	float ExternalForceScale; // 0x280(0x04)
	struct FName ExternalForceBoneName; // 0x284(0x08)
	char UnknownData_292[0xe]; // 0x292(0x0e)
};

// Class FSD.Biome
// Size: 0x428 (Inherited: 0x30)
struct UBiome : UDataAsset {
	struct FText BiomeName; // 0x30(0x18)
	struct FText BiomeShortName; // 0x48(0x18)
	struct FText BiomeDescription; // 0x60(0x18)
	struct FColor BiomeColor; // 0x78(0x04)
	int32_t BiomeIndex; // 0x7c(0x04)
	struct FString BiomeAnalyticsIndex; // 0x80(0x10)
	struct TSoftObjectPtr<struct UFileMediaSource> BiomeMovie; // 0x90(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomePicture; // 0xb8(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeIcon; // 0xe0(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeLargeImage; // 0x108(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeWorldMap; // 0x130(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeMissionBar; // 0x158(0x28)
	SoftClassProperty BiomeMapWidget; // 0x180(0x28)
	struct FHeatSource BiomeHeatSource; // 0x1a8(0x08)
	struct FRandRange DepthRange; // 0x1b0(0x08)
	struct TSoftObjectPtr<struct UParticleSystem> AtmosphericParticles; // 0x1b8(0x28)
	struct TArray<SoftClassProperty> CaveScriptComponents; // 0x1e0(0x10)
	float ExtraCaveSize; // 0x1f0(0x04)
	char UnknownData_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct UDebrisSet*> Debris; // 0x1f8(0x10)
	SoftClassProperty DebrisActor; // 0x208(0x28)
	struct TArray<struct FBiomeDebrisInfluencerVariant> DebrisInfluencerVariants; // 0x230(0x10)
	SoftClassProperty PostProcessActorClass; // 0x240(0x28)
	struct UTerrainMaterial* RockMaterial; // 0x268(0x08)
	struct UTerrainMaterial* DirtMaterial; // 0x270(0x08)
	struct UTerrainMaterial* BurnedMaterialOverride; // 0x278(0x08)
	struct TArray<struct FBiomeNoiseItem> RoomNoises; // 0x280(0x10)
	struct UMissionStat* MissionCompleted; // 0x290(0x08)
	struct UFloodFillSettings* CeilingNoise; // 0x298(0x08)
	struct UDetailNoise* CeilingDetailNoise; // 0x2a0(0x08)
	struct UFloodFillSettings* WallNoise; // 0x2a8(0x08)
	struct UDetailNoise* WallDetailNoise; // 0x2b0(0x08)
	struct UFloodFillSettings* FloorNoise; // 0x2b8(0x08)
	struct UDetailNoise* FloorDetailNoise; // 0x2c0(0x08)
	struct UFloodFillSettings* PillarNoise; // 0x2c8(0x08)
	struct UDetailNoise* PillarDetailNoise; // 0x2d0(0x08)
	struct UPillarSettings* PillarSettings; // 0x2d8(0x08)
	struct TArray<struct UTunnelSetting*> TunnelSettings; // 0x2e0(0x10)
	struct UFloodFillSettings* TunnelCeilingNoise; // 0x2f0(0x08)
	struct UFloodFillSettings* TunnelWallNoise; // 0x2f8(0x08)
	struct UFloodFillSettings* TunnelFloorNoise; // 0x300(0x08)
	struct TArray<struct FResourceSpawner> Resources; // 0x308(0x10)
	struct TArray<struct FBiomeEnemyEntry> Enemies; // 0x318(0x10)
	struct TArray<struct UEnemyDescriptor*> BannedEnemies; // 0x328(0x10)
	struct TArray<struct UEnemyDescriptor*> StationaryEnemies; // 0x338(0x10)
	struct TArray<struct UCritterDescriptor*> Critters; // 0x348(0x10)
	struct TSoftObjectPtr<struct USoundCue> AmbientSounds; // 0x358(0x28)
	bool Use3DAmbient; // 0x380(0x01)
	char UnknownData_381[0x7]; // 0x381(0x07)
	struct FReverbSettings ReverbSettings; // 0x388(0x20)
	float SmallCaveReverbVolume; // 0x3a8(0x04)
	char UnknownData_3AC[0x4]; // 0x3ac(0x04)
	struct UReverbEffect* SmallCaveReverb; // 0x3b0(0x08)
	float MediumCaveReverbVolume; // 0x3b8(0x04)
	char UnknownData_3BC[0x4]; // 0x3bc(0x04)
	struct UReverbEffect* MediumCaveReverb; // 0x3c0(0x08)
	float LargeCaveReverbVolume; // 0x3c8(0x04)
	char UnknownData_3CC[0x4]; // 0x3cc(0x04)
	struct UReverbEffect* LargeCaveReverb; // 0x3d0(0x08)
	struct TSoftObjectPtr<struct ULevelSequence> BiomeLoaderLevelSequence; // 0x3d8(0x28)
	struct FString BiomeLoaderLevelName; // 0x400(0x10)
	struct TArray<struct FText> Quotes; // 0x410(0x10)
	float PlanetZoneSelectionWeight; // 0x420(0x04)
	char UnknownData_424[0x4]; // 0x424(0x04)

	struct UTerrainMaterial* GetRockMaterial(); // Function FSD.Biome.GetRockMaterial
	SoftClassProperty GetPostProcessActorClass_Soft(); // Function FSD.Biome.GetPostProcessActorClass_Soft
	struct UTerrainMaterial* GetDirtMaterial(); // Function FSD.Biome.GetDirtMaterial
	SoftClassProperty GetDebrisActorSoftClass(); // Function FSD.Biome.GetDebrisActorSoftClass
	struct UTexture2D* GetBiomeWorldMap(); // Function FSD.Biome.GetBiomeWorldMap
	struct UTexture2D* GetBiomePicture(); // Function FSD.Biome.GetBiomePicture
	struct FText GetBiomeName(); // Function FSD.Biome.GetBiomeName
	struct UTexture2D* GetBiomeMissionBar(); // Function FSD.Biome.GetBiomeMissionBar
	struct UUserWidget* GetBiomeMapWidget(); // Function FSD.Biome.GetBiomeMapWidget
	struct TArray<struct FSoftObjectPath> GetBiomeMapAssetList(); // Function FSD.Biome.GetBiomeMapAssetList
	struct UTexture2D* GetBiomeLargeImage(); // Function FSD.Biome.GetBiomeLargeImage
	int32_t GetBiomeIndex(); // Function FSD.Biome.GetBiomeIndex
	struct UTexture2D* GetBiomeIcon(); // Function FSD.Biome.GetBiomeIcon
	struct FString GetBiomeAnalyticsIndex(); // Function FSD.Biome.GetBiomeAnalyticsIndex
	struct UParticleSystem* GetAtmosphericParticles(); // Function FSD.Biome.GetAtmosphericParticles
	struct USoundCue* GetAmbientSounds(); // Function FSD.Biome.GetAmbientSounds
};

// Class FSD.BobbingComponent
// Size: 0x220 (Inherited: 0x1f0)
struct UBobbingComponent : USceneComponent {
	struct FMulticastInlineDelegate OnMovedIntoSomethingEvent; // 0x1f0(0x10)
	struct AActor* OwnerActor; // 0x200(0x08)
	bool DoOrientationChecks; // 0x208(0x01)
	char UnknownData_209[0x3]; // 0x209(0x03)
	float BobSpeed; // 0x20c(0x04)
	float BobSize; // 0x210(0x04)
	float OrentationChecksPerSecond; // 0x214(0x04)
	char UnknownData_218[0x8]; // 0x218(0x08)

	void SetOwner(struct AActor* AActor); // Function FSD.BobbingComponent.SetOwner
};

// Class FSD.BoltActionWeapon
// Size: 0x7a8 (Inherited: 0x690)
struct ABoltActionWeapon : AAmmoDrivenWeapon {
	struct FMulticastInlineDelegate FullyFocusedEvent; // 0x690(0x10)
	struct UDamageComponent* DamageComponent; // 0x6a0(0x08)
	struct UHitscanBaseComponent* HitscanComponent; // 0x6a8(0x08)
	struct UStatusEffect* FocusedHitSTE; // 0x6b0(0x08)
	bool RequireWeakspotForFocusedHitSTE; // 0x6b8(0x01)
	bool IsNoGravityOnFocusEnabled; // 0x6b9(0x01)
	char UnknownData_6BA[0x2]; // 0x6ba(0x02)
	float NoGravityOnFocusDuration; // 0x6bc(0x04)
	float NoGravityFocusFallFriction; // 0x6c0(0x04)
	float NoGravityFocusGravityScale; // 0x6c4(0x04)
	char UnknownData_6C8[0x4]; // 0x6c8(0x04)
	float ZoomSpreadAmount; // 0x6cc(0x04)
	float ZoomMinSpreadWhileMoving; // 0x6d0(0x04)
	char UnknownData_6D4[0x4]; // 0x6d4(0x04)
	float ChargeSpeed; // 0x6d8(0x04)
	float ChargeAmmoCost; // 0x6dc(0x04)
	float ChargeRecoilMult; // 0x6e0(0x04)
	char UnknownData_6E4[0x14]; // 0x6e4(0x14)
	struct USoundCue* ZoomedInAudio; // 0x6f8(0x08)
	struct UParticleSystem* ChargedShotTrailParticles; // 0x700(0x08)
	struct FTracerData ChargedShotTracer; // 0x708(0x30)
	struct USoundCue* ChargedShotFireSound; // 0x738(0x08)
	float ChargedFoVChange; // 0x740(0x04)
	float ChargedFoVFadeSpeed; // 0x744(0x04)
	float MinCharge; // 0x748(0x04)
	float SlowMovementAtCharge; // 0x74c(0x04)
	float FullChargeDamageBonus; // 0x750(0x04)
	float AimedShotStaggerChance; // 0x754(0x04)
	float AimedWeakspotKilLRange; // 0x758(0x04)
	char UnknownData_75C[0x4]; // 0x75c(0x04)
	float TargetKilledReloadTimeBoost; // 0x760(0x04)
	float TargetKilledReloadTimeBoostDuration; // 0x764(0x04)
	char UnknownData_768[0x12]; // 0x768(0x12)
	bool LastShotWasAimed; // 0x77a(0x01)
	char UnknownData_77B[0xd]; // 0x77b(0x0d)
	bool IsMovementSlowed; // 0x788(0x01)
	char UnknownData_789[0x17]; // 0x789(0x17)
	bool ChargeAffectsDamage; // 0x7a0(0x01)
	bool Charging; // 0x7a1(0x01)
	char UnknownData_7A2[0x2]; // 0x7a2(0x02)
	float ChargeProgress; // 0x7a4(0x04)

	void SetOverheated(bool isOverheated); // Function FSD.BoltActionWeapon.SetOverheated
	void Server_SetIsMovementSlowed(bool bisMovementSlowed); // Function FSD.BoltActionWeapon.Server_SetIsMovementSlowed
	void Server_SetIsLatestShotFocused(bool bisShotFocused); // Function FSD.BoltActionWeapon.Server_SetIsLatestShotFocused
	void Server_SetIsChargingShot(bool bisCharging); // Function FSD.BoltActionWeapon.Server_SetIsChargingShot
	void OnTimerElapsed(); // Function FSD.BoltActionWeapon.OnTimerElapsed
	void OnTargetKilled(struct AActor* Target, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.BoltActionWeapon.OnTargetKilled
	void OnTargetDamaged(struct UHealthComponentBase* Health, float amount, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.BoltActionWeapon.OnTargetDamaged
	void OnShotPowerSet(); // Function FSD.BoltActionWeapon.OnShotPowerSet
	void OnMovementSlowed(bool isSlowed); // Function FSD.BoltActionWeapon.OnMovementSlowed
	void Client_OnTargetKilled(bool BoostReloadTime); // Function FSD.BoltActionWeapon.Client_OnTargetKilled
};

// Class FSD.BoltActionWeaponAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UBoltActionWeaponAnimInstance : UAnimInstance {
};

// Class FSD.Bomber
// Size: 0x540 (Inherited: 0x478)
struct ABomber : AAFlyingBug {
	struct UAudioComponent* GooSoundComponent; // 0x478(0x08)
	struct UParticleSystemComponent* AcidEmitterLeft; // 0x480(0x08)
	struct UParticleSystemComponent* AcidEmitterRight; // 0x488(0x08)
	char UnknownData_490[0x28]; // 0x490(0x28)
	struct AProjectile* AcidProjectile; // 0x4b8(0x08)
	struct UParticleSystem* deathParticles; // 0x4c0(0x08)
	struct USoundBase* deathSound; // 0x4c8(0x08)
	struct USoundBase* DeathPanicSound; // 0x4d0(0x08)
	struct UParticleSystem* BleedParticles; // 0x4d8(0x08)
	struct USoundBase* BladderDestroyedNoise; // 0x4e0(0x08)
	struct FWeakObjectPtr<struct UParticleSystemComponent> BleedParticlesComponent; // 0x4e8(0x08)
	struct FWeakObjectPtr<struct UAudioComponent> PanicAudioComponent; // 0x4f0(0x08)
	float RagdollForceModifier; // 0x4f8(0x04)
	float DeathYRotationSpeed; // 0x4fc(0x04)
	float DeathXRotationSpeed; // 0x500(0x04)
	float SearchRange; // 0x504(0x04)
	float NewPointMax; // 0x508(0x04)
	float NewPointMin; // 0x50c(0x04)
	float DeathSpeed; // 0x510(0x04)
	float DeathAcceleration; // 0x514(0x04)
	float AcidRate; // 0x518(0x04)
	float PostDeathAcidTime; // 0x51c(0x04)
	char UnknownData_520[0x18]; // 0x520(0x18)
	bool HasDied; // 0x538(0x01)
	bool IsRightDestroyed; // 0x539(0x01)
	bool IsLeftDestroyed; // 0x53a(0x01)
	bool dropAcid; // 0x53b(0x01)
	char UnknownData_53C[0x4]; // 0x53c(0x04)

	void StopSpinAndDie(); // Function FSD.Bomber.StopSpinAndDie
	void SetDropAcid(bool dropAcid); // Function FSD.Bomber.SetDropAcid
	void OnStartDeathPanic(); // Function FSD.Bomber.OnStartDeathPanic
	void OnRep_DropAcid(); // Function FSD.Bomber.OnRep_DropAcid
	void OnRep_Death(); // Function FSD.Bomber.OnRep_Death
	void OnRagdollHitGround(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult Hit); // Function FSD.Bomber.OnRagdollHitGround
	void OnBladderDamage(float amount); // Function FSD.Bomber.OnBladderDamage
	void OnArmorDestroyed(struct FName Name); // Function FSD.Bomber.OnArmorDestroyed
	void HideMesh(); // Function FSD.Bomber.HideMesh
	bool GetDropAcid(); // Function FSD.Bomber.GetDropAcid
	bool AreBladdersDestroyed(); // Function FSD.Bomber.AreBladdersDestroyed
};

// Class FSD.BomberAnimInstance
// Size: 0x300 (Inherited: 0x2f0)
struct UBomberAnimInstance : UFlyingBugAnimInstance {
	bool IsBombing; // 0x2f0(0x01)
	bool IsSpiraling; // 0x2f1(0x01)
	char UnknownData_2F2[0xe]; // 0x2f2(0x0e)
};

// Class FSD.BoscoAbillity
// Size: 0x68 (Inherited: 0x30)
struct UBoscoAbillity : UDataAsset {
	struct FName AbillityName; // 0x30(0x08)
	struct UAnimSequenceBase* AbillityAnimation; // 0x38(0x08)
	struct USoundBase* VoiceOnUse; // 0x40(0x08)
	enum class EBoscoAbillityTargetPreference TargetType; // 0x48(0x01)
	char UnknownData_49[0x3]; // 0x49(0x03)
	float Cooldown; // 0x4c(0x04)
	float WindUp; // 0x50(0x04)
	float Duration; // 0x54(0x04)
	float Range; // 0x58(0x04)
	float RechargeTime; // 0x5c(0x04)
	int32_t MaxCharges; // 0x60(0x04)
	bool TargetActorIfValid; // 0x64(0x01)
	bool RotateTowardsTarget; // 0x65(0x01)
	char UnknownData_66[0x2]; // 0x66(0x02)
};

// Class FSD.BoscoSpawnActorAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoSpawnActorAbillity : UBoscoAbillity {
	struct AActor* SpawnedActorClass; // 0x68(0x08)
};

// Class FSD.BoscoProjectileAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoProjectileAbillity : UBoscoAbillity {
	struct AProjectile* projectileClass; // 0x68(0x08)
};

// Class FSD.Bosco
// Size: 0x6c8 (Inherited: 0x378)
struct ABosco : ADeepPathfinderCharacter {
	char UnknownData_378[0x38]; // 0x378(0x38)
	struct UHealthComponent* HealthComponent; // 0x3b0(0x08)
	struct UBoscoAbillityComponent* AbillityComponent; // 0x3b8(0x08)
	struct UDamageComponent* Damage; // 0x3c0(0x08)
	struct UPawnSensingComponent* Senses; // 0x3c8(0x08)
	struct UDroneMiningToolBase* MiningTool; // 0x3d0(0x08)
	struct UBobbingComponent* BobbingComponent; // 0x3d8(0x08)
	struct USkeletalMeshComponent* BoscoMesh; // 0x3e0(0x08)
	struct UHitscanComponent* DroneHitScan; // 0x3e8(0x08)
	struct USpotLightComponent* SpotLightComponent; // 0x3f0(0x08)
	struct UPointLightComponent* PointLightComponent; // 0x3f8(0x08)
	struct UParticleSystemComponent* LTrail; // 0x400(0x08)
	struct UParticleSystemComponent* RTrail; // 0x408(0x08)
	struct UAudioComponent* MomentumSound; // 0x410(0x08)
	struct UDialogDataAsset* DefendDrilldozerShout; // 0x418(0x08)
	struct UDialogDataAsset* MineOrderShout; // 0x420(0x08)
	struct UDialogDataAsset* KillOrderShout; // 0x428(0x08)
	struct UDialogDataAsset* GoToOrderShout; // 0x430(0x08)
	struct UDialogDataAsset* ReviveOrderShout; // 0x438(0x08)
	struct UDialogDataAsset* PickupGemShout; // 0x440(0x08)
	struct UDialogDataAsset* ReviveThankShout; // 0x448(0x08)
	struct UDialogDataAsset* GeneralCallShout; // 0x450(0x08)
	struct UDialogDataAsset* RocketAbillityShout; // 0x458(0x08)
	struct UDialogDataAsset* CryoGrenadeAbillityShout; // 0x460(0x08)
	struct USoundBase* MineResponse; // 0x468(0x08)
	struct USoundBase* CombatResponse; // 0x470(0x08)
	struct USoundBase* LightResponse; // 0x478(0x08)
	struct USoundBase* ReviveResponse; // 0x480(0x08)
	struct USoundBase* AbillityResponse; // 0x488(0x08)
	struct USoundBase* CurrentResponse; // 0x490(0x08)
	float ResponseTime; // 0x498(0x04)
	char UnknownData_49C[0x4]; // 0x49c(0x04)
	struct FMulticastInlineDelegate OnReviveused; // 0x4a0(0x10)
	struct FMulticastInlineDelegate OnStateChanged; // 0x4b0(0x10)
	char UnknownData_4C0[0x10]; // 0x4c0(0x10)
	float CarryingSpeed; // 0x4d0(0x04)
	float CarryingAcceleration; // 0x4d4(0x04)
	float CarryingDampOmega; // 0x4d8(0x04)
	char UnknownData_4DC[0x14]; // 0x4dc(0x14)
	struct FGameplayTagContainer LosMatchTags; // 0x4f0(0x20)
	float SeeTargetTime; // 0x510(0x04)
	char UnknownData_514[0x4]; // 0x514(0x04)
	struct USoundBase* AbillityErrorSound; // 0x518(0x08)
	float INcreasedMiningArea; // 0x520(0x04)
	float TimeToResetMiningBoost; // 0x524(0x04)
	float MiningBoosMultiplier; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct TArray<struct UItemUpgrade*> Upgrades; // 0x530(0x10)
	struct UBoscoProjectileAbillity* RocketAbillity; // 0x540(0x08)
	struct UBoscoProjectileAbillity* CryoGrenadeAbillity; // 0x548(0x08)
	struct FGuid SavegameID; // 0x550(0x10)
	struct UItemID* ItemID; // 0x560(0x08)
	struct UUpgradableBoscoComponent* Upgradable; // 0x568(0x08)
	struct UAnimSequenceBase* SaluteAnimation; // 0x570(0x08)
	struct UAnimSequenceBase* PickupGemAnimation; // 0x578(0x08)
	struct UAnimSequenceBase* DropGemAnimation; // 0x580(0x08)
	struct TArray<struct UAnimSequenceBase*> HitReaction; // 0x588(0x10)
	float SaluteDuration; // 0x598(0x04)
	char UnknownData_59C[0x4]; // 0x59c(0x04)
	struct UDroneSkinnableComponent* Skinnable; // 0x5a0(0x08)
	struct TArray<struct FBoscoLightSetting> LightSettings; // 0x5a8(0x10)
	int32_t TargetLightSetting; // 0x5b8(0x04)
	char UnknownData_5BC[0x4]; // 0x5bc(0x04)
	struct TArray<struct UBoscoAbillity*> CombatAbillities; // 0x5c0(0x10)
	struct AActor* RotateTarget; // 0x5d0(0x08)
	struct FVector LookAtLocation; // 0x5d8(0x0c)
	char UnknownData_5E4[0x4]; // 0x5e4(0x04)
	struct USoundCue* ShootSound; // 0x5e8(0x08)
	float ShootSoundFadeout; // 0x5f0(0x04)
	char UnknownData_5F4[0x4]; // 0x5f4(0x04)
	struct USoundCue* ShootSoundTail; // 0x5f8(0x08)
	struct UAudioComponent* ShootSoundInstance; // 0x600(0x08)
	struct UParticleSystem* MuzzleEffect; // 0x608(0x08)
	struct UParticleSystem* TracerEffect; // 0x610(0x08)
	float FireRate; // 0x618(0x04)
	int32_t MinShotsInBurst; // 0x61c(0x04)
	int32_t MaxShotsInBurst; // 0x620(0x04)
	float MaxRandomBurstCooldown; // 0x624(0x04)
	float MinRandomBurstCooldown; // 0x628(0x04)
	float MaxFiringAngle; // 0x62c(0x04)
	float MaxEngagementRange; // 0x630(0x04)
	float MinTracerDistance; // 0x634(0x04)
	float TracerSpeed; // 0x638(0x04)
	char UnknownData_63C[0x4]; // 0x63c(0x04)
	struct USoundBase* ReviveSirens; // 0x640(0x08)
	struct FWeakObjectPtr<struct UAudioComponent> ReviveSirensComponent; // 0x648(0x08)
	float DistanceToFacePlayer; // 0x650(0x04)
	float RotationSpeed; // 0x654(0x04)
	float PrepareToMineRange; // 0x658(0x04)
	float MiningRange; // 0x65c(0x04)
	char UnknownData_660[0x34]; // 0x660(0x34)
	int32_t MaxRevives; // 0x694(0x04)
	char UnknownData_698[0x10]; // 0x698(0x10)
	bool IsFiring; // 0x6a8(0x01)
	bool IsInRangeToMine; // 0x6a9(0x01)
	bool IsPreparedToMine; // 0x6aa(0x01)
	bool IsMining; // 0x6ab(0x01)
	bool IsReviving; // 0x6ac(0x01)
	bool IsRotateMode; // 0x6ad(0x01)
	char UnknownData_6AE[0xa]; // 0x6ae(0x0a)
	struct ABoscoController* DroneController; // 0x6b8(0x08)
	enum class EDroneAIState CurrentState; // 0x6c0(0x01)
	char UnknownData_6C1[0x7]; // 0x6c1(0x07)

	void UseABillity(); // Function FSD.Bosco.UseABillity
	void StopShootingSound(); // Function FSD.Bosco.StopShootingSound
	void StateChanged(enum class EDroneAIState aCurrentState); // Function FSD.Bosco.StateChanged
	void StartSelfDestruct(); // Function FSD.Bosco.StartSelfDestruct
	void SetIsReviving(bool aIsReviving); // Function FSD.Bosco.SetIsReviving
	void SetIsRepairing(bool isRepairing); // Function FSD.Bosco.SetIsRepairing
	void SelfDestruct(); // Function FSD.Bosco.SelfDestruct
	void ReviveCounterChanged(int32_t remainingCharges); // Function FSD.Bosco.ReviveCounterChanged
	void Respond(); // Function FSD.Bosco.Respond
	void PlaySalute(); // Function FSD.Bosco.PlaySalute
	void OnWeaponFired(struct FVector Location); // Function FSD.Bosco.OnWeaponFired
	void OnRep_State(enum class EDroneAIState prevState); // Function FSD.Bosco.OnRep_State
	void OnReadyToShoot(); // Function FSD.Bosco.OnReadyToShoot
	void OnNotReadyToShoot(); // Function FSD.Bosco.OnNotReadyToShoot
	void OnHit(float amount, float BaseAmount, struct UPrimitiveComponent* Component, struct UFSDPhysicalMaterial* PhysMat, struct FName BoneName); // Function FSD.Bosco.OnHit
	void OnGrabbedGem(); // Function FSD.Bosco.OnGrabbedGem
	void MineEffects(struct UTerrainMaterial* aTerrainMaterial, struct FVector_NetQuantize aLocation, struct FRotator aRotation); // Function FSD.Bosco.MineEffects
	struct UUpgradableBoscoComponent* GetUpgradeComponent(); // Function FSD.Bosco.GetUpgradeComponent
	int32_t GetReviveCharges(); // Function FSD.Bosco.GetReviveCharges
	struct UBoscoAbillityComponent* GetPlayerAbillity(); // Function FSD.Bosco.GetPlayerAbillity
	enum class EDroneAIState GetCurrentState(); // Function FSD.Bosco.GetCurrentState
	bool GetCarryInterrupted(); // Function FSD.Bosco.GetCarryInterrupted
	bool DoPickupGemAnimation(); // Function FSD.Bosco.DoPickupGemAnimation
	void All_OnSelfDestruct(); // Function FSD.Bosco.All_OnSelfDestruct
};

// Class FSD.BoscoAnimInstance
// Size: 0x2a0 (Inherited: 0x270)
struct UBoscoAnimInstance : UAnimInstance {
	struct FMulticastInlineDelegate OnWeaponsReady; // 0x268(0x10)
	struct FMulticastInlineDelegate OnWeaponsNotReady; // 0x278(0x10)
	float DigAnimPlayRate; // 0x288(0x04)
	enum class EDroneAIState CurrentState; // 0x28c(0x01)
	bool IsReadyToMine; // 0x28d(0x01)
	bool IsMining; // 0x28e(0x01)
	bool IsFiring; // 0x28f(0x01)
	bool IsReviving; // 0x290(0x01)
	bool IsCarryingGem; // 0x291(0x01)
	char UnknownData_29A[0x6]; // 0x29a(0x06)
};

// Class FSD.BoscoWeaponsFoldedOutNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedOutNotify : UAnimNotify {
};

// Class FSD.BoscoWeaponsFoldedInNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedInNotify : UAnimNotify {
};

// Class FSD.BoscoAbillityComponent
// Size: 0x150 (Inherited: 0xb0)
struct UBoscoAbillityComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAbillityChargeProgress; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAbillityChargeUsed; // 0xc0(0x10)
	struct TArray<struct UItemUpgrade*> Upgrades; // 0xd0(0x10)
	char UnknownData_E0[0x10]; // 0xe0(0x10)
	struct AProjectileBase* projectileClass; // 0xf0(0x08)
	struct UAnimSequenceBase* Animation; // 0xf8(0x08)
	struct USoundBase* VoiceOnUse; // 0x100(0x08)
	struct FWeakObjectPtr<struct AActor> Target; // 0x108(0x08)
	struct FWeakObjectPtr<struct ABosco> AbillityOwner; // 0x110(0x08)
	char UnknownData_118[0x38]; // 0x118(0x38)

	int32_t GetMaxCharges(); // Function FSD.BoscoAbillityComponent.GetMaxCharges
	int32_t GetCharges(); // Function FSD.BoscoAbillityComponent.GetCharges
};

// Class FSD.FSDAIController
// Size: 0x358 (Inherited: 0x328)
struct AFSDAIController : AAIController {
	struct FMulticastInlineDelegate OnMessageBehaviorTreeEvent; // 0x328(0x10)
	struct FMulticastInlineDelegate OnAlertedEvent; // 0x338(0x10)
	char LOSTraceChannel; // 0x348(0x01)
	char UnknownData_349[0x3]; // 0x349(0x03)
	struct FWeakObjectPtr<struct APlayerCharacter> TargetedPlayer; // 0x34c(0x08)
	char UnknownData_354[0x4]; // 0x354(0x04)

	void SetAlerted(bool isAlerted); // Function FSD.FSDAIController.SetAlerted
	void ResumeLogic(); // Function FSD.FSDAIController.ResumeLogic
	void RegisterBlackboardChanges(struct FName Key); // Function FSD.FSDAIController.RegisterBlackboardChanges
	void Recieve_BlackboardValueChanged(struct FName KeyName); // Function FSD.FSDAIController.Recieve_BlackboardValueChanged
	void PauseLogic(); // Function FSD.FSDAIController.PauseLogic
	void OnAttackingChanged(bool attacking); // Function FSD.FSDAIController.OnAttackingChanged
	bool GetIsAlerted(); // Function FSD.FSDAIController.GetIsAlerted
};

// Class FSD.BoscoController
// Size: 0x5c0 (Inherited: 0x358)
struct ABoscoController : AFSDAIController {
	struct UBehaviorTree* BehaviourTree; // 0x358(0x08)
	float CheckOutOfTheWayInterval; // 0x360(0x04)
	char UnknownData_364[0x8]; // 0x364(0x08)
	float DistCountAsSameHit; // 0x36c(0x04)
	struct FMulticastInlineDelegate OnFollowTargetChangedDelegate; // 0x370(0x10)
	char UnknownData_380[0xb8]; // 0x380(0xb8)
	struct UTerrainMaterial* HearthstoneCrystalMaterial; // 0x438(0x08)
	float SearchForEnemiesInterval; // 0x440(0x04)
	char UnknownData_444[0x4]; // 0x444(0x04)
	float SaluteDelay; // 0x448(0x04)
	char UnknownData_44C[0x4]; // 0x44c(0x04)
	float SaluteCooldown; // 0x450(0x04)
	char UnknownData_454[0x4]; // 0x454(0x04)
	float CheckGraberInterval; // 0x458(0x04)
	char UnknownData_45C[0x4]; // 0x45c(0x04)
	float MaxThrowStrength; // 0x460(0x04)
	float MaxThrowRange; // 0x464(0x04)
	float RepairRange; // 0x468(0x04)
	float DistanceCountedAsClose; // 0x46c(0x04)
	struct FGameplayTagQuery TargetQuery; // 0x470(0x48)
	struct FGameplayTagQuery LaserPointerTargetQuery; // 0x4b8(0x48)
	struct FGameplayTagQuery FollowTargetTagQuery; // 0x500(0x48)
	float ReviveHealthPercentage; // 0x548(0x04)
	char UnknownData_54C[0x4]; // 0x54c(0x04)
	struct UDroneUseComponent* CurrentUse; // 0x550(0x08)
	struct AGem* TryingToPickGem; // 0x558(0x08)
	char UnknownData_560[0x60]; // 0x560(0x60)

	void ReviveTarget(); // Function FSD.BoscoController.ReviveTarget
	void ResetToFollowState(); // Function FSD.BoscoController.ResetToFollowState
	void RegisterPlayer(struct APlayerCharacter* APlayerCharacter); // Function FSD.BoscoController.RegisterPlayer
	void PickupGem(); // Function FSD.BoscoController.PickupGem
	void OnUseDone(int32_t TimesUsed); // Function FSD.BoscoController.OnUseDone
	void OnSecondaryLaserPointer(struct AActor* aTarget, struct FVector aLocation); // Function FSD.BoscoController.OnSecondaryLaserPointer
	void OnPlayerShout(struct APlayerCharacter* APlayerCharacter); // Function FSD.BoscoController.OnPlayerShout
	void OnPlayerSalute(struct APlayerCharacter* aCharacater); // Function FSD.BoscoController.OnPlayerSalute
	void OnPlayerLeave(struct AFSDPlayerState* APlayerState); // Function FSD.BoscoController.OnPlayerLeave
	void OnLaserPointer(struct FLaserPointerTarget HitInfo); // Function FSD.BoscoController.OnLaserPointer
	void OnJobFinished(); // Function FSD.BoscoController.OnJobFinished
	void OnEscortTargetDied(struct UHealthComponentBase* Health); // Function FSD.BoscoController.OnEscortTargetDied
	struct FVector GetPointNearPlayers(); // Function FSD.BoscoController.GetPointNearPlayers
	struct AActor* GetFollowTarget(); // Function FSD.BoscoController.GetFollowTarget
	void GenerateRelativeLocation(struct AActor* aTarget, float aRange, float aHeightRestriction, float aMinRange, bool aTryToStayOutOfTheWay, bool aStayBehind); // Function FSD.BoscoController.GenerateRelativeLocation
	void GemUsed(struct APlayerCharacter* usedBy); // Function FSD.BoscoController.GemUsed
	void ConfirmPickup(); // Function FSD.BoscoController.ConfirmPickup
};

// Class FSD.SimpleBossFight
// Size: 0x48 (Inherited: 0x28)
struct USimpleBossFight : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct FBossFight BossFight; // 0x30(0x18)
};

// Class FSD.BossFightInterface
// Size: 0x28 (Inherited: 0x28)
struct UBossFightInterface : UInterface {

	bool IsStillValid(); // Function FSD.BossFightInterface.IsStillValid
	struct UBossFightWidget* GetWidgetClass(); // Function FSD.BossFightInterface.GetWidgetClass
	struct AActor* GetBossActor(); // Function FSD.BossFightInterface.GetBossActor
};

// Class FSD.BossFightWidget
// Size: 0x240 (Inherited: 0x230)
struct UBossFightWidget : UUserWidget {
	struct TScriptInterface<None> BossFight; // 0x230(0x10)
};

// Class FSD.BoxFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBoxFunctionLibrary : UBlueprintFunctionLibrary {

	struct FBox CreateBoxAt(struct FVector Location, struct FVector Size); // Function FSD.BoxFunctionLibrary.CreateBoxAt
	struct FVector ClosestPointToBox(struct FVector Pos, struct FBox Box); // Function FSD.BoxFunctionLibrary.ClosestPointToBox
	float BoxSize(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxSize
	struct FVector BoxExtends(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxExtends
	struct FVector BoxCenter(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxCenter
};

// Class FSD.GenerationComponent
// Size: 0x3f0 (Inherited: 0x3f0)
struct UGenerationComponent : UPrimitiveComponent {
};

// Class FSD.BoxGenerationComponent
// Size: 0x410 (Inherited: 0x3f0)
struct UBoxGenerationComponent : UGenerationComponent {
	struct FVector Extends; // 0x3f0(0x0c)
	bool IsCarver; // 0x3fc(0x01)
	char UnknownData_3FD[0x3]; // 0x3fd(0x03)
	float NoiseRange; // 0x400(0x04)
	bool Visible; // 0x404(0x01)
	char UnknownData_405[0x3]; // 0x405(0x03)
	struct UFloodFillSettings* Noise; // 0x408(0x08)
};

// Class FSD.GenerationItem
// Size: 0x228 (Inherited: 0x220)
struct AGenerationItem : AActor {
	bool Visible; // 0x220(0x01)
	bool AddToLevel; // 0x221(0x01)
	char UnknownData_222[0x6]; // 0x222(0x06)
};

// Class FSD.BoxGenerationItem
// Size: 0x230 (Inherited: 0x228)
struct ABoxGenerationItem : AGenerationItem {
	struct UBoxGenerationComponent* BoxComponent; // 0x228(0x08)
};

// Class FSD.BTDecorator_AttackInRange
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_AttackInRange : UBTDecorator_BlackboardBase {
	struct FName AttackName; // 0x90(0x08)
};

// Class FSD.BTDecorator_CanSeeTarget
// Size: 0xa8 (Inherited: 0x68)
struct UBTDecorator_CanSeeTarget : UBTDecorator {
	bool UseAsync; // 0x68(0x01)
	char UnknownData_69[0x3]; // 0x69(0x03)
	float MaxRange; // 0x6c(0x04)
	struct FVector EyeLocationOffset; // 0x70(0x0c)
	char UnknownData_7C[0x4]; // 0x7c(0x04)
	struct FBlackboardKeySelector TargetKey; // 0x80(0x28)
};

// Class FSD.BTDecorator_CheckObstruction
// Size: 0xb0 (Inherited: 0x68)
struct UBTDecorator_CheckObstruction : UBTDecorator {
	float Range; // 0x68(0x04)
	bool UseOwnerCenterMass; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
	struct FVector EyeLocationOffset; // 0x70(0x0c)
	struct FName RangedSocket; // 0x7c(0x08)
	char UnknownData_84[0x4]; // 0x84(0x04)
	struct FBlackboardKeySelector TargetKey; // 0x88(0x28)
};

// Class FSD.BTDecorator_CheckPlayerCount
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_CheckPlayerCount : UBTDecorator {
	int32_t playerCount; // 0x68(0x04)
	bool AllowLessThanCount; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
};

// Class FSD.BTDecorator_ConditionalGuard
// Size: 0x90 (Inherited: 0x68)
struct UBTDecorator_ConditionalGuard : UBTDecorator {
	struct FBlackboardKeySelector GuardKey; // 0x68(0x28)
};

// Class FSD.BTDecorator_FormationGuard
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_FormationGuard : UBTDecorator {
};

// Class FSD.BTDecorator_InRange
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRange : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class FSD.BTDecorator_InRangeBB
// Size: 0xe8 (Inherited: 0x90)
struct UBTDecorator_InRangeBB : UBTDecorator_BlackboardBase {
	struct FBlackboardKeySelector MinRangeKey; // 0x90(0x28)
	struct FBlackboardKeySelector MaxRangeKey; // 0xb8(0x28)
	enum class FAIDistanceType GeometricDistanceType; // 0xe0(0x01)
	char UnknownData_E1[0x7]; // 0xe1(0x07)
};

// Class FSD.BTDecorator_InRangeEx
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRangeEx : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class FSD.BTDecorator_InRangeOfTarget
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_InRangeOfTarget : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
};

// Class FSD.BTDecorator_IsFacing
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_IsFacing : UBTDecorator_BlackboardBase {
	float MaxAngle; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// Class FSD.BTDecorator_LockRotation
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_LockRotation : UBTDecorator {
	char UnknownData_68[0x8]; // 0x68(0x08)
};

// Class FSD.BTDecorator_MessageAI
// Size: 0x78 (Inherited: 0x68)
struct UBTDecorator_MessageAI : UBTDecorator {
	struct FName ActivationMessage; // 0x68(0x08)
	struct FName DeactivationMessage; // 0x70(0x08)
};

// Class FSD.BTDecorator_ModifySpeed
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_ModifySpeed : UBTDecorator {
	float SpeedModifier; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_RandomChance
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomChance : UBTDecorator {
	float Chance; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_RandomCooldown
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
};

// Class FSD.BTDecorator_SetTagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_SetTagRandomCooldown : UBTDecorator {
	struct FGameplayTag CooldownTag; // 0x68(0x08)
	struct FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool TriggerOnActivation; // 0x79(0x01)
	char UnknownData_7A[0x6]; // 0x7a(0x06)
};

// Class FSD.BTDecorator_TagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_TagRandomCooldown : UBTDecorator {
	struct FGameplayTag CooldownTag; // 0x68(0x08)
	struct FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool bActivatesCooldown; // 0x79(0x01)
	char UnknownData_7A[0x6]; // 0x7a(0x06)
};

// Class FSD.BTDecorator_RandomLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomLoop : UBTDecorator {
	float Chance; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_VariableLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_VariableLoop : UBTDecorator {
	struct FIRandRange NumLoops; // 0x68(0x08)
};

// Class FSD.BTDecorator_SharedCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
	struct FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTDecorator_SharedAttackCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedAttackCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
	struct FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTServer_ChaseTarget
// Size: 0x100 (Inherited: 0x70)
struct UBTServer_ChaseTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	char UnknownData_99[0x3]; // 0x99(0x03)
	struct FGameplayTag SwitchTargetCooldownTag; // 0x9c(0x08)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
	struct FGameplayTagQuery TargetingQuery; // 0xa8(0x48)
	bool IsFlying; // 0xf0(0x01)
	bool CanShoot; // 0xf1(0x01)
	char UnknownData_F2[0x2]; // 0xf2(0x02)
	float TargetingRange; // 0xf4(0x04)
	float SwitchTargetTime; // 0xf8(0x04)
	float SwitchTargetDeviation; // 0xfc(0x04)
};

// Class FSD.BTService_FindPlayer
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_FindPlayer : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	char UnknownData_9D[0x3]; // 0x9d(0x03)
	float TargetingRange; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTService_FindAttackable
// Size: 0xf0 (Inherited: 0x70)
struct UBTService_FindAttackable : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	char UnknownData_9D[0x3]; // 0x9d(0x03)
	float TargetingRange; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
	struct FGameplayTagQuery TargetQuery; // 0xa8(0x48)
};

// Class FSD.BTService_SetStance
// Size: 0xa0 (Inherited: 0x70)
struct UBTService_SetStance : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	float Distance; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class FSD.BTService_CheckPathToTarget
// Size: 0xc0 (Inherited: 0x70)
struct UBTService_CheckPathToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector ResultKey; // 0x98(0x28)
};

// Class FSD.BTService_UpdateMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateMoveToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
	float VerticalOffset; // 0xc4(0x04)
};

// Class FSD.BTService_UpdateFlyingMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateFlyingMoveToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
	char UnknownData_C4[0x4]; // 0xc4(0x04)
};

// Class FSD.BTService_UpdateMoveInFormation
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_UpdateMoveInFormation : UBTService {
	float LookAheadTime; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
	struct FBlackboardKeySelector TargetLocationKey; // 0x78(0x28)
	float AttackerRadius; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTTask_Attack
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_Attack : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FName AttackName; // 0x98(0x08)

	void OnAttackCompleted(struct UBehaviorTreeComponent* btComponent); // Function FSD.BTTask_Attack.OnAttackCompleted
};

// Class FSD.BTTask_FakePhysicsMove
// Size: 0xc8 (Inherited: 0x98)
struct UBTTask_FakePhysicsMove : UBTTask_BlackboardBase {
	float MinTime; // 0x98(0x04)
	float EndMaxSpeed; // 0x9c(0x04)
	struct FVector InitialLocalVelocity; // 0xa0(0x0c)
	struct FVector InitialGlobalVelocity; // 0xac(0x0c)
	bool EndRequireSolidGround; // 0xb8(0x01)
	char UnknownData_B9[0x7]; // 0xb9(0x07)
	struct UFakeMoverSettings* MoveSettings; // 0xc0(0x08)
};

// Class FSD.BTTask_FindPointNearCeiling
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_FindPointNearCeiling : UBTTask_BlackboardBase {
	float CloseToCeilingBias; // 0x98(0x04)
	float LookForCeilingLength; // 0x9c(0x04)
	float SearchRadius; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTTask_MoveToTarget
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_MoveToTarget : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	bool EnterAttackStanceOnMoveFinished; // 0x9c(0x01)
	char UnknownData_9D[0x3]; // 0x9d(0x03)
};

// Class FSD.BTTask_MoveToSlot
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_MoveToSlot : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	float LookAheadTime; // 0x9c(0x04)
	float VerticalOffset; // 0xa0(0x04)
	float UpdateRate; // 0xa4(0x04)
};

// Class FSD.BTTask_SetAttacking
// Size: 0x98 (Inherited: 0x70)
struct UBTTask_SetAttacking : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
};

// Class FSD.BTTask_TriggerAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_TriggerAI : UBTTaskNode {
	struct FName TriggerName; // 0x70(0x08)
};

// Class FSD.BTTask_MessageAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_MessageAI : UBTTaskNode {
	struct FName MessageName; // 0x70(0x08)
};

// Class FSD.BTTask_SetCondition
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_SetCondition : UBTTaskNode {
	struct FBlackboardKeySelector ConditionalKey; // 0x70(0x28)
	bool Value; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class FSD.BuildRestriction
// Size: 0x38 (Inherited: 0x30)
struct UBuildRestriction : UDataAsset {
	int32_t BuildType; // 0x30(0x04)
	int32_t Platform; // 0x34(0x04)
};

// Class FSD.BurrowComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UBurrowComponent : UActorComponent {

	void Unburrow(struct UAnimMontage* customMontage); // Function FSD.BurrowComponent.Unburrow
	void Burrow(struct UAnimMontage* customMontage); // Function FSD.BurrowComponent.Burrow
};

// Class FSD.CalldownItem
// Size: 0x3c8 (Inherited: 0x368)
struct ACalldownItem : AAnimatedItem {
	struct UItemPlacerAggregator* ItemPlacerClass; // 0x368(0x08)
	struct ARessuplyPod* SupplyPodClass; // 0x370(0x08)
	struct UResourceData* ResouceRequired; // 0x378(0x08)
	struct FText OrderDescription; // 0x380(0x18)
	struct FText LogText; // 0x398(0x18)
	struct AActor* ResupplyBeacon; // 0x3b0(0x08)
	struct UItemPlacerAggregator* ItemPlacerInstance; // 0x3b8(0x08)
	float Cooldown; // 0x3c0(0x04)
	float CooldownRemaining; // 0x3c4(0x04)

	void Server_Call_Resupply(struct FVector Location); // Function FSD.CalldownItem.Server_Call_Resupply
};

// Class FSD.CampaignManager
// Size: 0xb8 (Inherited: 0x28)
struct UCampaignManager : UObject {
	struct FMulticastInlineDelegate OnCampaignCompleted; // 0x28(0x10)
	struct FMulticastInlineDelegate OnCampaignChanged; // 0x38(0x10)
	struct UCampaign* MainCampaign; // 0x48(0x08)
	struct TArray<struct UCampaign*> WeeklyCampaigns; // 0x50(0x10)
	struct TArray<struct UCampaign*> MatrixCoreHuntCampaigns; // 0x60(0x10)
	struct TArray<struct UCampaign*> SideCampaigns; // 0x70(0x10)
	struct TArray<struct UCampaign*> EventCampaigns; // 0x80(0x10)
	struct UCampaign* ActiveCampaign; // 0x90(0x08)
	int32_t NumFailedRequests; // 0x98(0x04)
	bool WeeklyBackendDataValid; // 0x9c(0x01)
	char UnknownData_9D[0x3]; // 0x9d(0x03)
	int32_t WeeklyBackendSeed; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
	struct FDateTime WeeklyBackendExpirationTime; // 0xa8(0x08)
	struct FDateTime LastRequestTime; // 0xb0(0x08)

	void StartNewCampaign(struct UCampaign* campaignClass, struct UFSDSaveGame* SaveGame); // Function FSD.CampaignManager.StartNewCampaign
	void SkipMainCampaign(struct AFSDPlayerController* Player); // Function FSD.CampaignManager.SkipMainCampaign
	void OnEventsRefreshed(); // Function FSD.CampaignManager.OnEventsRefreshed
	bool IsWeeklyCampaignCompleted(struct UObject* WorldContext, enum class ECampaignType campaigntype); // Function FSD.CampaignManager.IsWeeklyCampaignCompleted
	bool IsInCampaignMission(struct AFSDPlayerController* Player); // Function FSD.CampaignManager.IsInCampaignMission
	bool IsCampaignRestrictionsMet(struct UObject* WorldContextObject, struct UGeneratedMission* mission, struct UDifficultySetting* optionalDifficulty); // Function FSD.CampaignManager.IsCampaignRestrictionsMet
	bool IsCampaignMission(struct UObject* WorldContextObject, struct UGeneratedMission* mission); // Function FSD.CampaignManager.IsCampaignMission
	bool IsActiveCampaign(struct UCampaign* Campaign); // Function FSD.CampaignManager.IsActiveCampaign
	struct TArray<struct UCampaign*> GetUncompletedCampaigns(struct AFSDPlayerController* Player); // Function FSD.CampaignManager.GetUncompletedCampaigns
	struct UGeneratedMission* GetCampaingMissionFromSeeds(struct UObject* WorldContextObject, int32_t GlobalSeed, int32_t MissionSeed); // Function FSD.CampaignManager.GetCampaingMissionFromSeeds
	struct UGeneratedMission* GetCampaingMission(struct TArray<struct UGeneratedMission*> missions, int32_t MissionSeed); // Function FSD.CampaignManager.GetCampaingMission
	void CampaignCompletedDelegate__DelegateSignature(); // DelegateFunction FSD.CampaignManager.CampaignCompletedDelegate__DelegateSignature
	void AbortActiveCampaign(struct UFSDSaveGame* SaveGame); // Function FSD.CampaignManager.AbortActiveCampaign
};

// Class FSD.Campaign
// Size: 0x160 (Inherited: 0x28)
struct UCampaign : UObject {
	struct TArray<struct UCampaignMission*> missions; // 0x28(0x10)
	struct TArray<struct UCampaignRequirement*> Requirements; // 0x38(0x10)
	struct TArray<struct UCampaignRequirement*> VisibilityRequirements; // 0x48(0x10)
	struct UPlayerCharacterID* RequiredCharacterID; // 0x58(0x08)
	struct TArray<struct UDifficultySetting*> RestrictedToDifficulties; // 0x60(0x10)
	int32_t Progress; // 0x70(0x04)
	struct FGuid SavegameID; // 0x74(0x10)
	bool CanAbort; // 0x84(0x01)
	bool CanSkip; // 0x85(0x01)
	char UnknownData_86[0x2]; // 0x86(0x02)
	enum class ECampaignMutators Mutators; // 0x88(0x04)
	char UnknownData_8C[0x4]; // 0x8c(0x04)
	struct FText TitlePrefix; // 0x90(0x18)
	struct FText Title; // 0xa8(0x18)
	struct FText DescriptionHeader; // 0xc0(0x18)
	struct FText Description; // 0xd8(0x18)
	struct FText RewardText; // 0xf0(0x18)
	struct FText RewardFlavorText; // 0x108(0x18)
	struct UTexture2D* Icon; // 0x120(0x08)
	struct TSoftObjectPtr<struct UTexture2D> Picture; // 0x128(0x28)
	enum class ECampaignType campaigntype; // 0x150(0x01)
	char UnknownData_151[0x7]; // 0x151(0x07)
	struct UMissionStat* CampaignCompletedMissionStat; // 0x158(0x08)

	bool IsComplete(); // Function FSD.Campaign.IsComplete
	bool IsCampaignComplete(struct UObject* WorldContext, struct UCampaign* Campaign); // Function FSD.Campaign.IsCampaignComplete
	struct UCampaign* GetReference(struct UCampaign* Campaign); // Function FSD.Campaign.GetReference
	struct UCampaignMission* GetPreviousMission(); // Function FSD.Campaign.GetPreviousMission
	struct UTexture2D* GetPicture(); // Function FSD.Campaign.GetPicture
	struct FText GetCampaignTitle(struct UCampaign* Campaign); // Function FSD.Campaign.GetCampaignTitle
	struct UCampaignMission* GetActiveMission(); // Function FSD.Campaign.GetActiveMission
	bool CanStartCampaign(struct AFSDPlayerController* Player); // Function FSD.Campaign.CanStartCampaign
	bool CanSeeCampaign(struct APlayerController* PlayerController); // Function FSD.Campaign.CanSeeCampaign
	bool AreRestrictionsMet(struct AFSDPlayerController* Player, struct UDifficultySetting* optionalDifficulty); // Function FSD.Campaign.AreRestrictionsMet
};

// Class FSD.CampaignMission
// Size: 0x68 (Inherited: 0x30)
struct UCampaignMission : UDataAsset {
	struct UPlanetZone* PlanetZone; // 0x30(0x08)
	struct FRequiredMissionItem mission; // 0x38(0x18)
	struct TArray<struct UReward*> Rewards; // 0x50(0x10)
	struct UDialogDataAsset* MissionCompleteShout; // 0x60(0x08)

	struct UMissionTemplate* GetMissionTemplate(); // Function FSD.CampaignMission.GetMissionTemplate
};

// Class FSD.CampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UCampaignRequirement : UObject {

	bool IsRequirementMet(struct AFSDPlayerController* Player, struct UCampaign* Campaign); // Function FSD.CampaignRequirement.IsRequirementMet
};

// Class FSD.ValidWeeklySeedCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UValidWeeklySeedCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CaracterLevelCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct UCaracterLevelCampaignRequirement : UCampaignRequirement {
	struct UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// Class FSD.PlayerRankCampaignRequirement
// Size: 0x30 (Inherited: 0x28)
struct UPlayerRankCampaignRequirement : UCampaignRequirement {
	int32_t RankRequirement; // 0x28(0x04)
	char UnknownData_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.RetirementCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct URetirementCampaignRequirement : UCampaignRequirement {
	struct UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// Class FSD.WeeklyTimerCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UWeeklyTimerCampaignRequirement : UCampaignRequirement {

	struct FTimespan GetWeeklyTimeLeft(struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetWeeklyTimeLeft
	struct FTimespan GetTimeUntillNewCampaign(struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetTimeUntillNewCampaign
	bool GetHasCompleted(struct UCampaign* Campaign, struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetHasCompleted
};

// Class FSD.AnyRetiredCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UAnyRetiredCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CamapaignCompletedRequirement
// Size: 0x30 (Inherited: 0x28)
struct UCamapaignCompletedRequirement : UCampaignRequirement {
	struct UCampaign* Campaign; // 0x28(0x08)
};

// Class FSD.CapacityBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UCapacityBasedItemAggregator : UItemAggregator {
	struct FMulticastInlineDelegate OnCurrentAmountChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnMaxAmountChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	struct FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	struct FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool showClipCount; // 0x138(0x01)
	char UnknownData_139[0x7]; // 0x139(0x07)

	void ReloadStarted(); // Function FSD.CapacityBasedItemAggregator.ReloadStarted
	void ReloadComplete(); // Function FSD.CapacityBasedItemAggregator.ReloadComplete
	int32_t GetMaxAmount(); // Function FSD.CapacityBasedItemAggregator.GetMaxAmount
	int32_t GetCurrentAmount(); // Function FSD.CapacityBasedItemAggregator.GetCurrentAmount
};

// Class FSD.CapacityHoldingItemAggregator
// Size: 0x160 (Inherited: 0x140)
struct UCapacityHoldingItemAggregator : UCapacityBasedItemAggregator {
	char UnknownData_140[0x10]; // 0x140(0x10)
	int32_t MaxAmmo; // 0x150(0x04)
	int32_t AmmoCount; // 0x154(0x04)
	bool UseRejoin; // 0x158(0x01)
	char UnknownData_159[0x7]; // 0x159(0x07)

	void UseAmmo(int32_t count); // Function FSD.CapacityHoldingItemAggregator.UseAmmo
	void SetMaxAmmo(int32_t InMaxAmmo, bool InChangeCurrentAmount); // Function FSD.CapacityHoldingItemAggregator.SetMaxAmmo
	void Resupply(float percentage); // Function FSD.CapacityHoldingItemAggregator.Resupply
	void OnRep_MaxAmmo(); // Function FSD.CapacityHoldingItemAggregator.OnRep_MaxAmmo
	void OnRep_AmmoCount(); // Function FSD.CapacityHoldingItemAggregator.OnRep_AmmoCount
	void AddAmmo(int32_t amount); // Function FSD.CapacityHoldingItemAggregator.AddAmmo
};

// Class FSD.CappedResource
// Size: 0x78 (Inherited: 0x28)
struct UCappedResource : UObject {
	struct FMulticastInlineDelegate OnChanged; // 0x28(0x10)
	struct FMulticastInlineDelegate OnIncreased; // 0x38(0x10)
	struct FMulticastInlineDelegate OnFull; // 0x48(0x10)
	struct UResourceData* Data; // 0x58(0x08)
	float currentAmount; // 0x60(0x04)
	float MaxAmount; // 0x64(0x04)
	float TotalCollected; // 0x68(0x04)
	int32_t FullFlag; // 0x6c(0x04)
	char UnknownData_70[0x8]; // 0x70(0x08)

	float TransferAll(struct UCappedResource* Receiver); // Function FSD.CappedResource.TransferAll
	float Transfer(float amount, struct UCappedResource* Receiver); // Function FSD.CappedResource.Transfer
	void OnRep_FullFlag(int32_t OldValue); // Function FSD.CappedResource.OnRep_FullFlag
	void OnRep_CurrentAmount(float OldAmount); // Function FSD.CappedResource.OnRep_CurrentAmount
	bool IsObjectiveResource(struct UObject* WorldContext, bool IsCompleted); // Function FSD.CappedResource.IsObjectiveResource
	bool IsFull(); // Function FSD.CappedResource.IsFull
	bool IsEmpty(); // Function FSD.CappedResource.IsEmpty
	bool IsCraftingResource(); // Function FSD.CappedResource.IsCraftingResource
	struct FText GetTitle(); // Function FSD.CappedResource.GetTitle
	struct FColor GetColor(); // Function FSD.CappedResource.GetColor
	float GetCapacityPct(); // Function FSD.CappedResource.GetCapacityPct
	float Deduct(float amount); // Function FSD.CappedResource.Deduct
	float Add(float amount); // Function FSD.CappedResource.Add
};

// Class FSD.UsableComponentBase
// Size: 0xd8 (Inherited: 0xb0)
struct UUsableComponentBase : UActorComponent {
	float UseCooldown; // 0xb0(0x04)
	bool MustBeGroundedToUse; // 0xb4(0x01)
	bool CanUseStrict; // 0xb5(0x01)
	char UnknownData_B6[0x2]; // 0xb6(0x02)
	struct UUseAnimationSetting* AnimationSettings; // 0xb8(0x08)
	int32_t Priority; // 0xc0(0x04)
	bool UseableByOwnerOnly; // 0xc4(0x01)
	char UnknownData_C5[0x3]; // 0xc5(0x03)
	struct USceneComponent* RestrictToCollider; // 0xc8(0x08)
	enum class EUseRestriction UseRestrictionAllowance; // 0xd0(0x01)
	bool IsRayTraceTriggered; // 0xd1(0x01)
	bool ResetUsingOnCompletion; // 0xd2(0x01)
	char UnknownData_D3[0x5]; // 0xd3(0x05)

	void SetRayTraceTriggered(bool rayTraceTriggered); // Function FSD.UsableComponentBase.SetRayTraceTriggered
	struct FText GetUseText(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetUseText
	float GetUseProgressInPercent(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetUseProgressInPercent
	struct UTexture2D* GetUsableIcon(); // Function FSD.UsableComponentBase.GetUsableIcon
	bool GetShowUsingUI(); // Function FSD.UsableComponentBase.GetShowUsingUI
	bool GetIsRayTraceTriggerd(); // Function FSD.UsableComponentBase.GetIsRayTraceTriggerd
	bool GetHideProgressBar(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetHideProgressBar
	bool GetHideActionText(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetHideActionText
	void EndUse(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.EndUse
	void BeginUse(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.BeginUse
};

// Class FSD.UsableComponent
// Size: 0x100 (Inherited: 0xd8)
struct UUsableComponent : UUsableComponentBase {
	struct UDialogDataAsset* ShoutBegin; // 0xd8(0x08)
	struct FText UseText; // 0xe0(0x18)
	bool ResetOnFail; // 0xf8(0x01)
	bool SwitchToUsingState; // 0xf9(0x01)
	char UnknownData_FA[0x6]; // 0xfa(0x06)

	void SetUseText(struct FText NewText); // Function FSD.UsableComponent.SetUseText
	bool HasDuration(); // Function FSD.UsableComponent.HasDuration
};

// Class FSD.InstantUsable
// Size: 0x138 (Inherited: 0x100)
struct UInstantUsable : UUsableComponent {
	struct FMulticastInlineDelegate OnUsedBy; // 0x100(0x10)
	struct FMulticastInlineDelegate OnUsableChanged; // 0x110(0x10)
	bool bShowUsingUI; // 0x120(0x01)
	char UnknownData_121[0x7]; // 0x121(0x07)
	struct USoundCue* AudioCompletedUse; // 0x128(0x08)
	bool Usable; // 0x130(0x01)
	bool TurnOffAfterUse; // 0x131(0x01)
	char UnknownData_132[0x6]; // 0x132(0x06)

	void SetCanUse(bool canUse); // Function FSD.InstantUsable.SetCanUse
	void OnRep_Usable(); // Function FSD.InstantUsable.OnRep_Usable
};

// Class FSD.CarriableInstantUsable
// Size: 0x138 (Inherited: 0x138)
struct UCarriableInstantUsable : UInstantUsable {
};

// Class FSD.CarriableComponent
// Size: 0x118 (Inherited: 0xb0)
struct UCarriableComponent : UActorComponent {
	char UnknownData_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnPickedUp; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnDropped; // 0xc8(0x10)
	struct APlayerCharacter* CarriedBy; // 0xd8(0x08)
	enum class EUseRestriction UseRestriction; // 0xe0(0x01)
	char UnknownData_E1[0x3]; // 0xe1(0x03)
	struct FVector Offset; // 0xe4(0x0c)
	char UnknownData_F0[0x28]; // 0xf0(0x28)

	bool PickupItem(struct APlayerCharacter* byCharacter); // Function FSD.CarriableComponent.PickupItem
	void OnRep_CarriedBy(); // Function FSD.CarriableComponent.OnRep_CarriedBy
	void DropItem(); // Function FSD.CarriableComponent.DropItem
	void AttachChanged(bool Attached, struct FVector PrevScale); // Function FSD.CarriableComponent.AttachChanged
};

// Class FSD.ResourceData
// Size: 0xf0 (Inherited: 0x30)
struct UResourceData : UDataAsset {
	char UnknownData_30[0x8]; // 0x30(0x08)
	struct FText Title; // 0x38(0x18)
	struct FText TitlePlural; // 0x50(0x18)
	struct FText Description; // 0x68(0x18)
	struct FColor Color; // 0x80(0x04)
	char UnknownData_84[0x4]; // 0x84(0x04)
	struct UTexture2D* Icon; // 0x88(0x08)
	int32_t BuyingPrice; // 0x90(0x04)
	int32_t SellingPrice; // 0x94(0x04)
	struct UMissionStat* MinedMissionStat; // 0x98(0x08)
	bool IsCraftingMaterial; // 0xa0(0x01)
	bool AffectedByMutators; // 0xa1(0x01)
	bool ScaleToMissionLength; // 0xa2(0x01)
	bool ScaleToHazardLevel; // 0xa3(0x01)
	bool ShowSeparatelyInEndScreen; // 0xa4(0x01)
	char UnknownData_A5[0x3]; // 0xa5(0x03)
	SoftClassProperty Spawnable; // 0xa8(0x28)
	bool IsWholeNumberResource; // 0xd0(0x01)
	char UnknownData_D1[0x3]; // 0xd1(0x03)
	int32_t CreditValue; // 0xd4(0x04)
	int32_t XPValue; // 0xd8(0x04)
	struct FGuid SavegameID; // 0xdc(0x10)
	char UnknownData_EC[0x4]; // 0xec(0x04)

	float GetOwnedAmount(struct UObject* WorldContextObject); // Function FSD.ResourceData.GetOwnedAmount
};

// Class FSD.CarvedResourceData
// Size: 0x120 (Inherited: 0xf0)
struct UCarvedResourceData : UResourceData {
	struct TSoftObjectPtr<struct UCarvedResourceCreator> CarvedResourceCreator; // 0xf0(0x28)
	float UnitsPerCarver; // 0x118(0x04)
	char UnknownData_11C[0x4]; // 0x11c(0x04)

	struct UCarvedResourceCreator* LoadResourceCreator(); // Function FSD.CarvedResourceData.LoadResourceCreator
};

// Class FSD.CaveEntranceComponent
// Size: 0x400 (Inherited: 0x3f0)
struct UCaveEntranceComponent : UPrimitiveComponent {
	enum class ECaveEntranceType Direction; // 0x3f0(0x01)
	char UnknownData_3F1[0xf]; // 0x3f1(0x0f)
};

// Class FSD.CaveEntrance
// Size: 0x238 (Inherited: 0x228)
struct ACaveEntrance : AGenerationItem {
	struct UCaveEntranceComponent* CaveEntranceComponent; // 0x228(0x08)
	enum class ECaveEntranceType EntranceType; // 0x230(0x01)
	bool HasBeenConverted; // 0x231(0x01)
	char UnknownData_232[0x6]; // 0x232(0x06)
};

// Class FSD.SpawnResourceGenerationItem
// Size: 0x240 (Inherited: 0x228)
struct ASpawnResourceGenerationItem : AGenerationItem {
	struct UResourceData* Resource; // 0x228(0x08)
	float BaseAmount; // 0x230(0x04)
	char UnknownData_234[0x4]; // 0x234(0x04)
	struct USphereComponent* Sphere; // 0x238(0x08)
};

// Class FSD.SpawnActorGenerationItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnActorGenerationItem : AGenerationItem {
	struct AActor* ActorToSpawn; // 0x228(0x08)
	struct UBoxComponent* Box; // 0x230(0x08)
};

// Class FSD.SpawnTriggerItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnTriggerItem : AGenerationItem {
	struct AActor* Trigger; // 0x228(0x08)
	struct FName Message; // 0x230(0x08)
};

// Class FSD.SubRoomItem
// Size: 0x238 (Inherited: 0x228)
struct ASubRoomItem : AGenerationItem {
	struct URoomGenerator* RoomGenerator; // 0x228(0x08)
	int32_t Layer; // 0x230(0x04)
	char UnknownData_234[0x4]; // 0x234(0x04)
};

// Class FSD.RandomSubRoomItem
// Size: 0x280 (Inherited: 0x228)
struct ARandomSubRoomItem : AGenerationItem {
	struct URoomGeneratorGroup* RoomGroup; // 0x228(0x08)
	struct FGameplayTagQuery tagQuery; // 0x230(0x48)
	int32_t Layer; // 0x278(0x04)
	char UnknownData_27C[0x4]; // 0x27c(0x04)
};

// Class FSD.DropPodCalldownLocationItem
// Size: 0x230 (Inherited: 0x228)
struct ADropPodCalldownLocationItem : AGenerationItem {
	struct AActor* CalldownClass; // 0x228(0x08)
};

// Class FSD.ProceduralSetup
// Size: 0x528 (Inherited: 0x220)
struct AProceduralSetup : AActor {
	bool ShowRoomEntrances; // 0x220(0x01)
	bool ShowPathObstacles; // 0x221(0x01)
	bool ShowItemNoisePattern; // 0x222(0x01)
	char UnknownData_223[0x1]; // 0x223(0x01)
	int32_t Seed; // 0x224(0x04)
	bool UseRandomSeed; // 0x228(0x01)
	char UnknownData_229[0x7]; // 0x229(0x07)
	struct FRandomStream RandomStream; // 0x230(0x08)
	struct FRandomStream RandomStreamServer; // 0x238(0x08)
	struct FRandomStream RandomStreamAsync; // 0x240(0x08)
	struct FRandomStream RandomStreamAsyncServer; // 0x248(0x08)
	struct FMulticastInlineDelegate OnEncounterSpawnedEvent; // 0x250(0x10)
	char UnknownData_260[0x68]; // 0x260(0x68)
	struct USpecialEvent* ForcedSpecialEvent; // 0x2c8(0x08)
	struct USpecialEvent* ForcedTreasure; // 0x2d0(0x08)
	char UnknownData_2D8[0x28]; // 0x2d8(0x28)
	bool UseMusicManager; // 0x300(0x01)
	char UnknownData_301[0x7]; // 0x301(0x07)
	struct ADeepCSGWorld* CSGWorld; // 0x308(0x08)
	struct UFloodFillSettings* PathfinderNoise; // 0x310(0x08)
	struct TArray<struct FVeinResource> VeinResources; // 0x318(0x10)
	struct TArray<struct FCarvedResource> CarvedResources; // 0x328(0x10)
	struct UMissionDNA* MissionDNA; // 0x338(0x08)
	struct TArray<struct FGemResourceAmount> GemResourcesToGenerate; // 0x340(0x10)
	char UnknownData_350[0x8]; // 0x350(0x08)
	struct TArray<struct FCollectableSpawnableItem> CollectablesToGenerate; // 0x358(0x10)
	enum class ESpawnSettings SpawnSettings; // 0x368(0x01)
	bool CanSpawnSpecialEvents; // 0x369(0x01)
	bool ShouldCarveTunnels; // 0x36a(0x01)
	bool CreateDirt; // 0x36b(0x01)
	char UnknownData_36C[0x4]; // 0x36c(0x04)
	struct UCaveInfluencer* DirtInfluencer; // 0x370(0x08)
	float DirtInfluencerRange; // 0x378(0x04)
	char UnknownData_37C[0xc]; // 0x37c(0x0c)
	struct UTunnelParameters* TunnelParameters; // 0x388(0x08)
	float PathZPenalty; // 0x390(0x04)
	float PathDirectionPenalty; // 0x394(0x04)
	float PathEntranceAnglePenalty; // 0x398(0x04)
	char UnknownData_39C[0xc]; // 0x39c(0x0c)
	struct TArray<struct FRoomNode> Rooms; // 0x3a8(0x10)
	struct TArray<struct FRoomNode> RoomsInitialState; // 0x3b8(0x10)
	struct TArray<struct FTunnelNode> Tunnels; // 0x3c8(0x10)
	struct FGeneratedInfluenceSets GeneratedInfluenceSets; // 0x3d8(0x18)
	char UnknownData_3F0[0x8]; // 0x3f0(0x08)
	struct FGeneratedInstantCarvers GeneratedInstantCarvers; // 0x3f8(0x10)
	struct FGeneratedDebris GeneratedDebris; // 0x408(0x58)
	struct UBiome* Biome; // 0x460(0x08)
	float missionLength; // 0x468(0x04)
	char UnknownData_46C[0x4]; // 0x46c(0x04)
	struct URoomDecorationObject* MiningpodCalldownLocationDecoration; // 0x470(0x08)
	struct TArray<struct FPathObstacle> PathObstacles; // 0x478(0x10)
	struct FInfluenceMap InfluenceMap; // 0x488(0x50)
	struct TArray<struct UResourceData*> SpawnedResources; // 0x4d8(0x10)
	float CaveDepth; // 0x4e8(0x04)
	char UnknownData_4EC[0x4]; // 0x4ec(0x04)
	struct AActor* PostProcessActor; // 0x4f0(0x08)
	struct USpecialEvent* SpecialEvent; // 0x4f8(0x08)
	bool IsInitialized; // 0x500(0x01)
	char UnknownData_501[0x3]; // 0x501(0x03)
	int32_t CurrentRoomPass; // 0x504(0x04)
	bool Pass1Completed; // 0x508(0x01)
	bool UsePerLevelCritterSpawning; // 0x509(0x01)
	char UnknownData_50A[0x1e]; // 0x50a(0x1e)

	void StartGenerationOnClient(struct AFSDPlayerController* client); // Function FSD.ProceduralSetup.StartGenerationOnClient
	void SpawnSpecialEvents(); // Function FSD.ProceduralSetup.SpawnSpecialEvents
	void SpawnObjectiveEncounter(); // Function FSD.ProceduralSetup.SpawnObjectiveEncounter
	void SpawnObjectiveCriticalItems(); // Function FSD.ProceduralSetup.SpawnObjectiveCriticalItems
	void SpawnItems_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.SpawnItems_Async
	void SpawnItems(); // Function FSD.ProceduralSetup.SpawnItems
	void SpawnEncounters(); // Function FSD.ProceduralSetup.SpawnEncounters
	void SpawnDebrisItems_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo, enum class EDebrisItemPass pass, int32_t Depth); // Function FSD.ProceduralSetup.SpawnDebrisItems_Async
	void SpawnDebrisItems(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.SpawnDebrisItems
	void SetSeed(int32_t Seed); // Function FSD.ProceduralSetup.SetSeed
	void SetObjectivesCompleted(); // Function FSD.ProceduralSetup.SetObjectivesCompleted
	void ResetData(); // Function FSD.ProceduralSetup.ResetData
	void RemoveBLockedEntrances(); // Function FSD.ProceduralSetup.RemoveBLockedEntrances
	void OnPLSDataRecieved(); // Function FSD.ProceduralSetup.OnPLSDataRecieved
	void OnObjectivesCompleted(); // Function FSD.ProceduralSetup.OnObjectivesCompleted
	void OnCarverDataRecieved(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.OnCarverDataRecieved
	bool IsGeneratedDataReady(); // Function FSD.ProceduralSetup.IsGeneratedDataReady
	bool IsCarverDataReady(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.IsCarverDataReady
	void InitializeObjectives(); // Function FSD.ProceduralSetup.InitializeObjectives
	struct UMissionDNA* GetMissionDNA(); // Function FSD.ProceduralSetup.GetMissionDNA
	struct ADeepCSGWorld* GetCSGWorld(); // Function FSD.ProceduralSetup.GetCSGWorld
	void GenerateRoomsFromGraph_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo, int32_t CarvePass); // Function FSD.ProceduralSetup.GenerateRoomsFromGraph_Async
	void GenerateRoomsFromGraph(int32_t CarvePass); // Function FSD.ProceduralSetup.GenerateRoomsFromGraph
	void GenerateRoomGenerator(); // Function FSD.ProceduralSetup.GenerateRoomGenerator
	void GenerateResourceVeins_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GenerateResourceVeins_Async
	void GenerateResourceVeins(); // Function FSD.ProceduralSetup.GenerateResourceVeins
	void GeneratePostCarveRooms_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GeneratePostCarveRooms_Async
	void GeneratePostCarveRooms(); // Function FSD.ProceduralSetup.GeneratePostCarveRooms
	void GenerateLandscapeFromData(int32_t Seed, struct TArray<struct FRoomNode> Rooms, struct TArray<struct FPathObstacle> obstacles); // Function FSD.ProceduralSetup.GenerateLandscapeFromData
	void GenerateLandscape(); // Function FSD.ProceduralSetup.GenerateLandscape
	void GenerateDebrisVeins_Async(struct AProceduralSetup* setup, enum class EDebrisCarvedType carverType, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GenerateDebrisVeins_Async
	void GenerateDebrisVeins(enum class EDebrisCarvedType carverType); // Function FSD.ProceduralSetup.GenerateDebrisVeins
	struct FVector FindLocationInDirection(struct FVector Origin, struct FVector Direction, float horizontalDeviation, float verticalDeviation, struct FRandRange Distance, float additionalDistance); // Function FSD.ProceduralSetup.FindLocationInDirection
	void FindEntrancesForAllConnections(); // Function FSD.ProceduralSetup.FindEntrancesForAllConnections
	void FillTunnels_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.FillTunnels_Async
	void FillTunnels(); // Function FSD.ProceduralSetup.FillTunnels
	void EndRoom(int32_t ID); // Function FSD.ProceduralSetup.EndRoom
	void DoneCarving(); // Function FSD.ProceduralSetup.DoneCarving
	bool DoAsyncThreadGeneration(); // Function FSD.ProceduralSetup.DoAsyncThreadGeneration
	void CreateTunnelPaths(); // Function FSD.ProceduralSetup.CreateTunnelPaths
	int32_t CreateItemDepths(); // Function FSD.ProceduralSetup.CreateItemDepths
	void CreateGeneratedInfluenceSet(); // Function FSD.ProceduralSetup.CreateGeneratedInfluenceSet
	void CreateAdditionalRooms(); // Function FSD.ProceduralSetup.CreateAdditionalRooms
	int32_t ConnectRooms(struct FRoomNode From, struct FRoomNode to, bool hasDirt, struct UTunnelParameters* tunnelParameterOverride); // Function FSD.ProceduralSetup.ConnectRooms
	int32_t ConnectRoomIds(int32_t fromID, int32_t toID, bool hasDirt, struct UTunnelParameters* tunnelParameterOverride); // Function FSD.ProceduralSetup.ConnectRoomIds
	void CommitCarving(bool finalCommit, bool generateMesh); // Function FSD.ProceduralSetup.CommitCarving
	void CarveWithGeneratedInstantCarvers(); // Function FSD.ProceduralSetup.CarveWithGeneratedInstantCarvers
	void CarveTunnels(); // Function FSD.ProceduralSetup.CarveTunnels
	int32_t BeginRoom(struct FVector Location, float Rotation, bool CanHaveEnemies, struct URoomGenerator* baseGenerator, struct FVector outCenter, struct FRoomNode outRoom, float resourceMultiplayer); // Function FSD.ProceduralSetup.BeginRoom
	void BeginLiveGeneration(); // Function FSD.ProceduralSetup.BeginLiveGeneration
	void BeginGenerating(); // Function FSD.ProceduralSetup.BeginGenerating
	void AddToRoom(int32_t ID, struct FVector Location, float Rotation, struct URoomGenerator* additionalRoomGenerator); // Function FSD.ProceduralSetup.AddToRoom
	void AddRoomToInitialState(struct FRoomNode RoomNode); // Function FSD.ProceduralSetup.AddRoomToInitialState
	int32_t AddRoom(struct FVector Location, bool CanHaveEnemies, struct URoomGeneratorBase* RoomGenerator, bool canBeRotated, struct FVector outCenter, struct FRoomNode outRoom, float ResourceMultiplier); // Function FSD.ProceduralSetup.AddRoom
	void AddInfluenceToTunnelEntrances(struct UCaveInfluencer* Influencer, float Range); // Function FSD.ProceduralSetup.AddInfluenceToTunnelEntrances
	void AddImportantLocation(struct FVector Location, float Radius); // Function FSD.ProceduralSetup.AddImportantLocation
	void AddEnemyDebris(); // Function FSD.ProceduralSetup.AddEnemyDebris
	void AddDebrisVariantsToRooms(); // Function FSD.ProceduralSetup.AddDebrisVariantsToRooms
	int32_t AddDebrisCollider(struct FDebrisCapsule Capsule); // Function FSD.ProceduralSetup.AddDebrisCollider
	void AddCaveInfluence(struct UCaveInfluencer* Influencer, struct FVector Location, float Range); // Function FSD.ProceduralSetup.AddCaveInfluence
	int32_t AddAirParticlesCollider(struct FDebrisCapsule Capsule); // Function FSD.ProceduralSetup.AddAirParticlesCollider
};

// Class FSD.CaveBurner
// Size: 0x560 (Inherited: 0x528)
struct ACaveBurner : AProceduralSetup {
	float RoomRadius; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct FGameplayTagContainer RoomTags; // 0x530(0x20)
	bool CanOnlyBeUsedOnce; // 0x550(0x01)
	char UnknownData_551[0x7]; // 0x551(0x07)
	struct URoomGenerator* RoomGenerator; // 0x558(0x08)
};

// Class FSD.RoomBurner
// Size: 0x2e0 (Inherited: 0x220)
struct ARoomBurner : AActor {
	bool LiveUpdateEditor; // 0x220(0x01)
	enum class ERoomMirror MirrorTest; // 0x221(0x01)
	char UnknownData_222[0x6]; // 0x222(0x06)
	struct URoomGenerator* RoomGenerator; // 0x228(0x08)
	float RoomRadius; // 0x230(0x04)
	enum class ERoomMirroringSupport MirrorSupport; // 0x234(0x01)
	bool ShowRoomCollider; // 0x235(0x01)
	char UnknownData_236[0x2]; // 0x236(0x02)
	struct FGameplayTagContainer RoomTags; // 0x238(0x20)
	int32_t Seed; // 0x258(0x04)
	char UnknownData_25C[0x4]; // 0x25c(0x04)
	struct UBiome* Biome; // 0x260(0x08)
	struct UDifficultySetting* Difficulty; // 0x268(0x08)
	int32_t ForcePlayerCount; // 0x270(0x04)
	bool GenerateDebris; // 0x274(0x01)
	bool GenerateItems; // 0x275(0x01)
	bool GenerateResources; // 0x276(0x01)
	bool SpawnEncounters; // 0x277(0x01)
	struct UEnemyDescriptor* TestEnemy; // 0x278(0x08)
	int32_t TestEnemyCount; // 0x280(0x04)
	char UnknownData_284[0x4]; // 0x284(0x04)
	struct UMissionMutator* TestMutator; // 0x288(0x08)
	struct TArray<struct UMissionWarning*> TestWarnings; // 0x290(0x10)
	struct USpecialEvent* TestSpecialEvent; // 0x2a0(0x08)
	struct USpecialEvent* TestTreasure; // 0x2a8(0x08)
	struct UMissionTemplate* MissionTemplate; // 0x2b0(0x08)
	struct UMissionTemplate* CustomMissionTemplate; // 0x2b8(0x08)
	struct ADeepCSGWorld* CSGWorld; // 0x2c0(0x08)
	struct AProceduralSetup* PLSLiveEditor; // 0x2c8(0x08)
	char UnknownData_2D0[0x8]; // 0x2d0(0x08)
	struct URoomGenerator* LiveEditRoomGenerator; // 0x2d8(0x08)

	void SpawnEncounter(struct AProceduralSetup* setup); // Function FSD.RoomBurner.SpawnEncounter
};

// Class FSD.RoomPieceBurner
// Size: 0x2f8 (Inherited: 0x2e0)
struct ARoomPieceBurner : ARoomBurner {
	struct URoomPiece* RoomPiece; // 0x2e0(0x08)
	struct TArray<enum class ERoomPieceSide> ConnectedSides; // 0x2e8(0x10)
};

// Class FSD.InfluenceTester
// Size: 0x230 (Inherited: 0x220)
struct AInfluenceTester : AActor {
	struct UCaveInfluencer* Influencer; // 0x220(0x08)
	struct USphereComponent* Sphere; // 0x228(0x08)
};

// Class FSD.EnemyPawn
// Size: 0x338 (Inherited: 0x2e8)
struct AEnemyPawn : AFSDPawn {
	char UnknownData_2E8[0x8]; // 0x2e8(0x08)
	struct UEnemyHealthComponent* Health; // 0x2f0(0x08)
	struct UPawnStatsComponent* Stats; // 0x2f8(0x08)
	struct UEnemyPawnAfflictionComponent* affliction; // 0x300(0x08)
	struct UEnemyComponent* enemy; // 0x308(0x08)
	struct FName CenterMassSocketName; // 0x310(0x08)
	struct FQueuedMontage QueuedMontage; // 0x318(0x10)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x328(0x10)

	struct UMeshComponent* Receive_GetMeshComponent(); // Function FSD.EnemyPawn.Receive_GetMeshComponent
	void OnRep_QueuedMontage(); // Function FSD.EnemyPawn.OnRep_QueuedMontage
	struct USkeletalMeshComponent* GetMesh(); // Function FSD.EnemyPawn.GetMesh
};

// Class FSD.CaveLeech
// Size: 0x3f0 (Inherited: 0x338)
struct ACaveLeech : AEnemyPawn {
	char UnknownData_338[0x8]; // 0x338(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x340(0x08)
	struct UGrabberComponent* GrabberComponent; // 0x348(0x08)
	float BiteDamage; // 0x350(0x04)
	float BitesPerSecond; // 0x354(0x04)
	float MaxDistanceXY; // 0x358(0x04)
	float GrapDistance; // 0x35c(0x04)
	float GrapDelay; // 0x360(0x04)
	float TentacleSpeed; // 0x364(0x04)
	float TentacleRetractSpeed; // 0x368(0x04)
	float RetractDuration; // 0x36c(0x04)
	float TentaclePullSpeed; // 0x370(0x04)
	float TentacleDropPlayerSpeed; // 0x374(0x04)
	float TentacleDropGroundDistance; // 0x378(0x04)
	float MaxDropPlayerDuration; // 0x37c(0x04)
	float HeadInterpSpeed; // 0x380(0x04)
	float TentacleAttachOffset; // 0x384(0x04)
	float BiteDistance; // 0x388(0x04)
	float RevivedGracePeriod; // 0x38c(0x04)
	struct UPawnAffliction* CaveLeechSenseAffliction; // 0x390(0x08)
	char UnknownData_398[0x8]; // 0x398(0x08)
	float StateTime; // 0x3a0(0x04)
	enum class ECaveLeechState State; // 0x3a4(0x01)
	char UnknownData_3A5[0x3]; // 0x3a5(0x03)
	struct FVector_NetQuantize TentacleLocation; // 0x3a8(0x0c)
	struct FVector_NetQuantize TentacleVelocity; // 0x3b4(0x0c)
	struct FWeakObjectPtr<struct AActor> Target; // 0x3c0(0x08)
	struct UHealthComponent* HealthTarget; // 0x3c8(0x08)
	struct USceneComponent* TentacleHead; // 0x3d0(0x08)
	char UnknownData_3D8[0x18]; // 0x3d8(0x18)

	void OnRep_State(); // Function FSD.CaveLeech.OnRep_State
	struct FVector GetTentacleTargetLocation(); // Function FSD.CaveLeech.GetTentacleTargetLocation
	struct FVector GetMouthLocation(); // Function FSD.CaveLeech.GetMouthLocation
	struct AActor* GetCurrentTarget(); // Function FSD.CaveLeech.GetCurrentTarget
	void Died(struct UHealthComponentBase* HealthComponent); // Function FSD.CaveLeech.Died
	void Damaged(float amount); // Function FSD.CaveLeech.Damaged
	void BP_OnTentacleLocationChanged(struct FVector Location); // Function FSD.CaveLeech.BP_OnTentacleLocationChanged
	void BP_OnStateChanged(enum class ECaveLeechState NewState); // Function FSD.CaveLeech.BP_OnStateChanged
	void BP_OnBite(struct UHealthComponent* TargetHealth); // Function FSD.CaveLeech.BP_OnBite
};

// Class FSD.CaveLeechAnimInstance
// Size: 0x2b0 (Inherited: 0x270)
struct UCaveLeechAnimInstance : UAnimInstance {
	float HeadOffset; // 0x268(0x04)
	struct ACaveLeech* CaveLeech; // 0x270(0x08)
	struct USceneComponent* CaveLeechHead; // 0x278(0x08)
	struct FRotator BaseRotation; // 0x280(0x0c)
	struct FVector HeadLocation; // 0x28c(0x0c)
	struct FRotator HeadRotation; // 0x298(0x0c)
	bool bIdle; // 0x2a4(0x01)
	bool bTracking; // 0x2a5(0x01)
	bool bPulling; // 0x2a6(0x01)
	bool bRetracting; // 0x2a7(0x01)
	bool bDying; // 0x2a8(0x01)
	bool bDead; // 0x2a9(0x01)
	bool bFrozen; // 0x2aa(0x01)
	bool bBiting; // 0x2ab(0x01)
};

// Class FSD.CaveObject
// Size: 0x228 (Inherited: 0x220)
struct ACaveObject : AActor {
	bool CanCharacterStandOn; // 0x220(0x01)
	char UnknownData_221[0x7]; // 0x221(0x07)

	void TriggerNetworkUpdate(); // Function FSD.CaveObject.TriggerNetworkUpdate
	void ResumeNetworkUpdates(); // Function FSD.CaveObject.ResumeNetworkUpdates
	void Recieve_OnGameStarted(); // Function FSD.CaveObject.Recieve_OnGameStarted
	void PauseNetworkUpdates(); // Function FSD.CaveObject.PauseNetworkUpdates
};

// Class FSD.CaveScriptComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UCaveScriptComponent : UActorComponent {
};

// Class FSD.CaveVine
// Size: 0x288 (Inherited: 0x220)
struct ACaveVine : AActor {
	char GroundCollisionChannel; // 0x220(0x01)
	char UnknownData_221[0x3]; // 0x221(0x03)
	float IdleSwingSpeed; // 0x224(0x04)
	float ChaseSpeed; // 0x228(0x04)
	float MaxReach; // 0x22c(0x04)
	float GroundOffset; // 0x230(0x04)
	float NoiseRadius; // 0x234(0x04)
	float NoiseSpeed; // 0x238(0x04)
	char UnknownData_23C[0x4]; // 0x23c(0x04)
	struct USplineMeshComponent* SplineMeshComponent; // 0x240(0x08)
	struct USceneComponent* VineHead; // 0x248(0x08)
	struct FVector VineVelocity; // 0x250(0x0c)
	struct FVector VineLocation; // 0x25c(0x0c)
	struct FVector VineStartLocation; // 0x268(0x0c)
	struct FWeakObjectPtr<struct UHealthComponent> Target; // 0x274(0x08)
	char UnknownData_27C[0xc]; // 0x27c(0x0c)

	void BP_OnTargetChanged(struct UHealthComponent* NewTarget); // Function FSD.CaveVine.BP_OnTargetChanged
	void BP_OnInitialized(); // Function FSD.CaveVine.BP_OnInitialized
};

// Class FSD.CaveWorm
// Size: 0x398 (Inherited: 0x378)
struct ACaveWorm : ADeepPathfinderCharacter {
	char UnknownData_378[0x10]; // 0x378(0x10)
	struct USimpleHealthComponent* Health; // 0x388(0x08)
	float SearchChunksRadius; // 0x390(0x04)
	float SearchChunksInterval; // 0x394(0x04)

	struct AResourceChunk* SpawnResource(struct UObject* WorldContext, struct UResourceData* Data, float Size, struct FTransform Transform, struct FVector Impulse, struct FVector DropOffset); // Function FSD.CaveWorm.SpawnResource
	void Search(); // Function FSD.CaveWorm.Search
	void IncrementKillCount(struct UHealthComponentBase* HealthComponent); // Function FSD.CaveWorm.IncrementKillCount
	void DropResource(struct UResourceData* Data, float Size, struct FVector Impulse, struct FVector DropOffset); // Function FSD.CaveWorm.DropResource
};

// Class FSD.Maggot
// Size: 0x380 (Inherited: 0x378)
struct AMaggot : ADeepPathfinderCharacter {
	struct USimpleHealthComponent* HealthComponent; // 0x378(0x08)
};

// Class FSD.CellIdFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCellIdFunctionLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.Test
// Size: 0x270 (Inherited: 0x270)
struct UTest : UAnimInstance {
};

// Class FSD.CharacterCameraController
// Size: 0xd0 (Inherited: 0xb0)
struct UCharacterCameraController : UActorComponent {
	float StartFOV; // 0xb0(0x04)
	float targetFov; // 0xb4(0x04)
	float TargetFOVSpeed; // 0xb8(0x04)
	char UnknownData_BC[0x4]; // 0xbc(0x04)
	struct APlayerCharacter* Character; // 0xc0(0x08)
	struct UCameraComponent* Camera; // 0xc8(0x08)

	void ResetFOV(float FadeSpeed); // Function FSD.CharacterCameraController.ResetFOV
	void FOVChanged(float NewFOV); // Function FSD.CharacterCameraController.FOVChanged
	void FadeToFOVRelative(float targetFov, float FadeSpeed); // Function FSD.CharacterCameraController.FadeToFOVRelative
	void FadeToFOV(float targetFov, float FadeSpeed); // Function FSD.CharacterCameraController.FadeToFOV
};

// Class FSD.CharacterIntoxicationComponent
// Size: 0x100 (Inherited: 0xb0)
struct UCharacterIntoxicationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnIntoxicationChanged; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnPassOutDrunk; // 0xc0(0x10)
	struct APlayerCharacter* Character; // 0xd0(0x08)
	enum class EIntoxicationState CurrentState; // 0xd8(0x01)
	char UnknownData_D9[0x3]; // 0xd9(0x03)
	struct FLerpingPercent IntoxicationPercent; // 0xdc(0x08)
	float IntoxicationLerpSpeed; // 0xe4(0x04)
	float TimeDrunk; // 0xe8(0x04)
	struct FCountDownFloat SoberingUpCoolDown; // 0xec(0x0c)
	char SoberingPercent; // 0xf8(0x01)
	char UnknownData_F9[0x7]; // 0xf9(0x07)

	void ReceiveStateChange(enum class EIntoxicationState NewState); // Function FSD.CharacterIntoxicationComponent.ReceiveStateChange
	void ReceivePassOutDrunk(); // Function FSD.CharacterIntoxicationComponent.ReceivePassOutDrunk
	void ReceiveDrunkTick(float DeltaTime, float DrunkTime); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkTick
	void ReceiveDrunkEnd(); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkEnd
	void ReceiveDrunkBegin(); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkBegin
	void PassOutDrunkSignature__DelegateSignature(struct APlayerCharacter* Player); // DelegateFunction FSD.CharacterIntoxicationComponent.PassOutDrunkSignature__DelegateSignature
	bool IsPassOutDrunk(); // Function FSD.CharacterIntoxicationComponent.IsPassOutDrunk
	bool IsOnSpaceRig(); // Function FSD.CharacterIntoxicationComponent.IsOnSpaceRig
	bool IsLocallyControlled(); // Function FSD.CharacterIntoxicationComponent.IsLocallyControlled
	bool IsDrunk(); // Function FSD.CharacterIntoxicationComponent.IsDrunk
	void IntoxicationProgressSignature__DelegateSignature(struct APlayerCharacter* Player, float Progress); // DelegateFunction FSD.CharacterIntoxicationComponent.IntoxicationProgressSignature__DelegateSignature
	bool HasAuthority(); // Function FSD.CharacterIntoxicationComponent.HasAuthority
	float GetSoberingUpCoolDown(); // Function FSD.CharacterIntoxicationComponent.GetSoberingUpCoolDown
	float GetIntoxicationProgressMapped(struct UCurveFloat* Curve); // Function FSD.CharacterIntoxicationComponent.GetIntoxicationProgressMapped
	float GetIntoxicationProgress(); // Function FSD.CharacterIntoxicationComponent.GetIntoxicationProgress
	int32_t GetAlcoholPct(enum class EDrinkableAlcoholStrength Strength); // Function FSD.CharacterIntoxicationComponent.GetAlcoholPct
	void Consume(struct UDrinkableDataAsset* Drinkable); // Function FSD.CharacterIntoxicationComponent.Consume
	void ClearIntoxication(); // Function FSD.CharacterIntoxicationComponent.ClearIntoxication
};

// Class FSD.CharacterRecoilComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UCharacterRecoilComponent : UActorComponent {
	struct FVector Recoil; // 0xb0(0x0c)
	struct FVector RecoilVelocity; // 0xbc(0x0c)
	struct FVector PrevError; // 0xc8(0x0c)
	char UnknownData_D4[0xc]; // 0xd4(0x0c)
};

// Class FSD.CharacterSettings
// Size: 0x180 (Inherited: 0x30)
struct UCharacterSettings : UDataAsset {
	struct TArray<SoftClassProperty> RankedHeroClasses; // 0x30(0x10)
	struct TArray<struct APlayerCharacter*> LoadedClasses; // 0x40(0x10)
	struct TArray<struct FText> PlayerRankNames; // 0x50(0x10)
	struct TArray<int32_t> CharacterXPLevels; // 0x60(0x10)
	struct TMap<struct FGuid, struct UPlayerCharacterID*> PlayerCharacterIDMap; // 0x70(0x50)
	struct TArray<struct UPlayerCharacterID*> PlayerCharacterIDs; // 0xc0(0x10)
	struct UPlayerCharacterID* BoscoID; // 0xd0(0x08)
	struct USkeletalMesh* NoHead; // 0xd8(0x08)
	struct USkeletalMesh* DefaultHead; // 0xe0(0x08)
	struct USkeletalMesh* ThickNeck; // 0xe8(0x08)
	struct USkeletalMesh* ThinNeck; // 0xf0(0x08)
	SoftClassProperty CarriableBagClass; // 0xf8(0x28)
	struct UUseAnimationSetting* ThrowItemAnimSettings; // 0x120(0x08)
	struct TMap<struct UPlayerCharacterID*, struct UCharacterVanityItems*> CharacterVanityItems; // 0x128(0x50)
	struct UDialogDataAsset* AutoReloadShout; // 0x178(0x08)

	void PreloadAllInventories(struct UAsyncManager* AsyncManager); // Function FSD.CharacterSettings.PreloadAllInventories
	struct UPlayerCharacterID* GetPlayerCharacterID(struct FGuid ID); // Function FSD.CharacterSettings.GetPlayerCharacterID
};

// Class FSD.CharacterSightComponent
// Size: 0x158 (Inherited: 0xb0)
struct UCharacterSightComponent : UActorComponent {
	struct FMulticastInlineDelegate OnTargetChanged; // 0xb0(0x10)
	float TargetMaxDistance; // 0xc0(0x04)
	char TraceChannel; // 0xc4(0x01)
	char UnknownData_C5[0x3]; // 0xc5(0x03)
	struct TArray<struct FWeakObjectPtr<struct AActor>> IgnoredActors; // 0xc8(0x10)
	struct APlayerCharacter* Character; // 0xd8(0x08)
	struct FWeakObjectPtr<struct AActor> TargetActor; // 0xe0(0x08)
	struct FWeakObjectPtr<struct UPrimitiveComponent> TargetPrimitive; // 0xe8(0x08)
	struct FWeakObjectPtr<struct USimpleObjectInfoComponent> TargetInfo; // 0xf0(0x08)
	struct FWeakObjectPtr<struct UTemperatureComponent> TargetTemperature; // 0xf8(0x08)
	struct FWeakObjectPtr<struct UPawnAfflictionComponent> TargetAfflictions; // 0x100(0x08)
	struct TScriptInterface<None> TargetHealth; // 0x108(0x10)
	struct TScriptInterface<None> TargetTargetable; // 0x118(0x10)
	float TargetTime; // 0x128(0x04)
	struct FReplicatedCharacterData ReplicatedData; // 0x12c(0x18)
	char UnknownData_144[0x14]; // 0x144(0x14)

	void TargetChangedSignature__DelegateSignature(struct AActor* NewTarget, struct UPrimitiveComponent* NewPrimitive); // DelegateFunction FSD.CharacterSightComponent.TargetChangedSignature__DelegateSignature
	void Server_UpdateTarget(struct AActor* NewActor, struct UPrimitiveComponent* NewPrimitive); // Function FSD.CharacterSightComponent.Server_UpdateTarget
	void RemoveIgnoreActor(struct AActor* InActor); // Function FSD.CharacterSightComponent.RemoveIgnoreActor
	void ReceiveTargetInSightTick(float DeltaTime); // Function FSD.CharacterSightComponent.ReceiveTargetInSightTick
	void ReceiveTargetChanged(); // Function FSD.CharacterSightComponent.ReceiveTargetChanged
	void GetSightStartAndEnd(float InMaxDistance, struct FVector OutStartLocation, struct FVector OutEndLocation); // Function FSD.CharacterSightComponent.GetSightStartAndEnd
	void AddIgnoreActor(struct AActor* InActor); // Function FSD.CharacterSightComponent.AddIgnoreActor
};

// Class FSD.CharacterStateComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UCharacterStateComponent : UActorComponent {
	char StateId; // 0xb0(0x01)
	char UnknownData_B1[0x7]; // 0xb1(0x07)
	struct APlayerCharacter* Character; // 0xb8(0x08)
	struct UDialogDataAsset* EnterStateShout; // 0xc0(0x08)
	struct UDialogDataAsset* ExitStateShout; // 0xc8(0x08)
	struct UDialogDataAsset* AttentionShout; // 0xd0(0x08)
	struct UPlayerMovementComponent* PlayerMovement; // 0xd8(0x08)
	char UnknownData_E0[0x18]; // 0xe0(0x18)

	void ReceiveStateTick(float DeltaTime); // Function FSD.CharacterStateComponent.ReceiveStateTick
	void ReceiveStateExit(); // Function FSD.CharacterStateComponent.ReceiveStateExit
	void ReceiveStateEnter(); // Function FSD.CharacterStateComponent.ReceiveStateEnter
	bool IsLocallyControlled(); // Function FSD.CharacterStateComponent.IsLocallyControlled
	bool HasAuthority(); // Function FSD.CharacterStateComponent.HasAuthority
	float GetStateTime(); // Function FSD.CharacterStateComponent.GetStateTime
	char GetStateID(); // Function FSD.CharacterStateComponent.GetStateID
	bool GetStateActive(); // Function FSD.CharacterStateComponent.GetStateActive
	struct UPlayerMovementComponent* GetCharacterMovement(); // Function FSD.CharacterStateComponent.GetCharacterMovement
};

// Class FSD.CharacterUseComponent
// Size: 0x1f8 (Inherited: 0xb0)
struct UCharacterUseComponent : UActorComponent {
	struct FMulticastInlineDelegate OnDepositingBegin; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnDepositingEnd; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnBeginHoveringEvent; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnEndHoveringEvent; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnBeginUsingEvent; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnEndUsingEvent; // 0x100(0x10)
	struct FMulticastInlineDelegate OnBeginUseNoUsable; // 0x110(0x10)
	struct FMulticastInlineDelegate OnEndUseNoUsable; // 0x120(0x10)
	struct UUsableComponentBase* ActiveUsablee; // 0x130(0x08)
	struct UUsableComponentBase* HoveringUsable; // 0x138(0x08)
	struct USceneComponent* HoveringUsableCollider; // 0x140(0x08)
	struct USceneComponent* ActiveUsableCollider; // 0x148(0x08)
	struct USphereComponent* UseCollider; // 0x150(0x08)
	struct USoundBase* AudioBeginDepositing; // 0x158(0x08)
	struct USoundBase* AudioEndDepositing; // 0x160(0x08)
	float UseDistance; // 0x168(0x04)
	char UnknownData_16C[0x1]; // 0x16c(0x01)
	enum class EUseRestriction UseRestriction; // 0x16d(0x01)
	char UnknownData_16E[0x2]; // 0x16e(0x02)
	struct APlayerCharacter* Character; // 0x170(0x08)
	char UnknownData_178[0x30]; // 0x178(0x30)
	struct TMap<struct UUsableComponentBase*, float> UseCooldownTracker; // 0x1a8(0x50)

	void Server_SetCanUse(enum class EUseRestriction UseRestriction); // Function FSD.CharacterUseComponent.Server_SetCanUse
	void Server_EndUse(); // Function FSD.CharacterUseComponent.Server_EndUse
	void Server_BeginUse(struct UUsableComponentBase* Usable, struct USceneComponent* UsableCollider); // Function FSD.CharacterUseComponent.Server_BeginUse
	void OnRep_ActiveUsablee(struct UUsableComponentBase* lastUsable); // Function FSD.CharacterUseComponent.OnRep_ActiveUsablee
	void OnCharacterStateChanged(enum class ECharacterState NewState); // Function FSD.CharacterUseComponent.OnCharacterStateChanged
	bool IsLookingAtUsable(); // Function FSD.CharacterUseComponent.IsLookingAtUsable
	bool IsLookingAtDepositable(); // Function FSD.CharacterUseComponent.IsLookingAtDepositable
	float GetUseProgress(); // Function FSD.CharacterUseComponent.GetUseProgress
	struct AActor* GetLookingAtActor(); // Function FSD.CharacterUseComponent.GetLookingAtActor
	bool GetIsUsing(); // Function FSD.CharacterUseComponent.GetIsUsing
	bool GetIsDepositing(); // Function FSD.CharacterUseComponent.GetIsDepositing
	void All_PlaySingleUse(struct UUsableComponentBase* Usable); // Function FSD.CharacterUseComponent.All_PlaySingleUse
	void AddCustomUsableComponent(struct UUsableComponentBase* Usable, enum class ECustomUsableType eType); // Function FSD.CharacterUseComponent.AddCustomUsableComponent
};

// Class FSD.CharacterVanityComponent
// Size: 0x1e0 (Inherited: 0xb0)
struct UCharacterVanityComponent : UActorComponent {
	char UnknownData_B0[0x8]; // 0xb0(0x08)
	struct UCharacterVanityItems* AvailableVanityItems; // 0xb8(0x08)
	struct UBeardColorVanityItem* ShownBeardColor; // 0xc0(0x08)
	struct UMaterialInterface* ArmorMaterial; // 0xc8(0x08)
	struct UMaterialInstanceDynamic* DynamicSkinMaterial; // 0xd0(0x08)
	enum class EHeadVanityType HeadVanityType; // 0xd8(0x01)
	char UnknownData_D9[0x7]; // 0xd9(0x07)
	struct TArray<struct UVanityItem*> EquippedVanity; // 0xe0(0x10)
	struct UMaterialInterface* SkinMaterial; // 0xf0(0x08)
	struct TArray<struct FTattooArmorItem> Tattoos; // 0xf8(0x10)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x108(0x10)
	char UnknownData_118[0x68]; // 0x118(0x68)
	struct TMap<enum class EVanitySlot, struct USkeletalMeshComponent*> VanityMeshes; // 0x180(0x50)
	char UnknownData_1D0[0x10]; // 0x1d0(0x10)

	void UpdateMeshes(); // Function FSD.CharacterVanityComponent.UpdateMeshes
	void UpdateEquippedVanity(bool applyItems); // Function FSD.CharacterVanityComponent.UpdateEquippedVanity
	void SetEquippedVanityInViewer(struct TArray<struct UVanityItem*> Vanity); // Function FSD.CharacterVanityComponent.SetEquippedVanityInViewer
	void Server_SetEquippedVanity(struct TArray<struct UVanityItem*> equippedItems); // Function FSD.CharacterVanityComponent.Server_SetEquippedVanity
	struct UVanityItem* Receive_GetEquippedVanityItem(struct UObject* WorldContextObject, struct UPlayerCharacterID* Character, enum class EVanitySlot Slot); // Function FSD.CharacterVanityComponent.Receive_GetEquippedVanityItem
	void OnRep_EquippedVanity(); // Function FSD.CharacterVanityComponent.OnRep_EquippedVanity
	struct UVanityItem* GetEquippedVanityItem(enum class EVanitySlot Slot); // Function FSD.CharacterVanityComponent.GetEquippedVanityItem
	struct UCharacterVanityItems* GetAvailableVanityItems(); // Function FSD.CharacterVanityComponent.GetAvailableVanityItems
	void EnforceValidPaintjob(); // Function FSD.CharacterVanityComponent.EnforceValidPaintjob
	void CreateEquippedGear(); // Function FSD.CharacterVanityComponent.CreateEquippedGear
};

// Class FSD.CharacterVanityItems
// Size: 0x1a8 (Inherited: 0x30)
struct UCharacterVanityItems : UDataAsset {
	struct TArray<struct UHeadVanityItem*> HeadItems; // 0x30(0x10)
	struct UVanitySchematicBank* HeadSchematicBank; // 0x40(0x08)
	struct TArray<struct UBeardVanityItem*> BeardItems; // 0x48(0x10)
	struct UVanitySchematicBank* BeardSchematicBank; // 0x58(0x08)
	struct TArray<struct UArmorVanityItem*> ArmorItems; // 0x60(0x10)
	struct TArray<struct UArmorMaterialVanityItem*> ArmorMaterialItems; // 0x70(0x10)
	struct TArray<struct UArmorMaterialVanityItem*> ArmorMaterialItemsInTreassures; // 0x80(0x10)
	struct TArray<struct UEyeBrowsVanityItem*> EyebrowsItems; // 0x90(0x10)
	struct UVanitySchematicBank* EyebrowSchematicBank; // 0xa0(0x08)
	struct TArray<struct UMoustacheVanityItem*> MoustacheItems; // 0xa8(0x10)
	struct UVanitySchematicBank* MoustacheSchematicBank; // 0xb8(0x08)
	struct TArray<struct USideburnsVanityItem*> SideburnItems; // 0xc0(0x10)
	struct UVanitySchematicBank* SideburnSchematicBank; // 0xd0(0x08)
	struct TArray<struct UBeardColorVanityItem*> BeardMaterialItems; // 0xd8(0x10)
	struct UVanitySchematicBank* BeardMaterialSchematicBank; // 0xe8(0x08)
	struct TArray<struct USkinColorVanityItem*> SkinMaterialItems; // 0xf0(0x10)
	struct UVanitySchematicBank* SkinMaterialSchematicBank; // 0x100(0x08)
	struct TMap<struct FGuid, struct UVanityItem*> VanityMap; // 0x108(0x50)
	struct TMap<enum class EVanitySlot, struct UVanityItem*> DefaultItems; // 0x158(0x50)

	void SortVanityItems(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID, struct TArray<struct UVanityItem*> vanityItems); // Function FSD.CharacterVanityItems.SortVanityItems
	struct TArray<struct UVanityItem*> GetVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetVanityItems
	struct UVanityItem* GetVanityItem(struct FGuid VanityID); // Function FSD.CharacterVanityItems.GetVanityItem
	struct TArray<struct UVanityItem*> GetUnLockedVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetUnLockedVanityItems
	struct TArray<struct UVanityItem*> GetLockedVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetLockedVanityItems
	struct TArray<struct UVanityItem*> GetItems(enum class EVanitySlot Slot, bool onlyStoreItems); // Function FSD.CharacterVanityItems.GetItems
	struct UVanityItem* GetDefaultVanityItem(struct UObject* WorldContext, enum class EVanitySlot Slot, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetDefaultVanityItem
	void Clean(); // Function FSD.CharacterVanityItems.Clean
};

// Class FSD.CharacterSelectionSwitcher
// Size: 0x220 (Inherited: 0x220)
struct ACharacterSelectionSwitcher : AActor {

	void OnVictoryPoseChanged(struct UVictoryPose* VictoryPose); // Function FSD.CharacterSelectionSwitcher.OnVictoryPoseChanged
	void OnVanityItemEquipped(enum class EVanitySlot Slot); // Function FSD.CharacterSelectionSwitcher.OnVanityItemEquipped
	void Hide(); // Function FSD.CharacterSelectionSwitcher.Hide
	struct AActor* GetViewerActor(); // Function FSD.CharacterSelectionSwitcher.GetViewerActor
	struct APlayerCharacter* GetActiveCharacter(); // Function FSD.CharacterSelectionSwitcher.GetActiveCharacter
};

// Class FSD.ChargedWeapon
// Size: 0x728 (Inherited: 0x690)
struct AChargedWeapon : AAmmoDrivenWeapon {
	struct FMulticastInlineDelegate OnChargeChanged; // 0x690(0x10)
	struct FMulticastInlineDelegate OnHeatChanged; // 0x6a0(0x10)
	char UnknownData_6B0[0x8]; // 0x6b0(0x08)
	struct UAnimMontage* FP_OverheatAnim; // 0x6b8(0x08)
	struct UAnimMontage* FP_ChargeupMontage; // 0x6c0(0x08)
	struct UParticleSystem* ChargeupParticles; // 0x6c8(0x08)
	struct UParticleSystemComponent* ChargeupParticleInstance; // 0x6d0(0x08)
	struct UFXSystemAsset* ChargeupFireMuzzleFlash; // 0x6d8(0x08)
	struct USoundCue* NormalFiresound; // 0x6e0(0x08)
	struct USoundCue* FullyChargedFireSound; // 0x6e8(0x08)
	float ChargeSpeed; // 0x6f0(0x04)
	bool Charging; // 0x6f4(0x01)
	char UnknownData_6F5[0x3]; // 0x6f5(0x03)
	float ChargeProgress; // 0x6f8(0x04)
	int32_t ShotCostAtBelowFullCharge; // 0x6fc(0x04)
	int32_t ShotCostAtFullCharge; // 0x700(0x04)
	bool ChargedShotsOnly; // 0x704(0x01)
	bool AutoFireWhenOverheated; // 0x705(0x01)
	char UnknownData_706[0x2]; // 0x706(0x02)
	float TotalHeat; // 0x708(0x04)
	char UnknownData_70C[0x4]; // 0x70c(0x04)
	float CoolingRate; // 0x710(0x04)
	float HeatPerSecondWhileCharging; // 0x714(0x04)
	float HeatPerSecondWhenCharged; // 0x718(0x04)
	float HeatPerNormalShot; // 0x71c(0x04)
	float HeatPerChargedShot; // 0x720(0x04)
	char UnknownData_724[0x4]; // 0x724(0x04)

	void SetOverheated(bool isOverheated); // Function FSD.ChargedWeapon.SetOverheated
	void Server_SetIsCharging(bool isChargingValue); // Function FSD.ChargedWeapon.Server_SetIsCharging
	void RecieveChargeProgressChanged(float NewChargeProgress); // Function FSD.ChargedWeapon.RecieveChargeProgressChanged
	void ReceiveOverheatedChanged(bool isOverheated); // Function FSD.ChargedWeapon.ReceiveOverheatedChanged
	bool GetIsCharging(); // Function FSD.ChargedWeapon.GetIsCharging
};

// Class FSD.ChargedWeaponAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UChargedWeaponAnimInstance : UAnimInstance {
	bool IsCharging; // 0x268(0x01)
	float ChargeupPlayRate; // 0x26c(0x04)
	float ChargeupPlayRateSpeedChange; // 0x270(0x04)
	float ChargedownPlayRateSpeedChange; // 0x274(0x04)
	float MaxChargeupPlayRate; // 0x278(0x04)
	struct AChargedWeapon* Weapon; // 0x280(0x08)
	char UnknownData_289[0x7]; // 0x289(0x07)
};

// Class FSD.ProjectileBase
// Size: 0x2a8 (Inherited: 0x220)
struct AProjectileBase : AActor {
	struct FProjectileImpact ProjectileImpact; // 0x220(0x30)
	bool Exploded; // 0x250(0x01)
	bool DoOnImpact; // 0x251(0x01)
	bool DoOnImpact2; // 0x252(0x01)
	bool DoOnImpact3; // 0x253(0x01)
	bool DoOnSpawnVar; // 0x254(0x01)
	char UnknownData_255[0x13]; // 0x255(0x13)
	bool IsDorment; // 0x268(0x01)
	char UnknownData_269[0x7]; // 0x269(0x07)
	struct USphereComponent* CollisionComponent; // 0x270(0x08)
	char UnknownData_278[0x4]; // 0x278(0x04)
	float LifeSpan; // 0x27c(0x04)
	float VelocityMultiplier; // 0x280(0x04)
	float GravityMultiplier; // 0x284(0x04)
	bool AffectedByDifficultySpeedModifier; // 0x288(0x01)
	char UnknownData_289[0x7]; // 0x289(0x07)
	enum class EOnProjectileImpactBehaviourEnum EOnImpactBehaviour; // 0x290(0x04)
	char UnknownData_294[0x14]; // 0x294(0x14)

	struct UTerrainMaterial* TryGetTerrainMaterial(); // Function FSD.ProjectileBase.TryGetTerrainMaterial
	void StopMovement(); // Function FSD.ProjectileBase.StopMovement
	void OnRep_ProjectileImpact(); // Function FSD.ProjectileBase.OnRep_ProjectileImpact
	void OnRep_IsDorment(bool wasDorment); // Function FSD.ProjectileBase.OnRep_IsDorment
	void OnInitialized(); // Function FSD.ProjectileBase.OnInitialized
	void OnImpacted(bool PredictedImpact, struct FHitResult HitResult); // Function FSD.ProjectileBase.OnImpacted
	void MakeBouncy(); // Function FSD.ProjectileBase.MakeBouncy
	void InitState(struct FVector ShootDirection, struct FVector initialBonusVelocity); // Function FSD.ProjectileBase.InitState
	void InitComponents(); // Function FSD.ProjectileBase.InitComponents
	void IgnoreCollision(struct UPrimitiveComponent* otherCollider); // Function FSD.ProjectileBase.IgnoreCollision
	float GetGameTimeSinceActivation(); // Function FSD.ProjectileBase.GetGameTimeSinceActivation
	int32_t GetBoneIndex(); // Function FSD.ProjectileBase.GetBoneIndex
	void DoOnSpawn(); // Function FSD.ProjectileBase.DoOnSpawn
	void DisableProjectileCollision(struct AProjectileBase* projectileA, struct AProjectileBase* projectileB); // Function FSD.ProjectileBase.DisableProjectileCollision
	void DisableAndDestroy(); // Function FSD.ProjectileBase.DisableAndDestroy
};

// Class FSD.Projectile
// Size: 0x2f0 (Inherited: 0x2a8)
struct AProjectile : AProjectileBase {
	struct FProjectileState State; // 0x2a8(0x28)
	char UnknownData_2D0[0x1]; // 0x2d0(0x01)
	bool UseArmorDamageBoneCheck; // 0x2d1(0x01)
	char UnknownData_2D2[0x6]; // 0x2d2(0x06)
	struct TArray<struct AActor*> IgnoreActorClasses; // 0x2d8(0x10)
	struct UProjectileMovementComponent* MovementComponent; // 0x2e8(0x08)

	struct AProjectileBase* SpawnProjectile(struct UObject* WorldContextObject, struct AProjectileBase* projectileClass, struct APawn* projectileOwner, struct FVector Origin, struct FRotator velocityDirection); // Function FSD.Projectile.SpawnProjectile
	struct AProjectileBase* SpawnBallisticProjectile(struct UObject* WorldContextObject, struct AProjectile* projectileClass, struct APawn* projectileOwner, struct FVector Origin, struct FVector Velocity); // Function FSD.Projectile.SpawnBallisticProjectile
	void SetHomingTargetComponent(struct USceneComponent* HomingTargetComponent, float Delay); // Function FSD.Projectile.SetHomingTargetComponent
	void OnRep_State(struct FProjectileState oldState); // Function FSD.Projectile.OnRep_State
	void OnImpact(struct FHitResult HitResult); // Function FSD.Projectile.OnImpact
	void OnBounce(struct FHitResult ImpactResult, struct FVector ImpactVelocity); // Function FSD.Projectile.OnBounce
	struct UFSDPhysicalMaterial* FindBoneIndexFromArmor(struct FHitResult HitResult, int32_t outBoneIndex); // Function FSD.Projectile.FindBoneIndexFromArmor
	void ClearMovementComponent(); // Function FSD.Projectile.ClearMovementComponent
};

// Class FSD.ChargedProjectile
// Size: 0x2f8 (Inherited: 0x2f0)
struct AChargedProjectile : AProjectile {
	bool ExplodesWhenDead; // 0x2f0(0x01)
	bool PersistentExplosion; // 0x2f1(0x01)
	bool AoEDamageInFlight; // 0x2f2(0x01)
	char UnknownData_2F3[0x1]; // 0x2f3(0x01)
	float DirectDamageReduction; // 0x2f4(0x04)

	void OnAoEDamageEnabled(); // Function FSD.ChargedProjectile.OnAoEDamageEnabled
};

// Class FSD.ChromaComponent
// Size: 0x180 (Inherited: 0xb0)
struct UChromaComponent : UActorComponent {
	struct FLinearColor HealthBarColor; // 0xb0(0x10)
	struct FLinearColor DamageEffectColor; // 0xc0(0x10)
	struct FLinearColor DownedEffectColor; // 0xd0(0x10)
	struct FLinearColor ShieldBarColor; // 0xe0(0x10)
	struct FLinearColor ShieldEffectColor; // 0xf0(0x10)
	struct FLinearColor WeaponColor; // 0x100(0x10)
	struct FLinearColor WeaponEquipedColor; // 0x110(0x10)
	struct FLinearColor GrenadeColor; // 0x120(0x10)
	struct FLinearColor WASDColor; // 0x130(0x10)
	struct FLinearColor RessuplyColor; // 0x140(0x10)
	struct FLinearColor ReloadColor; // 0x150(0x10)
	enum class EFSDChromaEffect ActiveEffect; // 0x160(0x01)
	char UnknownData_161[0x3]; // 0x161(0x03)
	float EffectDuration; // 0x164(0x04)
	uint32_t EffectSeed; // 0x168(0x04)
	char UnknownData_16C[0x14]; // 0x16c(0x14)

	void TriggerEffect(enum class EFSDChromaEffect effect); // Function FSD.ChromaComponent.TriggerEffect
};

// Class FSD.ClaimableRewardEntryWidget
// Size: 0x298 (Inherited: 0x230)
struct UClaimableRewardEntryWidget : UUserWidget {
	struct FMulticastInlineDelegate OnRewardClaimed; // 0x230(0x10)
	struct FClaimableRewardEntry Data; // 0x240(0x58)

	void WidgetDelegate__DelegateSignature(struct UClaimableRewardEntryWidget* EntryWidget); // DelegateFunction FSD.ClaimableRewardEntryWidget.WidgetDelegate__DelegateSignature
	void SignalRewardClaimed(); // Function FSD.ClaimableRewardEntryWidget.SignalRewardClaimed
	void SetData(struct FClaimableRewardEntry InData); // Function FSD.ClaimableRewardEntryWidget.SetData
	void ReceiveDataChanged(); // Function FSD.ClaimableRewardEntryWidget.ReceiveDataChanged
};

// Class FSD.ClaimableRewardViewWidget
// Size: 0x2a0 (Inherited: 0x230)
struct UClaimableRewardViewWidget : UUserWidget {
	struct FClaimableRewardView Data; // 0x230(0x70)

	void ReceiveEndFlow(); // Function FSD.ClaimableRewardViewWidget.ReceiveEndFlow
	void ReceiveDataChanged(); // Function FSD.ClaimableRewardViewWidget.ReceiveDataChanged
	void ReceiveBeginFlow(); // Function FSD.ClaimableRewardViewWidget.ReceiveBeginFlow
	void EndRewardFlow(); // Function FSD.ClaimableRewardViewWidget.EndRewardFlow
	void BeginRewardFlow(struct FClaimableRewardView InViewData); // Function FSD.ClaimableRewardViewWidget.BeginRewardFlow
};

// Class FSD.ExampleActor
// Size: 0x240 (Inherited: 0x220)
struct AExampleActor : AActor {
	struct FMulticastInlineDelegate OnExampleUpdatedEvent; // 0x220(0x10)
	float Field; // 0x230(0x04)
	char UnknownData_234[0xc]; // 0x234(0x0c)

	void Server_ExampleFunction(); // Function FSD.ExampleActor.Server_ExampleFunction
	void Client_ExampleFunction(); // Function FSD.ExampleActor.Client_ExampleFunction
	void All_ExampleFunction(); // Function FSD.ExampleActor.All_ExampleFunction
};

// Class FSD.CollectableResourceData
// Size: 0x138 (Inherited: 0xf0)
struct UCollectableResourceData : UResourceData {
	struct UDebrisPositioning* Positioning; // 0xf0(0x08)
	float Rarity; // 0xf8(0x04)
	float InfluenceRadius; // 0xfc(0x04)
	struct TArray<struct UDebrisBase*> Debris; // 0x100(0x10)
	bool UseTerrainPlacement; // 0x110(0x01)
	char UnknownData_111[0x7]; // 0x111(0x07)
	struct TArray<SoftClassProperty> CollectableClasses; // 0x118(0x10)
	struct TArray<struct AActor*> CollectableClassesLoaded; // 0x128(0x10)
};

// Class FSD.CharacterShoutsData
// Size: 0xe0 (Inherited: 0x30)
struct UCharacterShoutsData : UDataAsset {
	struct FCharacterShouts Shouts; // 0x30(0xb0)
};

// Class FSD.ShoutWidget
// Size: 0x258 (Inherited: 0x230)
struct UShoutWidget : UUserWidget {
	struct FWeakObjectPtr<struct APlayerCharacter> Sender; // 0x230(0x08)
	struct FText Text; // 0x238(0x18)
	float Duration; // 0x250(0x04)
	bool IsSubtitle; // 0x254(0x01)
	char UnknownData_255[0x3]; // 0x255(0x03)

	void OnShout(); // Function FSD.ShoutWidget.OnShout
	struct FString GetTimeString(int32_t Seconds); // Function FSD.ShoutWidget.GetTimeString
	void GetSplitTimeString(int32_t Seconds, struct FString MinutesString, struct FString SecondsString); // Function FSD.ShoutWidget.GetSplitTimeString
	struct FString GetCountDownString(int32_t Seconds); // Function FSD.ShoutWidget.GetCountDownString
};

// Class FSD.CommunicationComponent
// Size: 0x288 (Inherited: 0xb0)
struct UCommunicationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnMissionShout; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnMissionShoutEnd; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnMixerAnnouncement; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnPlayerShouted; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnMissionControlFinished; // 0xf0(0x10)
	bool ShoutingEnabled; // 0x100(0x01)
	char UnknownData_101[0x7]; // 0x101(0x07)
	struct UShoutWidget* ShoutWidgetType; // 0x108(0x08)
	struct UCharacterShoutsData* CharacterShouts; // 0x110(0x08)
	float PitchMultiplier; // 0x118(0x04)
	float MinShoutDelay; // 0x11c(0x04)
	float CloseRangeShoutDistance; // 0x120(0x04)
	char UnknownData_124[0x4]; // 0x124(0x04)
	struct TMap<struct UDialogDataAsset*, float> DelayedShouts; // 0x128(0x50)
	struct FGameplayTagContainer KillShoutAllowedTags; // 0x178(0x20)
	bool bMissionControlPaused; // 0x198(0x01)
	char UnknownData_199[0x7]; // 0x199(0x07)
	struct UAudioComponent* MissionControlAudioComponent; // 0x1a0(0x08)
	struct TMap<struct APlayerCharacter*, struct UShoutWidget*> ActiveShouts; // 0x1a8(0x50)
	struct TArray<struct FActiveOutline> ActiveOutlines; // 0x1f8(0x10)
	struct APlayerCharacter* Character; // 0x208(0x08)
	struct UDialogDataAsset* LastShout; // 0x210(0x08)
	struct UAudioComponent* ShoutAudioComponent; // 0x218(0x08)
	struct TMap<struct UDialogDataAsset*, float> ShoutHistory; // 0x220(0x50)
	char UnknownData_270[0x8]; // 0x270(0x08)
	struct TArray<struct FMissionShoutQueueItem> MissionShoutQueue; // 0x278(0x10)

	void ShoutCustomOrDefault(struct UDialogDataAsset* CustomShout, enum class EShoutType DefaultShout); // Function FSD.CommunicationComponent.ShoutCustomOrDefault
	void ShoutCustomLocalOnly(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ShoutCustomLocalOnly
	void ShoutCustomClosestDwarf(struct UObject* WorldContext, struct UDialogDataAsset* Shout, struct FVector TargetLocation); // Function FSD.CommunicationComponent.ShoutCustomClosestDwarf
	void ShoutCustom(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ShoutCustom
	void Shout(enum class EShoutType Shout); // Function FSD.CommunicationComponent.Shout
	void SetMissionControlPaused(bool IsPaused); // Function FSD.CommunicationComponent.SetMissionControlPaused
	void ServerShout(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ServerShout
	void ServerMixerAnnouncement(struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.ServerMixerAnnouncement
	void ServerMissionShout(struct UDialogDataAsset* Shout, bool bPriority); // Function FSD.CommunicationComponent.ServerMissionShout
	struct UAudioComponent* PlayPitchedByClass(struct UObject* WorldContextObject, struct APlayerCharacter* CharacterClass, struct USoundBase* Sound, struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, struct UAudioComponent* AudioComponent); // Function FSD.CommunicationComponent.PlayPitchedByClass
	void PlayPitchedAsync(struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, struct UAudioComponent* AudioComponent, struct UObject* WorldContextObject, float shoutVolumeMultiplier); // Function FSD.CommunicationComponent.PlayPitchedAsync
	struct UAudioComponent* PlayPitched(struct USoundBase* Sound, struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, struct UAudioComponent* AudioComponent, struct UObject* WorldContextObject); // Function FSD.CommunicationComponent.PlayPitched
	void MixerAnnouncementLocalOnly(struct UObject* WorldContext, struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.MixerAnnouncementLocalOnly
	void MixerAnnouncement(struct UObject* WorldContext, struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.MixerAnnouncement
	int32_t MissionShoutLocally(struct UObject* WorldContext, struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.MissionShoutLocally
	void MissionShout(struct UObject* WorldContext, struct UDialogDataAsset* Shout, bool bPriority); // Function FSD.CommunicationComponent.MissionShout
	bool IsMissionControlSpeaking(); // Function FSD.CommunicationComponent.IsMissionControlSpeaking
	void ClientShout(struct APlayerCharacter* Sender, struct UDialogDataAsset* Shout, int32_t Index); // Function FSD.CommunicationComponent.ClientShout
	void ClientMixerAnnouncement(struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.ClientMixerAnnouncement
	void ClientMissionShout(struct UDialogDataAsset* Shout, int32_t Index, bool bPriority); // Function FSD.CommunicationComponent.ClientMissionShout
};

// Class FSD.CommnuityRewardBundle
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardBundle : UDataAsset {
	struct TArray<struct FCommunityReward> Rewards; // 0x30(0x10)

	void AwardRewards(struct UObject* WorldContext); // Function FSD.CommnuityRewardBundle.AwardRewards
};

// Class FSD.CommnuityRewardSetup
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardSetup : UDataAsset {
	struct TArray<struct UCommnuityRewardBundle*> TierRewards; // 0x30(0x10)

	struct TMap<struct UResourceData*, int32_t> GetResourcesTierOnlyReward(int32_t Tier); // Function FSD.CommnuityRewardSetup.GetResourcesTierOnlyReward
	struct TMap<struct UResourceData*, int32_t> GetResourcesReward(int32_t Tier); // Function FSD.CommnuityRewardSetup.GetResourcesReward
	void AwardTierRewards(struct UObject* WorldContext, int32_t Tier); // Function FSD.CommnuityRewardSetup.AwardTierRewards
};

// Class FSD.CommunityGoalCategory
// Size: 0x48 (Inherited: 0x30)
struct UCommunityGoalCategory : UDataAsset {
	struct FText Title; // 0x30(0x18)
};

// Class FSD.CommunityGoalFaction
// Size: 0xe8 (Inherited: 0x30)
struct UCommunityGoalFaction : UDataAsset {
	struct FText Title; // 0x30(0x18)
	struct FText Description; // 0x48(0x18)
	struct FText ShortDescription; // 0x60(0x18)
	struct FText JoinHeader; // 0x78(0x18)
	struct FText JoinBody; // 0x90(0x18)
	struct UTexture2D* Icon; // 0xa8(0x08)
	struct UTexture2D* Frame; // 0xb0(0x08)
	struct FSlateColor Color; // 0xb8(0x28)
	enum class EFSDFaction FactionID; // 0xe0(0x01)
	char UnknownData_E1[0x7]; // 0xe1(0x07)
};

// Class FSD.CommunityGoal
// Size: 0x98 (Inherited: 0x30)
struct UCommunityGoal : UDataAsset {
	bool TierValuesAreInitialized; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	struct FGuid SavegameID; // 0x34(0x10)
	bool Active; // 0x44(0x01)
	char UnknownData_45[0x3]; // 0x45(0x03)
	struct FText Title; // 0x48(0x18)
	struct FText MetaDescription; // 0x60(0x18)
	struct UCommunityGoalCategory* Category; // 0x78(0x08)
	enum class ECommunityGoalType CommunityGoalType; // 0x80(0x01)
	char UnknownData_81[0x3]; // 0x81(0x03)
	float GoalPerMemberTier1; // 0x84(0x04)
	float GoalPerMemberTier2; // 0x88(0x04)
	float GoalPerMemberTier3; // 0x8c(0x04)
	struct UCommnuityRewardSetup* RewardSetup; // 0x90(0x08)

	float TotalTierProgress(float Value, int32_t Members); // Function FSD.CommunityGoal.TotalTierProgress
	float TierValue(enum class ECommunityGoalTier Tier, float Value, int32_t Members); // Function FSD.CommunityGoal.TierValue
	float TierProgress(enum class ECommunityGoalTier Tier, float Value, int32_t Members); // Function FSD.CommunityGoal.TierProgress
	float TierGoal(enum class ECommunityGoalTier Tier, int32_t Members); // Function FSD.CommunityGoal.TierGoal
	int32_t RewardTier(float Value, int32_t Members); // Function FSD.CommunityGoal.RewardTier
	void IncrementGoal(struct UObject* WorldContext, float Value); // Function FSD.CommunityGoal.IncrementGoal
	struct FText GoalToText(enum class ECommunityGoalType StatType, float Value); // Function FSD.CommunityGoal.GoalToText
	struct FText GetCategoryTitle(); // Function FSD.CommunityGoal.GetCategoryTitle
	bool AreTiersInitialized(); // Function FSD.CommunityGoal.AreTiersInitialized
};

// Class FSD.CommunityGoalWrapper
// Size: 0x140 (Inherited: 0x28)
struct UCommunityGoalWrapper : UObject {
	bool HasCGS; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	struct FCommunityGoalStateData CGSData; // 0x2c(0x10)
	int32_t LastCollectedRewardID; // 0x3c(0x04)
	char UnknownData_40[0x8]; // 0x40(0x08)
	struct FCommunityFactionData FactionData; // 0x48(0x38)
	bool FreeBeerRewardActive; // 0x80(0x01)
	char UnknownData_81[0x7]; // 0x81(0x07)
	struct FMulticastInlineDelegate OnFreeBeerRewardChanged; // 0x88(0x10)
	char UnknownData_98[0x20]; // 0x98(0x20)
	struct FString SteamTicket; // 0xb8(0x10)
	struct FString SteamBranch; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnFactionsDataReceived; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnDiscordCGSDataEvent; // 0xe8(0x10)
	struct FMulticastInlineDelegate UICheck; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnGoalsInitializedDelegate; // 0x108(0x10)
	char UnknownData_118[0x20]; // 0x118(0x20)
	bool AreAllGoalsInitialized; // 0x138(0x01)
	char UnknownData_139[0x7]; // 0x139(0x07)

	void UpdateAllGoalsInitialized(); // Function FSD.CommunityGoalWrapper.UpdateAllGoalsInitialized
	bool RewardReceived(); // Function FSD.CommunityGoalWrapper.RewardReceived
	void RequestGoalStateData(); // Function FSD.CommunityGoalWrapper.RequestGoalStateData
	void RequestFactionsData(); // Function FSD.CommunityGoalWrapper.RequestFactionsData
	void NextPeriod(); // Function FSD.CommunityGoalWrapper.NextPeriod
	void InitializeGoalTierTargetValues(struct UCommunityGoal* goalToInitialize); // Function FSD.CommunityGoalWrapper.InitializeGoalTierTargetValues
	struct UCommunityGoalFaction* GetPlayerCurrentFaction(struct UObject* WorldContext); // Function FSD.CommunityGoalWrapper.GetPlayerCurrentFaction
	void ClaimRewardMessage(struct UObject* WorldContext, struct FCommunityRewardNotification rewardNotification); // Function FSD.CommunityGoalWrapper.ClaimRewardMessage
	void ClaimReward(); // Function FSD.CommunityGoalWrapper.ClaimReward
	void CheckUI(); // Function FSD.CommunityGoalWrapper.CheckUI
};

// Class FSD.ControllerIconSettings
// Size: 0xb8 (Inherited: 0x38)
struct UControllerIconSettings : UDeveloperSettings {
	struct FInputTranslationTable InputTranslationTable; // 0x38(0x50)
	struct TArray<struct FActionIconMapping> Xbox_KeyIcons; // 0x88(0x10)
	struct TArray<struct FActionIconMapping> Playstation_KeyIcons; // 0x98(0x10)
	struct TArray<struct FActionIconMapping> MouseKeyboard_KeyIcons; // 0xa8(0x10)

	bool FindMouseKeyboardKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindMouseKeyboardKeyIcon
	bool FindKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindKeyIcon
	bool FindControllerKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindControllerKeyIcon
};

// Class FSD.EnemyDeepPathfinderCharacter
// Size: 0x398 (Inherited: 0x378)
struct AEnemyDeepPathfinderCharacter : ADeepPathfinderCharacter {
	char UnknownData_378[0x8]; // 0x378(0x08)
	struct UEnemyHealthComponent* HealthComponent; // 0x380(0x08)
	struct FQueuedMontage QueuedMontage; // 0x388(0x10)

	void OnRep_QueuedMontage(); // Function FSD.EnemyDeepPathfinderCharacter.OnRep_QueuedMontage
};

// Class FSD.ConvertedRobot
// Size: 0x6b8 (Inherited: 0x398)
struct AConvertedRobot : AEnemyDeepPathfinderCharacter {
	char UnknownData_398[0x8]; // 0x398(0x08)
	struct UEnemyComponent* EnemyComponent; // 0x3a0(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x3a8(0x08)
	struct UOutlineComponent* outline; // 0x3b0(0x08)
	struct UHitscanComponent* HitScan; // 0x3b8(0x08)
	struct USingleUsableComponent* Usable; // 0x3c0(0x08)
	struct USceneComponent* TurretRoot; // 0x3c8(0x08)
	struct USkeletalMeshComponent* TurretMesh; // 0x3d0(0x08)
	struct UPointLightComponent* MuzzleFlash; // 0x3d8(0x08)
	struct USpotLightComponent* SpotLight; // 0x3e0(0x08)
	struct UStaticMeshComponent* LightCone; // 0x3e8(0x08)
	struct UStaticMeshComponent* LaserBeam; // 0x3f0(0x08)
	struct USceneComponent* ShieldRoot; // 0x3f8(0x08)
	struct UStaticMeshComponent* InnerShield; // 0x400(0x08)
	struct UStaticMeshComponent* OuterShield; // 0x408(0x08)
	struct UAudioComponent* PulsatingSoundComp; // 0x410(0x08)
	struct UAudioComponent* LaserWarningSound; // 0x418(0x08)
	struct UDamageComponent* Damage; // 0x420(0x08)
	struct FMulticastInlineDelegate OnStateChanged; // 0x428(0x10)
	struct FMulticastInlineDelegate OnShieldChanged; // 0x438(0x10)
	struct FMulticastInlineDelegate OnIntroductionStart; // 0x448(0x10)
	char UnknownData_458[0x10]; // 0x458(0x10)
	bool ForceSit; // 0x468(0x01)
	char UnknownData_469[0x7]; // 0x469(0x07)
	struct USoundBase* LaserSound; // 0x470(0x08)
	struct USoundBase* LastPowerDownSound; // 0x478(0x08)
	struct USoundBase* PowerUpSound; // 0x480(0x08)
	struct FWeakObjectPtr<struct UAudioComponent> LaserSoundComp; // 0x488(0x08)
	char UnknownData_490[0x18]; // 0x490(0x18)
	float IntroductionTime; // 0x4a8(0x04)
	bool IsIntroducing; // 0x4ac(0x01)
	bool IntroductionDone; // 0x4ad(0x01)
	bool IsGrowingShield; // 0x4ae(0x01)
	char UnknownData_4AF[0x1]; // 0x4af(0x01)
	float AimDownwardsOffset; // 0x4b0(0x04)
	float BigShieldScale; // 0x4b4(0x04)
	float SmallShieldScale; // 0x4b8(0x04)
	float ShieldGrowthRate; // 0x4bc(0x04)
	float LerpExp; // 0x4c0(0x04)
	float MinimumShieldSize; // 0x4c4(0x04)
	float TargetShieldSize; // 0x4c8(0x04)
	float IdleRotationSpeed; // 0x4cc(0x04)
	float LaserScaleRate; // 0x4d0(0x04)
	char UnknownData_4D4[0x4]; // 0x4d4(0x04)
	float MaxSearchAngle; // 0x4d8(0x04)
	char UnknownData_4DC[0x1c]; // 0x4dc(0x1c)
	bool DoSpecialWhenEnemy; // 0x4f8(0x01)
	bool DoSpecialWhenFriendly; // 0x4f9(0x01)
	bool PerfectTrackingWhenEnemy; // 0x4fa(0x01)
	bool PerfectTrackingWhenFriendly; // 0x4fb(0x01)
	char UnknownData_4FC[0x2]; // 0x4fc(0x02)
	bool ReplaceBurstAttack; // 0x4fe(0x01)
	char UnknownData_4FF[0x1]; // 0x4ff(0x01)
	struct USoundBase* GrenadeFireSound; // 0x500(0x08)
	struct UParticleSystem* GrenadeFireParticle; // 0x508(0x08)
	bool IsFiring; // 0x510(0x01)
	char UnknownData_511[0x3]; // 0x511(0x03)
	float TurretSpinSpeed; // 0x514(0x04)
	struct TArray<struct AActor*> Parasites; // 0x518(0x10)
	int32_t SpawnParasiteNumer; // 0x528(0x04)
	int32_t MaxParasiteSlots; // 0x52c(0x04)
	float ChanceToSpawnParasite; // 0x530(0x04)
	char UnknownData_534[0x4]; // 0x534(0x04)
	struct AParasiteEnemy* ParasiteClass; // 0x538(0x08)
	char UnknownData_540[0x6]; // 0x540(0x06)
	bool SpinTurret; // 0x546(0x01)
	char UnknownData_547[0x11]; // 0x547(0x11)
	struct AProjectile* SpecialAttackProjectile; // 0x558(0x08)
	struct AProjectile* FriendlyProjectile; // 0x560(0x08)
	char UnknownData_568[0xc]; // 0x568(0x0c)
	bool HasLockedOn; // 0x574(0x01)
	char UnknownData_575[0x3]; // 0x575(0x03)
	struct USoundBase* TargetingSound; // 0x578(0x08)
	struct UAnimSequenceBase* GrenadeShotAnimation; // 0x580(0x08)
	float LockonTime; // 0x588(0x04)
	char UnknownData_58C[0x4]; // 0x58c(0x04)
	struct USoundCue* ShootSound; // 0x590(0x08)
	float ShootSoundFadeout; // 0x598(0x04)
	char UnknownData_59C[0x4]; // 0x59c(0x04)
	struct UAudioComponent* ShootSoundInstance; // 0x5a0(0x08)
	struct USoundCue* ShootSoundTail; // 0x5a8(0x08)
	struct UParticleSystem* MuzzleEffect; // 0x5b0(0x08)
	struct UParticleSystem* TracerEffect; // 0x5b8(0x08)
	struct FRuntimeFloatCurve MuzzleLightCurve; // 0x5c0(0x88)
	char UnknownData_648[0x8]; // 0x648(0x08)
	float GunRange; // 0x650(0x04)
	float FireRate; // 0x654(0x04)
	float GrenadeFireRate; // 0x658(0x04)
	char UnknownData_65C[0x4]; // 0x65c(0x04)
	float BurstCooldown; // 0x660(0x04)
	char UnknownData_664[0x4]; // 0x664(0x04)
	int32_t MinBurst; // 0x668(0x04)
	int32_t MaxBurst; // 0x66c(0x04)
	float TurretLerpSpeed; // 0x670(0x04)
	float DamageWhenFriendly; // 0x674(0x04)
	float FriendlyFriendlyFireMultiplier; // 0x678(0x04)
	char UnknownData_67C[0x4]; // 0x67c(0x04)
	bool StartedSpecialAttack; // 0x680(0x01)
	enum class ERobotState TeamState; // 0x681(0x01)
	char UnknownData_682[0xe]; // 0x682(0x0e)
	bool IsWalking; // 0x690(0x01)
	bool IsDoingSpecialAttack; // 0x691(0x01)
	char UnknownData_692[0x6]; // 0x692(0x06)
	struct UStaticMeshComponent* TurretRotation; // 0x698(0x08)
	char UnknownData_6A0[0x8]; // 0x6a0(0x08)
	struct AActor* CurrentTarget; // 0x6a8(0x08)
	char UnknownData_6B0[0x8]; // 0x6b0(0x08)

	void UpdateGunsInsideTerrain(); // Function FSD.ConvertedRobot.UpdateGunsInsideTerrain
	void StartBossFight(); // Function FSD.ConvertedRobot.StartBossFight
	void ParasiteDamaged(float aDamage); // Function FSD.ConvertedRobot.ParasiteDamaged
	void OnWeaponsFired(struct FVector aHitResult); // Function FSD.ConvertedRobot.OnWeaponsFired
	void OnUsed(struct APlayerCharacter* aUser); // Function FSD.ConvertedRobot.OnUsed
	void OnSeePawn(struct APawn* APawn); // Function FSD.ConvertedRobot.OnSeePawn
	void OnRep_TeamState(); // Function FSD.ConvertedRobot.OnRep_TeamState
	void OnRep_Target(); // Function FSD.ConvertedRobot.OnRep_Target
	void OnRep_SpinTurret(); // Function FSD.ConvertedRobot.OnRep_SpinTurret
	void OnRep_IsIntroducting(); // Function FSD.ConvertedRobot.OnRep_IsIntroducting
	void OnRep_IsFiring(); // Function FSD.ConvertedRobot.OnRep_IsFiring
	void OnRep_IsDoingSpecialAttack(); // Function FSD.ConvertedRobot.OnRep_IsDoingSpecialAttack
	void OnParasiteDeath(struct AActor* AParasiteEnemy); // Function FSD.ConvertedRobot.OnParasiteDeath
	enum class ERobotState GetTeamState(); // Function FSD.ConvertedRobot.GetTeamState
	struct FVector GetPlayerMediumPoint(); // Function FSD.ConvertedRobot.GetPlayerMediumPoint
	struct TArray<struct AActor*> GetParasites(); // Function FSD.ConvertedRobot.GetParasites
	bool GetHasPoweredDown(); // Function FSD.ConvertedRobot.GetHasPoweredDown
	void DestroyAttatchPoint(struct USceneComponent* aComponent); // Function FSD.ConvertedRobot.DestroyAttatchPoint
	void CannonEffects(); // Function FSD.ConvertedRobot.CannonEffects
	void BP_OnStateChanged(enum class ERobotState TeamState); // Function FSD.ConvertedRobot.BP_OnStateChanged
	void BP_OnShieldChanged(bool isGrowing); // Function FSD.ConvertedRobot.BP_OnShieldChanged
	void BP_OnInstroduce(); // Function FSD.ConvertedRobot.BP_OnInstroduce
};

// Class FSD.ConvertedRobotAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UConvertedRobotAnimInstance : UAnimInstance {
	bool HasIntroduced; // 0x26c(0x01)
	bool IsWalking; // 0x26d(0x01)
	bool IsIntroducing; // 0x26e(0x01)
	bool ShouldSit; // 0x26f(0x01)
	bool StopSit; // 0x270(0x01)
	bool ShouldCollapse; // 0x271(0x01)
	bool IsPoweredDown; // 0x272(0x01)
	float WalkingRate; // 0x274(0x04)
	float NormalWalkSpeed; // 0x278(0x04)
	char UnknownData_27F[0x1]; // 0x27f(0x01)
};

// Class FSD.ConvertedRobotTurretAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UConvertedRobotTurretAnimInstance : UAnimInstance {
	bool ReplaceBurstAttack; // 0x268(0x01)
	bool IsFiringGrenades; // 0x269(0x01)
	bool IsDoingSpecialAttack; // 0x26a(0x01)
	bool ShouldFireBullets; // 0x26b(0x01)
	bool StopFiringBullets; // 0x26c(0x01)
	bool ShouldCannonDeploy; // 0x26d(0x01)
};

// Class FSD.EnemyAIController
// Size: 0x358 (Inherited: 0x358)
struct AEnemyAIController : AFSDAIController {
};

// Class FSD.ConvertedRobotController
// Size: 0x428 (Inherited: 0x358)
struct AConvertedRobotController : AEnemyAIController {
	float CheckRangeInterval; // 0x358(0x04)
	float MaxTimeInRange; // 0x35c(0x04)
	char UnknownData_360[0x4]; // 0x360(0x04)
	float PersonalSpaceRange; // 0x364(0x04)
	char UnknownData_368[0x10]; // 0x368(0x10)
	struct FGameplayTagQuery FriendlyTargetingQuery; // 0x378(0x48)
	float SpecialAttackRange; // 0x3c0(0x04)
	float SpecialAttackFireRate; // 0x3c4(0x04)
	char UnknownData_3C8[0x20]; // 0x3c8(0x20)
	float WaitBeforeSpecial; // 0x3e8(0x04)
	char UnknownData_3EC[0x4]; // 0x3ec(0x04)
	float WaitAfterSpecial; // 0x3f0(0x04)
	char UnknownData_3F4[0x8]; // 0x3f4(0x08)
	float MinSpecialAttackCooldown; // 0x3fc(0x04)
	float MaxSpecialAttackCooldown; // 0x400(0x04)
	char UnknownData_404[0x4]; // 0x404(0x04)
	struct UBehaviorTree* BehaviourTree; // 0x408(0x08)
	float UpdateTargetInterval; // 0x410(0x04)
	char UnknownData_414[0x4]; // 0x414(0x04)
	float PowerDownAfterSeconds; // 0x418(0x04)
	char UnknownData_41C[0xc]; // 0x41c(0x0c)

	void ResetCloseTimer(); // Function FSD.ConvertedRobotController.ResetCloseTimer
};

// Class FSD.CoolDownItemAggregator
// Size: 0xe8 (Inherited: 0xc8)
struct UCoolDownItemAggregator : UItemAggregator {
	float CooldownDuration; // 0xc8(0x04)
	char UnknownData_CC[0x4]; // 0xcc(0x04)
	struct USoundBase* AudioCoolDownFinished; // 0xd0(0x08)
	float CooldownRemaining; // 0xd8(0x04)
	bool CoolDownIsPaused; // 0xdc(0x01)
	char UnknownData_DD[0x3]; // 0xdd(0x03)
	struct AItem* Item; // 0xe0(0x08)

	void SetPaused(bool IsPaused); // Function FSD.CoolDownItemAggregator.SetPaused
	bool IsCoolingDown(); // Function FSD.CoolDownItemAggregator.IsCoolingDown
	float GetCoolDownProgress(); // Function FSD.CoolDownItemAggregator.GetCoolDownProgress
	void ActivateCoolDown(bool startPaused); // Function FSD.CoolDownItemAggregator.ActivateCoolDown
};

// Class FSD.CoolDownProgressWidget
// Size: 0x280 (Inherited: 0x230)
struct UCoolDownProgressWidget : UUserWidget {
	struct FCoolDownProgressStyle Style; // 0x230(0x40)
	struct FWeakObjectPtr<struct UObject> CoolDownObject; // 0x270(0x08)
	bool bIsFinished; // 0x278(0x01)
	char UnknownData_279[0x7]; // 0x279(0x07)

	void UpdateProgress(float Progress); // Function FSD.CoolDownProgressWidget.UpdateProgress
	void ReceiveUpdateProgress(float InProgress); // Function FSD.CoolDownProgressWidget.ReceiveUpdateProgress
	void ReceiveInitWidget(); // Function FSD.CoolDownProgressWidget.ReceiveInitWidget
	void Init(struct UObject* InCoolDownObject, struct FCoolDownProgressStyle InStyle); // Function FSD.CoolDownProgressWidget.Init
};

// Class FSD.PricingTier
// Size: 0x40 (Inherited: 0x30)
struct UPricingTier : UDataAsset {
	struct FString PriceKey; // 0x30(0x10)
};

// Class FSD.SchematicPricingTier
// Size: 0x40 (Inherited: 0x40)
struct USchematicPricingTier : UPricingTier {
};

// Class FSD.CreditsResourceData
// Size: 0xf0 (Inherited: 0xf0)
struct UCreditsResourceData : UResourceData {
};

// Class FSD.CritterManager
// Size: 0xf8 (Inherited: 0xb0)
struct UCritterManager : UActorComponent {
	bool DisableCritters; // 0xb0(0x01)
	char UnknownData_B1[0x3]; // 0xb1(0x03)
	float ActivationRange; // 0xb4(0x04)
	char UnknownData_B8[0x40]; // 0xb8(0x40)
};

// Class FSD.CrosshairWidget
// Size: 0x230 (Inherited: 0x230)
struct UCrosshairWidget : UUserWidget {

	void SetData(struct AItem* Item); // Function FSD.CrosshairWidget.SetData
};

// Class FSD.CrosshairAggregator
// Size: 0xe8 (Inherited: 0xc8)
struct UCrosshairAggregator : UItemAggregator {
	struct FMulticastInlineDelegate OnCrosshairCreated; // 0xc8(0x10)
	struct UUserWidget* CrosshairWidget; // 0xd8(0x08)
	struct UUserWidget* CrossHairType; // 0xe0(0x08)

	void SetCrosshair(struct UUserWidget* Widget); // Function FSD.CrosshairAggregator.SetCrosshair
	struct UUserWidget* GetOrCreateCrosshair(); // Function FSD.CrosshairAggregator.GetOrCreateCrosshair
};

// Class FSD.CryosprayItem
// Size: 0x818 (Inherited: 0x690)
struct ACryosprayItem : AAmmoDrivenWeapon {
	struct UProjectileLauncherComponent* ProjectileLauncher; // 0x690(0x08)
	struct UDamageComponent* DamageComponent; // 0x698(0x08)
	struct UStickyFlameSpawner* StickyFlames; // 0x6a0(0x08)
	struct UDamageComponent* AoEColdDamageComponent; // 0x6a8(0x08)
	struct UMotionAudioController* VelocityAudio; // 0x6b0(0x08)
	struct UParticleSystemComponent* FlameParticleComponent; // 0x6b8(0x08)
	bool PressurizedProjectileEnabled; // 0x6c0(0x01)
	char UnknownData_6C1[0x3]; // 0x6c1(0x03)
	float PressurizedProjectileDelay; // 0x6c4(0x04)
	int32_t PressurizeProjectileFullCost; // 0x6c8(0x04)
	char UnknownData_6CC[0xc]; // 0x6cc(0x0c)
	struct UParticleSystem* ChargeupParticles; // 0x6d8(0x08)
	struct UParticleSystemComponent* ChargeupParticleInstance; // 0x6e0(0x08)
	struct FDecalData ImpactDecal; // 0x6e8(0x18)
	float DecalDelay; // 0x700(0x04)
	char UnknownData_704[0x4]; // 0x704(0x04)
	struct UParticleSystem* ImpactParticles; // 0x708(0x08)
	struct UParticleSystemComponent* ImpactParticleInstance; // 0x710(0x08)
	struct TArray<struct FName> FlameParameterNames; // 0x718(0x10)
	float DamageSphereRadius; // 0x728(0x04)
	float MaxFlameDistance; // 0x72c(0x04)
	float FlameGrowthPerSecond; // 0x730(0x04)
	float friendlyFireModifier; // 0x734(0x04)
	float ChargeupTime; // 0x738(0x04)
	float ChargeDownTime; // 0x73c(0x04)
	char UnknownData_740[0x1]; // 0x740(0x01)
	bool IsCharging; // 0x741(0x01)
	char UnknownData_742[0x2]; // 0x742(0x02)
	float ChargeProgress; // 0x744(0x04)
	bool bRepressurerising; // 0x748(0x01)
	char UnknownData_749[0x3]; // 0x749(0x03)
	float RepressurerisingDoneAtPct; // 0x74c(0x04)
	float ChargeUpFadeOutTime; // 0x750(0x04)
	char UnknownData_754[0x4]; // 0x754(0x04)
	struct UAudioComponent* ChargeUpAudioComponent; // 0x758(0x08)
	float PressureTime; // 0x760(0x04)
	float PressureDropMultiplier; // 0x764(0x04)
	float PressureGainMultiplier; // 0x768(0x04)
	float CurrentPressure; // 0x76c(0x04)
	float RePressureDuration; // 0x770(0x04)
	float RePressureProgress; // 0x774(0x04)
	struct TArray<struct UItemUpgrade*> Upgrades; // 0x778(0x10)
	bool LongReachEnabled; // 0x788(0x01)
	char UnknownData_789[0xf]; // 0x789(0x0f)
	bool AoEColdEnabled; // 0x798(0x01)
	char UnknownData_799[0x7f]; // 0x799(0x7f)

	void ServerDoDamage(struct FVector_NetQuantize Start, struct FVector_NetQuantize End, char power); // Function FSD.CryosprayItem.ServerDoDamage
	void Server_TriggerAoECold(); // Function FSD.CryosprayItem.Server_TriggerAoECold
	void Server_PreLaunchProjectile(); // Function FSD.CryosprayItem.Server_PreLaunchProjectile
	void ReceiveRepressurisingChanged(bool Value); // Function FSD.CryosprayItem.ReceiveRepressurisingChanged
	void OnTargetDamaged(struct UHealthComponentBase* Health, float amount, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.CryosprayItem.OnTargetDamaged
	void OnRep_IsCharging(bool OldValue); // Function FSD.CryosprayItem.OnRep_IsCharging
	void OnProjectileSpawned(struct AProjectileBase* Projectile); // Function FSD.CryosprayItem.OnProjectileSpawned
	void OnProjectileLaunched(struct FVector Location); // Function FSD.CryosprayItem.OnProjectileLaunched
	void OnPressurizedPartileShoot(); // Function FSD.CryosprayItem.OnPressurizedPartileShoot
	void OnPreProjectileLaunch(); // Function FSD.CryosprayItem.OnPreProjectileLaunch
	void All_PreLaunchProjectile(); // Function FSD.CryosprayItem.All_PreLaunchProjectile
};

// Class FSD.CryoSprayAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UCryoSprayAnimInstance : UAnimInstance {
	struct ACryosprayItem* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ChargeProgress; // 0x274(0x04)
	struct FRotator ChargeRotation; // 0x278(0x0c)
	float ChargeBlend; // 0x284(0x04)
	float Pressure; // 0x288(0x04)
};

// Class FSD.CustomKeyBindingLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCustomKeyBindingLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.KeyBindingSettings
// Size: 0x50 (Inherited: 0x30)
struct UKeyBindingSettings : UDataAsset {
	struct TArray<struct FCustomKeySetting> KeyboardMouseButtons; // 0x30(0x10)
	struct TArray<struct FCustomKeySetting> ControllerButtons; // 0x40(0x10)
};

// Class FSD.CustomRichTextDecorator
// Size: 0x30 (Inherited: 0x28)
struct UCustomRichTextDecorator : URichTextBlockDecorator {
	struct URichTextBlock* RichTextBlock; // 0x28(0x08)
};

// Class FSD.DailyDealSettings
// Size: 0x40 (Inherited: 0x30)
struct UDailyDealSettings : UDataAsset {
	struct TArray<struct FDailyDealSetup> DailyDeals; // 0x30(0x10)

	bool IsDailyDealBought(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.IsDailyDealBought
	int32_t GetDailyDealSeed(); // Function FSD.DailyDealSettings.GetDailyDealSeed
	void GetDailyDeal(struct FDailyDeal outDeal); // Function FSD.DailyDealSettings.GetDailyDeal
	bool CanAffordDailyDeal(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.CanAffordDailyDeal
	bool BuyDailyDeal(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.BuyDailyDeal
};

// Class FSD.DamageAttackComponent
// Size: 0xf8 (Inherited: 0xf0)
struct UDamageAttackComponent : UAttackBaseComponent {
	struct UDamageComponent* Damage; // 0xf0(0x08)
};

// Class FSD.DamageBonusBase
// Size: 0x30 (Inherited: 0x30)
struct UDamageBonusBase : UDataAsset {

	struct UDamageBonusBase* AddDamageBonusToComponent(struct UDamageBonusBase* damageBonusClass, struct UDamageComponent* DamageComponent); // Function FSD.DamageBonusBase.AddDamageBonusToComponent
};

// Class FSD.FlatDamageBonus
// Size: 0x40 (Inherited: 0x30)
struct UFlatDamageBonus : UDamageBonusBase {
	float Damage; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
	struct UDamageClass* DamageClass; // 0x38(0x08)
};

// Class FSD.TargetSpecificDamageBonus
// Size: 0x88 (Inherited: 0x30)
struct UTargetSpecificDamageBonus : UDamageBonusBase {
	float Bonus; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
	struct FGameplayTagQuery tagQuery; // 0x38(0x48)
	struct FName Key; // 0x80(0x08)
};

// Class FSD.DamageConversionBonus
// Size: 0x40 (Inherited: 0x30)
struct UDamageConversionBonus : UDamageBonusBase {
	struct UDamageClass* DamageClass; // 0x30(0x08)
	float ConversionPercentage; // 0x38(0x04)
	bool DamageIsAdded; // 0x3c(0x01)
	char UnknownData_3D[0x3]; // 0x3d(0x03)
};

// Class FSD.TargetStateDamageBonus
// Size: 0x40 (Inherited: 0x30)
struct UTargetStateDamageBonus : UDamageBonusBase {
	enum class ETargetStateDamageBonusType TargetState; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	float Bonus; // 0x34(0x04)
	struct UDamageClass* DamageClass; // 0x38(0x08)
};

// Class FSD.StatusDamageBonus
// Size: 0x50 (Inherited: 0x30)
struct UStatusDamageBonus : UDamageBonusBase {
	struct TArray<struct UStatusEffect*> StatusEffects; // 0x30(0x10)
	float Bonus; // 0x40(0x04)
	char UnknownData_44[0x4]; // 0x44(0x04)
	struct UDamageClass* DamageClass; // 0x48(0x08)
};

// Class FSD.StatusAndStateDamageBonus
// Size: 0x60 (Inherited: 0x30)
struct UStatusAndStateDamageBonus : UDamageBonusBase {
	struct TArray<struct UStatusEffect*> StatusEffects; // 0x30(0x10)
	struct TArray<enum class ETargetStateDamageBonusType> TargetStates; // 0x40(0x10)
	float Bonus; // 0x50(0x04)
	char UnknownData_54[0x4]; // 0x54(0x04)
	struct UDamageClass* DamageClass; // 0x58(0x08)
};

// Class FSD.PushStatusEffectDamageBonus
// Size: 0x50 (Inherited: 0x30)
struct UPushStatusEffectDamageBonus : UDamageBonusBase {
	char UnknownData_30[0x10]; // 0x30(0x10)
	struct UStatusEffect* StatusEffect; // 0x40(0x08)
	float Chance; // 0x48(0x04)
	char UnknownData_4C[0x4]; // 0x4c(0x04)
};

// Class FSD.FearAoEBonus
// Size: 0x38 (Inherited: 0x30)
struct UFearAoEBonus : UDamageBonusBase {
	float FearFactor; // 0x30(0x04)
	float Range; // 0x34(0x04)
};

// Class FSD.AmmoLeftDamageBonus
// Size: 0x50 (Inherited: 0x40)
struct UAmmoLeftDamageBonus : UFlatDamageBonus {
	struct UCurveFloat* AmmoDamageCurve; // 0x40(0x08)
	char UnknownData_48[0x8]; // 0x48(0x08)
};

// Class FSD.AmmoUsedDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UAmmoUsedDamageBonus : UDamageBonusBase {
	float DamageBonusPerRoundFired; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// Class FSD.RandomDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct URandomDamageBonus : UDamageBonusBase {
	struct FRandRange RandomDamageRange; // 0x30(0x08)
};

// Class FSD.PercentDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UPercentDamageBonus : UDamageBonusBase {
	float DamageMultiplier; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// Class FSD.GatlingHotShellsBonus
// Size: 0x40 (Inherited: 0x40)
struct UGatlingHotShellsBonus : UDamageConversionBonus {
};

// Class FSD.BreakIceBonus
// Size: 0x38 (Inherited: 0x30)
struct UBreakIceBonus : UDamageBonusBase {
	float DeFrostAmount; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// Class FSD.KnockbackDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UKnockbackDamageBonus : UDamageBonusBase {
	float KnockBackHorizontalForce; // 0x30(0x04)
	float KnockBackVerticalForce; // 0x34(0x04)
};

// Class FSD.DamageClass
// Size: 0x50 (Inherited: 0x30)
struct UDamageClass : UDataAsset {
	struct UPawnStat* ResistanceStat; // 0x30(0x08)
	float RagdollScale; // 0x38(0x04)
	bool BypassesShield; // 0x3c(0x01)
	bool AffectedByFriendlyFire; // 0x3d(0x01)
	char UnknownData_3E[0x2]; // 0x3e(0x02)
	struct UTexture2D* IndicatorImage; // 0x40(0x08)
	struct UDialogDataAsset* DamageShout; // 0x48(0x08)
};

// Class FSD.DamageComponent
// Size: 0x160 (Inherited: 0xb0)
struct UDamageComponent : UActorComponent {
	struct FMulticastInlineDelegate OnTargetKilledEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnTargetDamagedEvent; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnNoTargetHitEvent; // 0xd0(0x10)
	char UnknownData_E0[0x4]; // 0xe0(0x04)
	enum class EDamageComponentType DamageComponentType; // 0xe4(0x01)
	char UnknownData_E5[0x3]; // 0xe5(0x03)
	float Damage; // 0xe8(0x04)
	float ArmorDamageMultiplier; // 0xec(0x04)
	struct UDamageClass* DamageClass; // 0xf0(0x08)
	float WeakpointDamageMultiplier; // 0xf8(0x04)
	float FrozenDamageBonusScale; // 0xfc(0x04)
	float friendlyFireModifier; // 0x100(0x04)
	struct FGameplayTag FriendlyFireTag; // 0x104(0x08)
	bool StaggerOnlyOnWeakpointHit; // 0x10c(0x01)
	char UnknownData_10D[0x3]; // 0x10d(0x03)
	float StaggerChance; // 0x110(0x04)
	float StaggerDuration; // 0x114(0x04)
	float FearFactor; // 0x118(0x04)
	char UnknownData_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct UDamageBonusBase*> DamageBonuses; // 0x120(0x10)
	bool UseAreaOfEffect; // 0x130(0x01)
	char UnknownData_131[0x3]; // 0x131(0x03)
	float RadialDamage; // 0x134(0x04)
	struct UDamageClass* RadialDamageClass; // 0x138(0x08)
	float MinDamagePct; // 0x140(0x04)
	float DamageRadius; // 0x144(0x04)
	float MaxDamageRadius; // 0x148(0x04)
	char UnknownData_14C[0x14]; // 0x14c(0x14)

	struct UDamageComponent* GetDamageComponentCDO(struct UDamageComponent* DamageComponent); // Function FSD.DamageComponent.GetDamageComponentCDO
	float GetDamage(); // Function FSD.DamageComponent.GetDamage
	void DamageTarget(struct AActor* Target, struct FVector Location, struct UPrimitiveComponent* HitComponent, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.DamageComponent.DamageTarget
	void DamageArmor_Server(struct AActor* Target, int32_t BoneIndex, struct FVector impactLocation); // Function FSD.DamageComponent.DamageArmor_Server
	void DamageArmor_All(struct AActor* Target, int32_t BoneIndex); // Function FSD.DamageComponent.DamageArmor_All
};

// Class FSD.DamageSettings
// Size: 0x100 (Inherited: 0x30)
struct UDamageSettings : UDataAsset {
	float TemperatureChangePerColdDamagePoint; // 0x30(0x04)
	float TemperatureChangePerIceDamagePoint; // 0x34(0x04)
	float TemperatureChangePerHeatDamagePoint; // 0x38(0x04)
	float TemperatureChangePerFireDamagePoint; // 0x3c(0x04)
	float TemperatureShockActivationWindow; // 0x40(0x04)
	float FrozenDamageBonus; // 0x44(0x04)
	struct UStatusEffect* EnemyOnFireStatusEffect; // 0x48(0x08)
	struct UStatusEffect* PlayerOnFireStatusEffect; // 0x50(0x08)
	struct UStatusEffect* TemperatureShockFromFrozenStatusEffect; // 0x58(0x08)
	struct UStatusEffect* TemperatureShockFromBurningStatusEffect; // 0x60(0x08)
	struct TArray<struct FDecalData> ImpactDecals; // 0x68(0x10)
	struct FRuntimeFloatCurve ArmorToArmorDamageBreakingCurve; // 0x78(0x88)
};

// Class FSD.DamageSubsystem
// Size: 0x40 (Inherited: 0x30)
struct UDamageSubsystem : UGameInstanceSubsystem {
	struct TArray<struct FDamageSubsystemItem> Items; // 0x30(0x10)
};

// Class FSD.DanceSettings
// Size: 0x40 (Inherited: 0x30)
struct UDanceSettings : UDataAsset {
	struct TArray<struct FDanceItem> DanceMoves; // 0x30(0x10)
};

// Class FSD.DashPoints
// Size: 0x1d0 (Inherited: 0xb0)
struct UDashPoints : UActorComponent {
	struct FMulticastInlineDelegate OnStartDashEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnStopDashEvent; // 0xc0(0x10)
	char UnknownData_D0[0xc]; // 0xd0(0x0c)
	struct FVector_NetQuantize DashLocation; // 0xdc(0x0c)
	char UnknownData_E8[0x10]; // 0xe8(0x10)
	struct FRuntimeFloatCurve DashSpeedCurve; // 0xf8(0x88)
	char UnknownData_180[0x18]; // 0x180(0x18)
	float PointOffset; // 0x198(0x04)
	float MaxRangeFromPlayer; // 0x19c(0x04)
	float MinRangeFromPlayer; // 0x1a0(0x04)
	float MinHeightAboveTarget; // 0x1a4(0x04)
	float MaxHeightAboveTarget; // 0x1a8(0x04)
	float safeReduction; // 0x1ac(0x04)
	float AcceptedDashradius; // 0x1b0(0x04)
	float DashSpeed; // 0x1b4(0x04)
	float SlowdownRadius; // 0x1b8(0x04)
	char UnknownData_1BC[0xc]; // 0x1bc(0x0c)
	int32_t IgnoreTheClosestPoints; // 0x1c8(0x04)
	enum class EDashPointsGenerationMode GenerationMode; // 0x1cc(0x01)
	bool IsDashing; // 0x1cd(0x01)
	bool IgnoreRules; // 0x1ce(0x01)
	char UnknownData_1CF[0x1]; // 0x1cf(0x01)

	void UpdateDashPointData(); // Function FSD.DashPoints.UpdateDashPointData
	void StopDashing(); // Function FSD.DashPoints.StopDashing
	void StartDashing(); // Function FSD.DashPoints.StartDashing
	void OnRep_Dashing(); // Function FSD.DashPoints.OnRep_Dashing
	void OnParentDeath(struct UHealthComponentBase* Health); // Function FSD.DashPoints.OnParentDeath
	struct FVector GetDashPoint(struct AActor* fromTarget, bool success); // Function FSD.DashPoints.GetDashPoint
};

// Class FSD.DeadStateComponent
// Size: 0x100 (Inherited: 0xf8)
struct UDeadStateComponent : UCharacterStateComponent {
	float RespawnDelay; // 0xf8(0x04)
	char UnknownData_FC[0x4]; // 0xfc(0x04)
};

// Class FSD.DealWidget
// Size: 0x230 (Inherited: 0x230)
struct UDealWidget : UUserWidget {

	void UpdateDealText(); // Function FSD.DealWidget.UpdateDealText
};

// Class FSD.FSDDebrisSettings
// Size: 0x68 (Inherited: 0x38)
struct UFSDDebrisSettings : UDeveloperSettings {
	struct FSoftObjectPath DefaultInfluencerDensityCurve; // 0x38(0x18)
	struct FSoftObjectPath DefaultInfluencerSizeCurve; // 0x50(0x18)
};

// Class FSD.CSGTriangleMapper
// Size: 0xd0 (Inherited: 0x30)
struct UCSGTriangleMapper : UDataAsset {
	bool Enabled; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct UTerrainMaterial* AttachToMaterial; // 0x38(0x08)
	struct TArray<struct UTerrainType*> AttachToTypes; // 0x40(0x10)
	int32_t CellCategories; // 0x50(0x04)
	float DensityInM2; // 0x54(0x04)
	float MinVerticalAngle; // 0x58(0x04)
	float MaxVerticalAngle; // 0x5c(0x04)
	struct FVector ScaleMin; // 0x60(0x0c)
	struct FVector ScaleMax; // 0x6c(0x0c)
	float ScaleBias; // 0x78(0x04)
	bool IndependentScaleAxes; // 0x7c(0x01)
	char UnknownData_7D[0x3]; // 0x7d(0x03)
	struct FVector BaseNormal; // 0x80(0x0c)
	float SurfaceNormalFactor; // 0x8c(0x04)
	struct FVector SurfaceNormalLimiter; // 0x90(0x0c)
	float RandomNormalFactor; // 0x9c(0x04)
	float RotationMinAngle; // 0xa0(0x04)
	float RotationMaxAngle; // 0xa4(0x04)
	float PosOffset; // 0xa8(0x04)
	float PosOffsetSurface; // 0xac(0x04)
	struct TArray<struct FCellNoise> NoiseLayers; // 0xb0(0x10)
	struct FDebrisCellNoiseParameters CellNoiseParameters; // 0xc0(0x10)
};

// Class FSD.DebrisBase
// Size: 0x1f8 (Inherited: 0xd0)
struct UDebrisBase : UCSGTriangleMapper {
	struct UObject* CaveInfluencer; // 0xd0(0x08)
	struct FRuntimeFloatCurve InfluencerDensityCurve; // 0xd8(0x88)
	struct FRuntimeFloatCurve InfluencerSizeCurve; // 0x160(0x88)
	struct UCurveFloat* CaveInfluenceCurve; // 0x1e8(0x08)
	struct UCurveFloat* CaveInflunceSizeCurve; // 0x1f0(0x08)
};

// Class FSD.DebrisCarved
// Size: 0x250 (Inherited: 0x1f8)
struct UDebrisCarved : UDebrisBase {
	enum class EDebrisCarvedType carverType; // 0x1f8(0x01)
	char UnknownData_1F9[0x7]; // 0x1f9(0x07)
	struct TArray<struct FUDebrisCarveMesh> Meshes; // 0x200(0x10)
	struct UTerrainMaterial* TerrainMaterial; // 0x210(0x08)
	struct FDebrisInfluence CaveInfluenceToAdd; // 0x218(0x10)
	enum class ECarveFilterType Filter; // 0x228(0x01)
	char UnknownData_229[0x3]; // 0x229(0x03)
	float ExpensiveNoise; // 0x22c(0x04)
	enum class CarveOptionsCellSize CarveCellSize; // 0x230(0x01)
	char UnknownData_231[0x3]; // 0x231(0x03)
	int32_t MinNumCarves; // 0x234(0x04)
	int32_t MaxNumCarves; // 0x238(0x04)
	float CarveOffsetRadius; // 0x23c(0x04)
	struct AActor* SpawnAttachClass; // 0x240(0x08)
	float AttachSpawnOffsetDistance; // 0x248(0x04)
	char UnknownData_24C[0x4]; // 0x24c(0x04)
};

// Class FSD.DebrisActorComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDebrisActorComponent : USceneComponent {
	char UnknownData_1F0[0x4]; // 0x1f0(0x04)
	bool Enabled; // 0x1f4(0x01)
	char UnknownData_1F5[0xb]; // 0x1f5(0x0b)
};

// Class FSD.DebrisItemComponent
// Size: 0x230 (Inherited: 0x200)
struct UDebrisItemComponent : UDebrisActorComponent {
	struct UDebrisPositioning* Debris; // 0x1f8(0x08)
	struct TArray<struct FDebrisItemActorItem> Actors; // 0x200(0x10)
	enum class EDebrisItemPass ItemPass; // 0x210(0x01)
	float InfluenceRange; // 0x214(0x04)
	float MinDistanceToImportantLocations; // 0x218(0x04)
	bool UseAmount; // 0x21c(0x01)
	struct FIRandRange amount; // 0x220(0x08)
	int32_t AmountSearchMultiplier; // 0x228(0x04)
	char UnknownData_22E[0x2]; // 0x22e(0x02)
};

// Class FSD.DebrisDataComponent
// Size: 0x200 (Inherited: 0x200)
struct UDebrisDataComponent : UDebrisActorComponent {
	struct UDebrisBase* Debris; // 0x1f8(0x08)
};

// Class FSD.DebrisVeinComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisVeinComponent : UDebrisActorComponent {
	struct UTerrainMaterial* Material; // 0x1f8(0x08)
	enum class EDebrisCarvedType carverType; // 0x200(0x01)
	struct UVeinResourceCreator* VeinCreator; // 0x208(0x08)
};

// Class FSD.DebrisPatchComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisPatchComponent : UDebrisActorComponent {
	struct UTerrainMaterial* Material; // 0x1f8(0x08)
	struct UPatchResourceCreator* PatchCreator; // 0x200(0x08)
};

// Class FSD.InfluencerComponent
// Size: 0x310 (Inherited: 0x200)
struct UInfluencerComponent : UDebrisActorComponent {
	struct FRuntimeFloatCurve ProbabilityCurve; // 0x1f8(0x88)
	struct FRuntimeFloatCurve ScaleCurve; // 0x280(0x88)
};

// Class FSD.DebrisProbabilityComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisProbabilityComponent : UDebrisActorComponent {
	struct FRandRange ProbabilityRange; // 0x1f8(0x08)
	bool IsProbabilityShared; // 0x200(0x01)
	char UnknownData_209[0x7]; // 0x209(0x07)
};

// Class FSD.DebrisDataActor
// Size: 0x238 (Inherited: 0x220)
struct ADebrisDataActor : AActor {
	char UnknownData_220[0x18]; // 0x220(0x18)
};

// Class FSD.DebrisInstances
// Size: 0x6e0 (Inherited: 0x620)
struct UDebrisInstances : UHierarchicalInstancedStaticMeshComponent {
	struct UDebrisBase* DebrisBase; // 0x618(0x08)
	int32_t DebrisIndex; // 0x624(0x04)
	char UnknownData_62C[0xb4]; // 0x62c(0xb4)
};

// Class FSD.DebrisMesh
// Size: 0x250 (Inherited: 0x1f8)
struct UDebrisMesh : UDebrisBase {
	struct TArray<struct FDebrisStaticMesh> Meshes; // 0x1f8(0x10)
	struct UMaterialInterface* CommonMaterial; // 0x208(0x08)
	struct FText InGameName; // 0x210(0x18)
	struct FName GemTrackerName; // 0x228(0x08)
	struct FText InGameDescription; // 0x230(0x18)
	float StartCullDistance; // 0x248(0x04)
	float EndCullDistance; // 0x24c(0x04)
};

// Class FSD.DebrisCellNoise
// Size: 0x58 (Inherited: 0x30)
struct UDebrisCellNoise : UDataAsset {
	int32_t Seed; // 0x30(0x04)
	struct FVector CellSize; // 0x34(0x0c)
	int32_t NumValues; // 0x40(0x04)
	struct FVector InvCellSize; // 0x44(0x0c)
	bool Initialized; // 0x50(0x01)
	char UnknownData_51[0x7]; // 0x51(0x07)
};

// Class FSD.DebrisPositioning
// Size: 0x1f8 (Inherited: 0x1f8)
struct UDebrisPositioning : UDebrisBase {
};

// Class FSD.DebrisSet
// Size: 0x40 (Inherited: 0x30)
struct UDebrisSet : UDataAsset {
	struct TArray<struct TSoftObjectPtr<struct UDebrisBase>> Debris; // 0x30(0x10)
};

// Class FSD.DebrisStaticCarved
// Size: 0x240 (Inherited: 0x1f8)
struct UDebrisStaticCarved : UDebrisBase {
	enum class EDebrisCarvedType carverType; // 0x1f8(0x01)
	char UnknownData_1F9[0x7]; // 0x1f9(0x07)
	struct TArray<struct FUDebrisStaticCarveMesh> Meshes; // 0x200(0x10)
	struct UTerrainMaterial* TerrainMaterial; // 0x210(0x08)
	struct FDebrisInfluence CaveInfluenceToAdd; // 0x218(0x10)
	enum class ECarveFilterType Filter; // 0x228(0x01)
	char UnknownData_229[0x3]; // 0x229(0x03)
	float CarveOffsetRadius; // 0x22c(0x04)
	struct AActor* SpawnAttachClass; // 0x230(0x08)
	float AttachSpawnOffsetDistance; // 0x238(0x04)
	char UnknownData_23C[0x4]; // 0x23c(0x04)
};

// Class FSD.CustomItemPlacementHandling
// Size: 0x28 (Inherited: 0x28)
struct UCustomItemPlacementHandling : UInterface {
};

// Class FSD.InfluencerSpawnComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UInfluencerSpawnComponent : USceneComponent {
	struct UCaveInfluencer* Influencer; // 0x1f0(0x08)
	float Range; // 0x1f8(0x04)
	char UnknownData_1FC[0x4]; // 0x1fc(0x04)
};

// Class FSD.DecalManager
// Size: 0xb0 (Inherited: 0xb0)
struct UDecalManager : UActorComponent {

	void SpawnDecal(struct FVector Location, struct FVector Normal, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.DecalManager.SpawnDecal
};

// Class FSD.DeepCSGWorld
// Size: 0x810 (Inherited: 0x220)
struct ADeepCSGWorld : AActor {
	char UnknownData_220[0x8]; // 0x220(0x08)
	struct UTerrainMaterial* DebugCarveInsideTerrainMaterial; // 0x228(0x08)
	struct UTerrainMaterial* DebugCarveOutsizeTerrainMaterial; // 0x230(0x08)
	struct UTerrainMaterial* DebugCarveEdgeTerrainMaterial; // 0x238(0x08)
	struct UTerrainMaterial* GoldTerrainMaterial; // 0x240(0x08)
	struct UTerrainMaterial* MOMTerrrainMaterial; // 0x248(0x08)
	struct UTerrainMaterial* NitraTerrrainMaterial; // 0x250(0x08)
	struct UTerrainMaterial* EmptyTerrainMaterial; // 0x258(0x08)
	struct UTerrainMaterial* DefaultBurntTerrainMaterial; // 0x260(0x08)
	struct UTerrainMaterial* DefaultHardRockMaterial; // 0x268(0x08)
	struct UTerrainMaterial* DefaultBedRockMaterial; // 0x270(0x08)
	struct UTerrainType* GoldTerrainType; // 0x278(0x08)
	struct UTerrainType* MOMTerrainType; // 0x280(0x08)
	struct UTerrainType* RockTerrainType; // 0x288(0x08)
	struct UTerrainType* CrystalTerrainType; // 0x290(0x08)
	struct UTerrainType* EmptyTerrainType; // 0x298(0x08)
	struct UTerrainType* DirtTerrainType; // 0x2a0(0x08)
	struct UTerrainType* DefaultBurntTerrainType; // 0x2a8(0x08)
	struct UTerrainMaterialsCollection* TerrainMaterials; // 0x2b0(0x08)
	struct TArray<struct UDebrisSet*> StandardDebrisSets; // 0x2b8(0x10)
	struct TArray<struct UDebrisBase*> AddedDebris; // 0x2c8(0x10)
	struct TArray<struct UDebrisBase*> DebrisLevelGenerationCarved; // 0x2d8(0x10)
	struct TArray<struct UDebrisBase*> DebrisLargeCarved; // 0x2e8(0x10)
	struct TArray<struct UDebrisBase*> DebrisSmallCarved; // 0x2f8(0x10)
	struct TArray<struct UDebrisBase*> DebrisMeshes; // 0x308(0x10)
	struct UMaterialInterface* DefaultScannerMaterial; // 0x318(0x08)
	struct ADebrisDataActor* DebrisActorInstance; // 0x320(0x08)
	int32_t DebrisActorIndex; // 0x328(0x04)
	char UnknownData_32C[0x4]; // 0x32c(0x04)
	struct AProceduralSetup* ProceduralSetup; // 0x330(0x08)
	struct TArray<struct UObject*> TerrainMaterialAssets; // 0x338(0x10)
	char UnknownData_348[0x38]; // 0x348(0x38)
	struct UAsyncPathRequests* AsyncPathRequests; // 0x380(0x08)
	struct FMulticastInlineDelegate OnBaseLayerCommitDone; // 0x388(0x10)
	struct FMulticastInlineDelegate OnBaseLayerFinalCommitDone; // 0x398(0x10)
	struct TArray<struct AActor*> TerrainAttachedActors; // 0x3a8(0x10)
	struct TArray<struct FWeakObjectPtr<struct UObject>> TerrainListeners; // 0x3b8(0x10)
	struct TArray<struct UDebrisBase*> RegisteredDebrisList; // 0x3c8(0x10)
	struct TArray<struct FDebrisWhenCarving> DebrisWhenCarvingList; // 0x3d8(0x10)
	struct TArray<struct UDebrisInstances*> DebrisInstanceList; // 0x3e8(0x10)
	struct TArray<struct FWeakObjectPtr<struct UPrimitiveComponent>> ShowAlwaysScannerComponents; // 0x3f8(0x10)
	struct TArray<struct FWeakObjectPtr<struct UPrimitiveComponent>> FogOfWarScannerComponents; // 0x408(0x10)
	struct TArray<struct UDebrisBase*> DebrisHandles; // 0x418(0x10)
	char UnknownData_428[0x2c0]; // 0x428(0x2c0)
	struct FTerrainLateJoinData LateJoinData; // 0x6e8(0xa8)
	struct TArray<struct FEncodedChunkId> visibleChunks; // 0x790(0x10)
	char UnknownData_7A0[0x70]; // 0x7a0(0x70)

	void UnRegisterScannerComponent(struct UPrimitiveComponent* Component); // Function FSD.DeepCSGWorld.UnRegisterScannerComponent
	void TerrainOp_RemoveFloating(struct FRemoveFloatingIslandOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_RemoveFloating
	void TerrainOp_PickAxe(struct FPickaxeDigOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_PickAxe
	void TerrainOp_Melt(struct FMeltOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_Melt
	void TerrainOp_Explode(struct FGrenadeExplodeOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_Explode
	void TerrainOp_Drill(struct FDrillOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_Drill
	void TerrainOp_CarveSTLMesh(struct FCarveWithSTLMeshOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_CarveSTLMesh
	void TerrainOp_CarveSplineSegment(struct FSplineSegmentCarveOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_CarveSplineSegment
	void TerrainOp_CarveCollider(struct FCarveWithColliderOperationData Data); // Function FSD.DeepCSGWorld.TerrainOp_CarveCollider
	void TerrainMaterialDataLoaded(); // Function FSD.DeepCSGWorld.TerrainMaterialDataLoaded
	void SetVisibleToScanner(struct FVector Center, struct FVector Range); // Function FSD.DeepCSGWorld.SetVisibleToScanner
	void SelectDebrisSettings(); // Function FSD.DeepCSGWorld.SelectDebrisSettings
	void ResetEntireWorld(); // Function FSD.DeepCSGWorld.ResetEntireWorld
	void RemoveDebrisInstance_TerrainOp2(int32_t instance, int32_t Component); // Function FSD.DeepCSGWorld.RemoveDebrisInstance_TerrainOp2
	void RemoveDebrisInSphere(struct FVector Position, float Radius, bool onlyFragile, bool alsoDurable); // Function FSD.DeepCSGWorld.RemoveDebrisInSphere
	void RegisterScannerComponent(struct UPrimitiveComponent* Component, bool useFogOfWar); // Function FSD.DeepCSGWorld.RegisterScannerComponent
	bool Raycast(struct FVector Start, struct FVector Direction, float MaxDistance, struct FCSGRaycastHitInfo HitInfo, enum class ELandscapeCellFilter Filter); // Function FSD.DeepCSGWorld.Raycast
	bool Linecast(struct FVector Start, struct FVector End, struct FCSGRaycastHitInfo HitInfo, enum class ELandscapeCellFilter Filter); // Function FSD.DeepCSGWorld.Linecast
	bool IsPositionVisibleToScanner(struct FVector Pos); // Function FSD.DeepCSGWorld.IsPositionVisibleToScanner
	bool IsPointInsideTerrain(struct FVector Pos); // Function FSD.DeepCSGWorld.IsPointInsideTerrain
	bool IsComponentRegisteredWithScanner(struct UPrimitiveComponent* Component); // Function FSD.DeepCSGWorld.IsComponentRegisteredWithScanner
	int32_t GetTerrainHash(); // Function FSD.DeepCSGWorld.GetTerrainHash
	int32_t GetShadowQuality(); // Function FSD.DeepCSGWorld.GetShadowQuality
	struct ADebrisDataActor* GetDebrisDataActor(); // Function FSD.DeepCSGWorld.GetDebrisDataActor
	void GetAllTerrainActorsAroundPoint(struct FVector Center, struct FVector Range, struct TArray<struct AActor*> TerrainActors); // Function FSD.DeepCSGWorld.GetAllTerrainActorsAroundPoint
	void GenerateAllMeshes(); // Function FSD.DeepCSGWorld.GenerateAllMeshes
	void FinishGeneration_Blocking(); // Function FSD.DeepCSGWorld.FinishGeneration_Blocking
	float FindTotalVolumeOfMaterialInWorld(struct UTerrainMaterial* Material); // Function FSD.DeepCSGWorld.FindTotalVolumeOfMaterialInWorld
	void CarveWithSTLMeshUsingTransform_Wait(struct ADeepCSGWorld* CSGWorld, struct USTLMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, enum class EPreciousMaterialOptions Precious, struct FLatentActionInfo LatentInfo); // Function FSD.DeepCSGWorld.CarveWithSTLMeshUsingTransform_Wait
	void CarveWithSTLMeshUsingTransform(struct USTLMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithSTLMeshUsingTransform
	void CarveWithSTLMesh_Wait(struct ADeepCSGWorld* CSGWorld, struct USTLMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FVector Pos, struct FQuat Orientation, struct FVector Scale, enum class EPreciousMaterialOptions Precious, struct FLatentActionInfo LatentInfo); // Function FSD.DeepCSGWorld.CarveWithSTLMesh_Wait
	void CarveWithSTLMesh(struct USTLMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FVector Pos, struct FQuat Orientation, struct FVector Scale, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithSTLMesh
	void CarveWithStaticMeshUsingTransform_Wait(struct ADeepCSGWorld* CSGWorld, struct UStaticMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, enum class EPreciousMaterialOptions Precious, struct FLatentActionInfo LatentInfo); // Function FSD.DeepCSGWorld.CarveWithStaticMeshUsingTransform_Wait
	void CarveWithStaticMeshUsingTransform(struct UStaticMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithStaticMeshUsingTransform
	void CarveWithStaticMesh(struct UStaticMeshCarver* MeshCarver, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FVector Pos, struct FQuat Orientation, struct FVector Scale, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithStaticMesh
	void CarveWithSplineSegments(struct TArray<struct FCarveSplineSegment> Segments, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithSplineSegments
	void CarveWithSplineSegment(struct FVector SplineStart, struct FVector SplineStartTangent, struct FVector SplineEnd, struct FVector SplineEndTangent, float Radius, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithSplineSegment
	void CarveWithMeshUsingTransform_Wait(struct ADeepCSGWorld* CSGWorld, struct UStaticMesh* StaticMesh, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, float ExpensiveNoise, enum class EPreciousMaterialOptions Precious, struct FLatentActionInfo LatentInfo); // Function FSD.DeepCSGWorld.CarveWithMeshUsingTransform_Wait
	void CarveWithMeshUsingTransform(struct UStaticMesh* StaticMesh, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FTransform Transform, float ExpensiveNoise, enum class EPreciousMaterialOptions Precious, enum class CarveOptionsCellSize CarverSize); // Function FSD.DeepCSGWorld.CarveWithMeshUsingTransform
	void CarveWithMesh_Wait(struct ADeepCSGWorld* CSGWorld, struct UStaticMesh* StaticMesh, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FVector Pos, struct FQuat Orientation, struct FVector Scale, struct FLatentActionInfo LatentInfo); // Function FSD.DeepCSGWorld.CarveWithMesh_Wait
	void CarveWithMesh(struct UStaticMesh* StaticMesh, struct UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, struct FVector Pos, struct FQuat Orientation, struct FVector Scale, enum class EPreciousMaterialOptions Precious); // Function FSD.DeepCSGWorld.CarveWithMesh
	float CalcApproximateTerrainDensity(struct FVector Pos, float Radius); // Function FSD.DeepCSGWorld.CalcApproximateTerrainDensity
	void BaseLayerCommitFinal(bool blocking); // Function FSD.DeepCSGWorld.BaseLayerCommitFinal
	void BaseLayerCommit(bool blocking, bool scheduleTesselation); // Function FSD.DeepCSGWorld.BaseLayerCommit
	void AttachActorToTerrain(struct AActor* Actor, struct FVector Pos); // Function FSD.DeepCSGWorld.AttachActorToTerrain
	void ApplyDebrisCarvers(); // Function FSD.DeepCSGWorld.ApplyDebrisCarvers
	void ApplyBaseDebrisCarvers(struct TArray<struct UDebrisBase*> Carvers); // Function FSD.DeepCSGWorld.ApplyBaseDebrisCarvers
};

// Class FSD.SavableDataAsset
// Size: 0x58 (Inherited: 0x30)
struct USavableDataAsset : UDataAsset {
	char UnknownData_30[0x8]; // 0x30(0x08)
	bool EnableDangerousSaveGameIDEditing; // 0x38(0x01)
	char UnknownData_39[0x3]; // 0x39(0x03)
	struct FGuid SavegameID; // 0x3c(0x10)
	char UnknownData_4C[0x4]; // 0x4c(0x04)
	struct UBuildRestriction* BuildRestriction; // 0x50(0x08)

	struct FGuid GetSavegameID(); // Function FSD.SavableDataAsset.GetSavegameID
};

// Class FSD.DeepDiveTemplate
// Size: 0xc0 (Inherited: 0x58)
struct UDeepDiveTemplate : USavableDataAsset {
	struct TArray<struct UDifficultySetting*> Difficulties; // 0x58(0x10)
	struct TArray<struct FDeepDiveTemplateItem> missions; // 0x68(0x10)
	struct TArray<enum class ESchematicType> Rewards; // 0x78(0x10)
	int32_t CreditsPerPrimaryObjective; // 0x88(0x04)
	int32_t CreditsPerSecondaryObjective; // 0x8c(0x04)
	int32_t XPPerPrimaryObjective; // 0x90(0x04)
	int32_t XPPerSecondaryObjective; // 0x94(0x04)
	float HazardBonus; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
	struct FRandInterval MutatorCount; // 0xa0(0x10)
	struct FRandInterval WarningCount; // 0xb0(0x10)

	enum class ESchematicType GetStageRewardType(int32_t StageIndex); // Function FSD.DeepDiveTemplate.GetStageRewardType
};

// Class FSD.DeepDiveSettings
// Size: 0x98 (Inherited: 0x30)
struct UDeepDiveSettings : UDataAsset {
	struct UDeepDiveTemplate* NormalTemplate; // 0x30(0x08)
	struct UDeepDiveTemplate* HardTemplate; // 0x38(0x08)
	struct TArray<struct UMutator*> BaseMutators; // 0x40(0x10)
	struct TArray<struct UMissionMutator*> Mutators; // 0x50(0x10)
	struct TArray<struct UMissionWarning*> Warnings; // 0x60(0x10)
	struct TArray<struct UDialogDataAsset*> DeepDiveMissionCompleteShouts; // 0x70(0x10)
	struct TArray<struct FDeepDiveLoaderSequence> LoaderSequnces; // 0x80(0x10)
	struct UMissionNameBank* DeepDiveNameBank; // 0x90(0x08)
};

// Class FSD.DeepDiveFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UDeepDiveFunctionLibrary : UBlueprintFunctionLibrary {

	bool IsDeepDiveElite(struct UObject* WorldContextObject, struct UDeepDive* DeepDive); // Function FSD.DeepDiveFunctionLibrary.IsDeepDiveElite
	bool GetHasEverCompletedDeepDive(struct UObject* WorldContextObject, struct UDeepDiveTemplate* DeepDive); // Function FSD.DeepDiveFunctionLibrary.GetHasEverCompletedDeepDive
};

// Class FSD.DeepDiveManager
// Size: 0xd8 (Inherited: 0x28)
struct UDeepDiveManager : UObject {
	struct FMulticastInlineDelegate OnDeepDivesRefresh; // 0x28(0x10)
	struct UDeepDive* ActiveNormalDeepDive; // 0x38(0x08)
	struct UDeepDive* ActiveHardDeepDive; // 0x40(0x08)
	struct UDeepDive* ActiveDeepDive; // 0x48(0x08)
	struct UGeneratedMission* CurrentMission; // 0x50(0x08)
	char UnknownData_58[0x4]; // 0x58(0x04)
	float currentDepth; // 0x5c(0x04)
	struct TMap<int32_t, struct FDeepDiveBank> DeepDiveBank; // 0x60(0x50)
	int32_t NumFailedRequests; // 0xb0(0x04)
	int32_t BackendDataValid; // 0xb4(0x04)
	int32_t BackendSeed; // 0xb8(0x04)
	bool LockSeed; // 0xbc(0x01)
	char UnknownData_BD[0x3]; // 0xbd(0x03)
	struct FDateTime BackendExpirationTime; // 0xc0(0x08)
	struct FDateTime LastRequestTime; // 0xc8(0x08)
	char UnknownData_D0[0x8]; // 0xd0(0x08)

	void StartDeepDive(struct UDeepDive* DeepDive); // Function FSD.DeepDiveManager.StartDeepDive
	void ReInitialize(); // Function FSD.DeepDiveManager.ReInitialize
	void MarkGivenRewards(); // Function FSD.DeepDiveManager.MarkGivenRewards
	bool IsEliteDeepDive(struct UGeneratedMission* mission); // Function FSD.DeepDiveManager.IsEliteDeepDive
	struct UDeepDive* GetDeepDiveFromMission(struct UGeneratedMission* mission); // Function FSD.DeepDiveManager.GetDeepDiveFromMission
	struct UGeneratedMission* GetCurrentSingleMission(); // Function FSD.DeepDiveManager.GetCurrentSingleMission
	int32_t GetCurrentDeepDiveStage(); // Function FSD.DeepDiveManager.GetCurrentDeepDiveStage
	struct UDeepDive* GetActiveNormalDeepDive(); // Function FSD.DeepDiveManager.GetActiveNormalDeepDive
	struct UDeepDive* GetActiveHardDeepDive(); // Function FSD.DeepDiveManager.GetActiveHardDeepDive
	struct UDeepDive* GetActiveDeepDive(); // Function FSD.DeepDiveManager.GetActiveDeepDive
	void DeepDiveRefreshDelegate__DelegateSignature(); // DelegateFunction FSD.DeepDiveManager.DeepDiveRefreshDelegate__DelegateSignature
	bool CompleteCurrentSingleMission(); // Function FSD.DeepDiveManager.CompleteCurrentSingleMission
	bool AreAllSelectedClassesQualified(); // Function FSD.DeepDiveManager.AreAllSelectedClassesQualified
};

// Class FSD.DeepDive
// Size: 0x98 (Inherited: 0x28)
struct UDeepDive : UObject {
	struct TArray<struct UGeneratedMission*> missions; // 0x28(0x10)
	struct UBiome* Biome; // 0x38(0x08)
	struct TArray<struct FDeepDiveRewardItem> GivenRewards; // 0x40(0x10)
	int32_t MissionsCompleted; // 0x50(0x04)
	char UnknownData_54[0x4]; // 0x54(0x04)
	struct TArray<int32_t> StagesCompleted; // 0x58(0x10)
	int32_t CurrentMissionIndex; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
	struct UDeepDiveTemplate* Template; // 0x70(0x08)
	struct FText DeepDiveName; // 0x78(0x18)
	int32_t BestTime; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)

	bool IsCompleted(); // Function FSD.DeepDive.IsCompleted
	bool HasCompletedStage(int32_t StageIndex); // Function FSD.DeepDive.HasCompletedStage
	struct FDeepDiveRewardItem GetGivenRewardAtStage(int32_t StageIndex); // Function FSD.DeepDive.GetGivenRewardAtStage
};

// Class FSD.AsyncPathRequestsInterface
// Size: 0x28 (Inherited: 0x28)
struct UAsyncPathRequestsInterface : UInterface {
};

// Class FSD.AsyncPathRequests
// Size: 0xc8 (Inherited: 0xb0)
struct UAsyncPathRequests : UActorComponent {
	struct TArray<struct FWeakObjectPtr<struct UObject>> RequestListeners; // 0xb0(0x10)
	char UnknownData_C0[0x8]; // 0xc0(0x08)
};

// Class FSD.DeepPathfinderSceneComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDeepPathfinderSceneComponent : USceneComponent {
	char UnknownData_1F0[0x10]; // 0x1f0(0x10)
};

// Class FSD.DeepPathfinderMovement
// Size: 0x428 (Inherited: 0x138)
struct UDeepPathfinderMovement : UPawnMovementComponent {
	char UnknownData_138[0x8]; // 0x138(0x08)
	bool UseDormancy; // 0x140(0x01)
	char UnknownData_141[0x3]; // 0x141(0x03)
	float MaxPawnSpeed; // 0x144(0x04)
	float StrafeSpeed; // 0x148(0x04)
	float MinSlowdownAngle; // 0x14c(0x04)
	float MaxSlowdownAngle; // 0x150(0x04)
	float MaxStrafeDistance; // 0x154(0x04)
	float AlignDirectionSpeed; // 0x158(0x04)
	float FleeSpeedBoostMultiplier; // 0x15c(0x04)
	float MaxAcceleration; // 0x160(0x04)
	float MaxBrakingDeceleration; // 0x164(0x04)
	float AngleSpeedFilterFactor; // 0x168(0x04)
	uint32_t AIAvoidanceWeight; // 0x16c(0x04)
	enum class DeepPathFinderType PathfinderType; // 0x170(0x01)
	enum class DeepPathFinderSize PathfinderSize; // 0x171(0x01)
	enum class ETeleportType MovementPhysicsType; // 0x172(0x01)
	enum class DeepPathFinderPreference PathfinderPreference; // 0x173(0x01)
	bool AlignTowardsTargetIfStationary; // 0x174(0x01)
	char UnknownData_175[0x3]; // 0x175(0x03)
	float AlignToTargetMinRequiredAngle; // 0x178(0x04)
	bool AllowSlowTickRateWhenNotVisible; // 0x17c(0x01)
	bool ForceAPathIfNoneFound; // 0x17d(0x01)
	bool DrawServerPath; // 0x17e(0x01)
	char UnknownData_17F[0x1]; // 0x17f(0x01)
	struct FMulticastInlineDelegate OnPathBegin; // 0x180(0x10)
	struct FMulticastInlineDelegate OnPauseMovementElapsed; // 0x190(0x10)
	struct FMulticastInlineDelegate OnPathFinished; // 0x1a0(0x10)
	struct FMulticastInlineDelegate OnRefreshDestination; // 0x1b0(0x10)
	struct FMulticastInlineDelegate OnStateChanged; // 0x1c0(0x10)
	char UnknownData_1D0[0x28]; // 0x1d0(0x28)
	struct ADeepCSGWorld* CSGWorld; // 0x1f8(0x08)
	uint32_t PathMovedDist; // 0x200(0x04)
	uint32_t LocalPathMovedDist; // 0x204(0x04)
	struct FDeepRepPath Path; // 0x208(0xd0)
	struct UFakeMoverSettings* MoveSettings; // 0x2d8(0x08)
	struct AActor* TargetActor; // 0x2e0(0x08)
	int32_t CurrentPathIndex; // 0x2e8(0x04)
	float CurrentPathFraction; // 0x2ec(0x04)
	struct FVector Destination; // 0x2f0(0x0c)
	char UnknownData_2FC[0x4]; // 0x2fc(0x04)
	struct AActor* DestinationActor; // 0x300(0x08)
	float AcceptanceRadius; // 0x308(0x04)
	bool OnlyPartPath; // 0x30c(0x01)
	char UnknownData_30D[0x3]; // 0x30d(0x03)
	float PauseMovementTime; // 0x310(0x04)
	enum class EDeepMovementMode MoveMode; // 0x314(0x01)
	char UnknownData_315[0x3]; // 0x315(0x03)
	struct UPawnStatsComponent* PawnStats; // 0x318(0x08)
	char UnknownData_320[0xc]; // 0x320(0x0c)
	struct FVector LastForwardDir; // 0x32c(0x0c)
	float VerticalAngleSpeed; // 0x338(0x04)
	float HorizontalAngleSpeed; // 0x33c(0x04)
	bool IsStrafing; // 0x340(0x01)
	bool HasOustandingPathRequest; // 0x341(0x01)
	bool LastPathReachedPreciseDestination; // 0x342(0x01)
	char UnknownData_343[0x25]; // 0x343(0x25)
	float PostponedTickTime; // 0x368(0x04)
	bool LastMoveSuccessful; // 0x36c(0x01)
	bool HandleRotation; // 0x36d(0x01)
	struct FHandleRotationOptions HandleRotationOptions; // 0x36e(0x01)
	char UnknownData_36F[0x19]; // 0x36f(0x19)
	struct FVector UnfilteredPosition; // 0x388(0x0c)
	struct FVector LastDestPosUsed; // 0x394(0x0c)
	float DampOmega; // 0x3a0(0x04)
	bool UseMovementSpring; // 0x3a4(0x01)
	bool SnapToPathfinderOnFirstMove; // 0x3a5(0x01)
	char UnknownData_3A6[0x2]; // 0x3a6(0x02)
	struct FFakeMoverState FakePhysicsMove; // 0x3a8(0x60)
	float FakeSyncTime; // 0x408(0x04)
	char UnknownData_40C[0x1c]; // 0x40c(0x1c)

	void UpdateTargetActor(struct AActor* NewTarget); // Function FSD.DeepPathfinderMovement.UpdateTargetActor
	void UpdateDestination(struct FVector Dest); // Function FSD.DeepPathfinderMovement.UpdateDestination
	void UnPauseMovement(); // Function FSD.DeepPathfinderMovement.UnPauseMovement
	void TeleportTo(struct FVector destLoc, struct FRotator destRot); // Function FSD.DeepPathfinderMovement.TeleportTo
	void StopMove(); // Function FSD.DeepPathfinderMovement.StopMove
	void StopAttackStance(); // Function FSD.DeepPathfinderMovement.StopAttackStance
	bool StartMoveToActor(struct AActor* Dest, float AcceptanceRadius); // Function FSD.DeepPathfinderMovement.StartMoveToActor
	bool StartMoveTo(struct FVector Dest, float AcceptanceRadius); // Function FSD.DeepPathfinderMovement.StartMoveTo
	bool StartFleeFrom(struct FVector dangerPos, float Distance); // Function FSD.DeepPathfinderMovement.StartFleeFrom
	void StartFakePhysicsMoveSet(struct UFakeMoverSettings* MoveSettings); // Function FSD.DeepPathfinderMovement.StartFakePhysicsMoveSet
	void StartFakePhysics(struct FVector Vel); // Function FSD.DeepPathfinderMovement.StartFakePhysics
	void StartAttackStance(struct FVector stancePos); // Function FSD.DeepPathfinderMovement.StartAttackStance
	void SnapToPathfinder(); // Function FSD.DeepPathfinderMovement.SnapToPathfinder
	void SetSlowDownAngles(float Min, float Max); // Function FSD.DeepPathfinderMovement.SetSlowDownAngles
	void SetMaxSpeed(float Speed); // Function FSD.DeepPathfinderMovement.SetMaxSpeed
	void SetHandleRotation(bool flag); // Function FSD.DeepPathfinderMovement.SetHandleRotation
	void SetFreezeAlignment(bool Freeze); // Function FSD.DeepPathfinderMovement.SetFreezeAlignment
	void SetControlledExternally(bool controlled); // Function FSD.DeepPathfinderMovement.SetControlledExternally
	void PauseMovement(float Time); // Function FSD.DeepPathfinderMovement.PauseMovement
	bool PathExistTo(struct FVector Dest); // Function FSD.DeepPathfinderMovement.PathExistTo
	bool PathExistsBetween(struct FVector From, struct FVector to); // Function FSD.DeepPathfinderMovement.PathExistsBetween
	void OnRep_PathMovedDist(uint32_t lastPathMovedDist); // Function FSD.DeepPathfinderMovement.OnRep_PathMovedDist
	void OnRep_Path(struct FDeepRepPath oldPath); // Function FSD.DeepPathfinderMovement.OnRep_Path
	void OnRep_MoveSettings(struct UFakeMoverSettings* MoveSettings); // Function FSD.DeepPathfinderMovement.OnRep_MoveSettings
	bool IsFreezeAlignmentSet(); // Function FSD.DeepPathfinderMovement.IsFreezeAlignmentSet
	float GetVerticalAngleSpeed(); // Function FSD.DeepPathfinderMovement.GetVerticalAngleSpeed
	void GetRandomSpawnPointAtApproximateDistance_Async(struct FVector Origin, float Distance, bool success, struct FVector outPos, struct FLatentActionInfo LatentInfo); // Function FSD.DeepPathfinderMovement.GetRandomSpawnPointAtApproximateDistance_Async
	void GetRandomReachablePointAtApproximateDistance_Async(struct FVector Origin, float Distance, bool success, struct FVector outPos, struct FLatentActionInfo LatentInfo); // Function FSD.DeepPathfinderMovement.GetRandomReachablePointAtApproximateDistance_Async
	bool GetRandomReachablePointAtApproximateDistance(struct FVector Origin, float Distance, struct FVector outPos); // Function FSD.DeepPathfinderMovement.GetRandomReachablePointAtApproximateDistance
	struct FVector GetPathForwardDirection(); // Function FSD.DeepPathfinderMovement.GetPathForwardDirection
	enum class DeepPathFinderType GetPathfinderType(); // Function FSD.DeepPathfinderMovement.GetPathfinderType
	enum class DeepPathFinderSize GetPathfinderSize(); // Function FSD.DeepPathfinderMovement.GetPathfinderSize
	enum class EDeepMovementState GetMovementState(); // Function FSD.DeepPathfinderMovement.GetMovementState
	bool GetIsStrafing(); // Function FSD.DeepPathfinderMovement.GetIsStrafing
	float GetHorizontalAngleSpeed(); // Function FSD.DeepPathfinderMovement.GetHorizontalAngleSpeed
	struct UFakeMoverSettings* GetCurrentFakePhysicsMoveSet(); // Function FSD.DeepPathfinderMovement.GetCurrentFakePhysicsMoveSet
	bool FlyToConnectedPosition(struct FVector destPos); // Function FSD.DeepPathfinderMovement.FlyToConnectedPosition
	bool FindPointKeepingDistance(struct FVector Origin, float MinDistance, float MaxDistance, struct FVector Target, float idealTargetDistance, struct FVector outPos); // Function FSD.DeepPathfinderMovement.FindPointKeepingDistance
	struct FVector FindPathfinderPointAbove(struct FVector Pos, float HeightOffset); // Function FSD.DeepPathfinderMovement.FindPathfinderPointAbove
	struct FVector FindPathfinderOffsetPoint(struct FVector Pos, enum class EOffsetFrom offsetFrom, float HeightOffset); // Function FSD.DeepPathfinderMovement.FindPathfinderOffsetPoint
	struct FVector FindNearestPathfinderPointOverrideType(struct FVector Pos, enum class DeepPathFinderType overrideType, float MaxDistance); // Function FSD.DeepPathfinderMovement.FindNearestPathfinderPointOverrideType
	void FindNearestPathfinderPoint_Async(struct FVector Pos, float MaxDistance, bool success, struct FVector outPos, struct FLatentActionInfo LatentInfo); // Function FSD.DeepPathfinderMovement.FindNearestPathfinderPoint_Async
	struct FVector FindNearestPathfinderPoint(struct FVector Pos, float MaxDistance); // Function FSD.DeepPathfinderMovement.FindNearestPathfinderPoint
	struct FVector FindNearestConnectedPathfinderPoint(struct FVector Pos, float MaxDistance); // Function FSD.DeepPathfinderMovement.FindNearestConnectedPathfinderPoint
	struct FQuat CalcPathfinderOrientation(struct FVector Pos, struct FVector forwardDir); // Function FSD.DeepPathfinderMovement.CalcPathfinderOrientation
	bool BackOffFrom(struct FVector dangerPos, float Distance); // Function FSD.DeepPathfinderMovement.BackOffFrom
	void AddFakeMoverImpulse(struct FVector Impulse); // Function FSD.DeepPathfinderMovement.AddFakeMoverImpulse
};

// Class FSD.DefenseEvent
// Size: 0x370 (Inherited: 0x358)
struct ADefenseEvent : AGameEvent {
	float DefendDuration; // 0x358(0x04)
	char UnknownData_35C[0x4]; // 0x35c(0x04)
	struct UWidget* DefendWidget; // 0x360(0x08)
	float Progress; // 0x368(0x04)
	char UnknownData_36C[0x4]; // 0x36c(0x04)

	void OnRep_Progress(float OldValue); // Function FSD.DefenseEvent.OnRep_Progress
};

// Class FSD.DefensePointActor
// Size: 0x260 (Inherited: 0x220)
struct ADefensePointActor : AActor {
	char UnknownData_220[0x20]; // 0x220(0x20)
	struct AGameEvent* DefenseEvent; // 0x240(0x08)
	struct AGameEvent* ActiveDefenceEvent; // 0x248(0x08)
	enum class EDefendPointState DefendState; // 0x250(0x01)
	char UnknownData_251[0x7]; // 0x251(0x07)
	struct USingleUsableComponent* DefendPointUsable; // 0x258(0x08)

	void SetState(enum class EDefendPointState State); // Function FSD.DefensePointActor.SetState
	void OnRep_DefendState(); // Function FSD.DefensePointActor.OnRep_DefendState
	void OnDefensePointActivated(struct APlayerCharacter* Player); // Function FSD.DefensePointActor.OnDefensePointActivated
	void DefenseStart(); // Function FSD.DefensePointActor.DefenseStart
	void DefenseFail(); // Function FSD.DefensePointActor.DefenseFail
	void DefenseComplete(); // Function FSD.DefensePointActor.DefenseComplete
};

// Class FSD.DefenseObjective
// Size: 0x180 (Inherited: 0x150)
struct UDefenseObjective : UObjective {
	int32_t DefensePoints; // 0x150(0x04)
	int32_t PointsDefended; // 0x154(0x04)
	struct TArray<SoftClassProperty> ObjectiveDefenseClasses; // 0x158(0x10)
	struct TArray<struct ADefensePointActor*> ActiveObjectiveDefenseActors; // 0x168(0x10)
	struct UDebrisPositioning* DebrisPositioning; // 0x178(0x08)

	void PointDefended(); // Function FSD.DefenseObjective.PointDefended
	void OnRep_PointsRepaired(); // Function FSD.DefenseObjective.OnRep_PointsRepaired
	void OnDefensePointsSpawned(); // Function FSD.DefenseObjective.OnDefensePointsSpawned
};

// Class FSD.DetPack
// Size: 0x288 (Inherited: 0x220)
struct ADetPack : AActor {
	char UnknownData_220[0x20]; // 0x220(0x20)
	float UpgradedStaggerChance; // 0x240(0x04)
	float UpgradedStaggerDuration; // 0x244(0x04)
	float UpgradedFearFactor; // 0x248(0x04)
	float VisualDamageRadius; // 0x24c(0x04)
	float IncreasedFearRadius; // 0x250(0x04)
	float IncreasedStaggerRadius; // 0x254(0x04)
	struct UProjectileMovementComponent* Movement; // 0x258(0x08)
	struct UExplosionComponent* Explosion; // 0x260(0x08)
	struct USingleUsableComponent* UseComp; // 0x268(0x08)
	struct USimpleHealthComponent* SimpleHealth; // 0x270(0x08)
	struct ADetPackItem* Detonator; // 0x278(0x08)
	bool HasExploded; // 0x280(0x01)
	bool IsMoving; // 0x281(0x01)
	bool ExplodesOnDeath; // 0x282(0x01)
	bool HasExtraStaggerRadius; // 0x283(0x01)
	bool HasExtraFearRadius; // 0x284(0x01)
	char UnknownData_285[0x3]; // 0x285(0x03)

	void UseFearStaggerUpgrades(); // Function FSD.DetPack.UseFearStaggerUpgrades
	void RecieveHitObject(); // Function FSD.DetPack.RecieveHitObject
	void OnRep_IsMoving(); // Function FSD.DetPack.OnRep_IsMoving
	void OnRep_HasExploded(); // Function FSD.DetPack.OnRep_HasExploded
	void OnExploded(); // Function FSD.DetPack.OnExploded
	void OnDetPackPickedUp(struct APlayerCharacter* User); // Function FSD.DetPack.OnDetPackPickedUp
	void OnDetPackDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.DetPack.OnDetPackDeath
};

// Class FSD.DetPackItem
// Size: 0x440 (Inherited: 0x368)
struct ADetPackItem : AAnimatedItem {
	char UnknownData_368[0x10]; // 0x368(0x10)
	struct ADetPack* DetPackClass; // 0x378(0x08)
	struct AItem* LoadoutProxy; // 0x380(0x08)
	struct UAnimMontage* FPThrowMontage; // 0x388(0x08)
	struct UAnimMontage* TPThrowMontage; // 0x390(0x08)
	struct UAnimMontage* FP_DetonateAnim; // 0x398(0x08)
	struct UAnimMontage* WPN_DetonateAnim; // 0x3a0(0x08)
	struct UAnimMontage* FP_EquipDetonatorAnimation; // 0x3a8(0x08)
	struct UAnimMontage* WPN_EquipDetonatorAnimation; // 0x3b0(0x08)
	struct USkeletalMeshComponent* DetonatorFPMesh; // 0x3b8(0x08)
	struct USkeletalMeshComponent* DetonatorTPMesh; // 0x3c0(0x08)
	struct UForceFeedbackEffect* DetonatorTriggerForceFeedback; // 0x3c8(0x08)
	struct UCapacityHoldingItemAggregator* Capacity; // 0x3d0(0x08)
	float SupplyStatusWeight; // 0x3d8(0x04)
	float ThrowVelocity; // 0x3dc(0x04)
	float EnheiritOwnerVelocityScale; // 0x3e0(0x04)
	float ThrowAngle; // 0x3e4(0x04)
	float CooldownAfterThrow; // 0x3e8(0x04)
	float CooldownAfterDetonation; // 0x3ec(0x04)
	float ThrowDelay; // 0x3f0(0x04)
	float ThrowZOffset; // 0x3f4(0x04)
	struct UDialogDataAsset* ShoutDetPackPlaced; // 0x3f8(0x08)
	struct UDialogDataAsset* ShoutOutOfAmmo; // 0x400(0x08)
	char UnknownData_408[0x4]; // 0x408(0x04)
	float CooldownLeft; // 0x40c(0x04)
	struct TArray<struct ADetPack*> ThrownPacks; // 0x410(0x10)
	struct TArray<struct UItemUpgrade*> DetPackUpgrades; // 0x420(0x10)
	char UnknownData_430[0xa]; // 0x430(0x0a)
	bool IsDetonatorOut; // 0x43a(0x01)
	bool HasThrownPack; // 0x43b(0x01)
	char UnknownData_43C[0x4]; // 0x43c(0x04)

	void Simulate_ThrowGrenade(); // Function FSD.DetPackItem.Simulate_ThrowGrenade
	void Server_ThrowGrenade(); // Function FSD.DetPackItem.Server_ThrowGrenade
	void Server_Detonate(); // Function FSD.DetPackItem.Server_Detonate
	void Server_CycleItem(); // Function FSD.DetPackItem.Server_CycleItem
	void Receive_OnRep_IsDetonatorOut(); // Function FSD.DetPackItem.Receive_OnRep_IsDetonatorOut
	void OnRep_IsDetonatorOut(); // Function FSD.DetPackItem.OnRep_IsDetonatorOut
	void OnDetonatingFinished(); // Function FSD.DetPackItem.OnDetonatingFinished
	int32_t GetCurrentGrenades(); // Function FSD.DetPackItem.GetCurrentGrenades
};

// Class FSD.DialogDataAsset
// Size: 0x60 (Inherited: 0x30)
struct UDialogDataAsset : UDataAsset {
	bool Enabled; // 0x30(0x01)
	bool AudioOnly; // 0x31(0x01)
	char UnknownData_32[0x2]; // 0x32(0x02)
	float ShoutDelay; // 0x34(0x04)
	float ShoutCoolDown; // 0x38(0x04)
	float ShoutChance; // 0x3c(0x04)
	struct TArray<struct FDialogStruct> Entries; // 0x40(0x10)
	struct TArray<int32_t> ShuffledIndices; // 0x50(0x10)

	int32_t SelectIndex(struct UObject* WorldContext); // Function FSD.DialogDataAsset.SelectIndex
	bool SelectEntry(struct UObject* WorldContext, struct FDialogStruct Dialog); // Function FSD.DialogDataAsset.SelectEntry
	struct FDialogStruct GetShout(int32_t Index); // Function FSD.DialogDataAsset.GetShout
};

// Class FSD.DifficultyManager
// Size: 0xe0 (Inherited: 0xb0)
struct UDifficultyManager : UActorComponent {
	char UnknownData_B0[0x18]; // 0xb0(0x18)
	int32_t ForcedPlayerCount; // 0xc8(0x04)
	char UnknownData_CC[0x4]; // 0xcc(0x04)
	struct AFSDGameMode* GameMode; // 0xd0(0x08)
	struct AFSDGameState* GameState; // 0xd8(0x08)

	struct UDifficultySetting* SelectDifficulty(int32_t Index); // Function FSD.DifficultyManager.SelectDifficulty
	float GetSmallEnemyDamageResistance(); // Function FSD.DifficultyManager.GetSmallEnemyDamageResistance
	float GetPointExtractionScaler(); // Function FSD.DifficultyManager.GetPointExtractionScaler
	float GetExtraLargeEnemyDamageResistanceD(); // Function FSD.DifficultyManager.GetExtraLargeEnemyDamageResistanceD
	float GetExtraLargeEnemyDamageResistanceC(); // Function FSD.DifficultyManager.GetExtraLargeEnemyDamageResistanceC
	float GetExtraLargeEnemyDamageResistanceB(); // Function FSD.DifficultyManager.GetExtraLargeEnemyDamageResistanceB
	float GetExtraLargeEnemyDamageResistance(); // Function FSD.DifficultyManager.GetExtraLargeEnemyDamageResistance
	float GetEnemyDamageResistance(); // Function FSD.DifficultyManager.GetEnemyDamageResistance
	float GetEnemyDamageModifier(); // Function FSD.DifficultyManager.GetEnemyDamageModifier
	float GetEnemyCountModifier(); // Function FSD.DifficultyManager.GetEnemyCountModifier
	struct UDifficultySetting* GetCurrentDifficulty(); // Function FSD.DifficultyManager.GetCurrentDifficulty
	float GetBossDifficultyScaler(); // Function FSD.DifficultyManager.GetBossDifficultyScaler
};

// Class FSD.DifficultySetting
// Size: 0x230 (Inherited: 0x58)
struct UDifficultySetting : USavableDataAsset {
	struct FText DifficultyName; // 0x58(0x18)
	struct FText ShortDifficultyName; // 0x70(0x18)
	struct FText UnlockRequirementDescription; // 0x88(0x18)
	struct UCampaign* CampaignRequirement; // 0xa0(0x08)
	float EnvironmentalDamageModifier; // 0xa8(0x04)
	char UnknownData_AC[0x4]; // 0xac(0x04)
	struct TArray<float> ExtraLargeEnemyDamageResistance; // 0xb0(0x10)
	struct TArray<float> ExtraLargeEnemyDamageResistanceB; // 0xc0(0x10)
	struct TArray<float> ExtraLargeEnemyDamageResistanceC; // 0xd0(0x10)
	struct TArray<float> ExtraLargeEnemyDamageResistanceD; // 0xe0(0x10)
	struct TArray<float> EnemyDamageResistance; // 0xf0(0x10)
	struct TArray<float> SmallEnemyDamageResistance; // 0x100(0x10)
	struct TArray<float> EnemyDamageModifier; // 0x110(0x10)
	struct TArray<float> EnemyCountModifier; // 0x120(0x10)
	float BossDifficultyScaler; // 0x130(0x04)
	float PointExtractionScaler; // 0x134(0x04)
	struct FRandInterval EncounterDifficulty; // 0x138(0x10)
	struct FRandInterval StationaryDifficulty; // 0x148(0x10)
	float SpecialEncounterModifier; // 0x158(0x04)
	float HazardBonus; // 0x15c(0x04)
	float friendlyFireModifier; // 0x160(0x04)
	char UnknownData_164[0x4]; // 0x164(0x04)
	struct FRandInterval EnemyWaveInterval; // 0x168(0x10)
	struct FRandInterval EnemyNormalWaveInterval; // 0x178(0x10)
	struct FRandInterval EnemyNormalWaveDifficulty; // 0x188(0x10)
	float WaveStartDelayScale; // 0x198(0x04)
	char UnknownData_19C[0x4]; // 0x19c(0x04)
	struct FRandInterval EnemyDiversity; // 0x1a0(0x10)
	struct FRandInterval StationaryEnemyDiversity; // 0x1b0(0x10)
	struct FIRandRange DisruptiveEnemyPoolCount; // 0x1c0(0x08)
	int32_t MinPoolSize; // 0x1c8(0x04)
	char UnknownData_1CC[0x4]; // 0x1cc(0x04)
	struct FVeteranComposition Veterans; // 0x1d0(0x20)
	float SpeedModifier; // 0x1f0(0x04)
	float AttackCooldownModifier; // 0x1f4(0x04)
	float ProjectileSpeedModifier; // 0x1f8(0x04)
	int32_t DifficultyGroup; // 0x1fc(0x04)
	int32_t DifficultyGroupIndex; // 0x200(0x04)
	char UnknownData_204[0x4]; // 0x204(0x04)
	struct TArray<struct UMissionStat*> MissionCompletedStats; // 0x208(0x10)
	bool UseSharedHealthPool; // 0x218(0x01)
	char UnknownData_219[0x3]; // 0x219(0x03)
	float HeathRegenerationMax; // 0x21c(0x04)
	float ReviveHealthRatio; // 0x220(0x04)
	float EliteChanceModifier; // 0x224(0x04)
	float EliteCooldown; // 0x228(0x04)
	int32_t MaxActiveElites; // 0x22c(0x04)

	bool IsUnlocked(struct UObject* WorldContext); // Function FSD.DifficultySetting.IsUnlocked
	float AddHazardBonus(float BaseValue); // Function FSD.DifficultySetting.AddHazardBonus
};

// Class FSD.DiscordWrapper
// Size: 0x1f0 (Inherited: 0x28)
struct UDiscordWrapper : UObject {
	char UnknownData_28[0x10]; // 0x28(0x10)
	struct FDiscordServerInviteData ServerInfo; // 0x38(0x78)
	struct FMulticastInlineDelegate OnResponseSuccessChanged; // 0xb0(0x10)
	bool LastResponseSuccessful; // 0xc0(0x01)
	char UnknownData_C1[0x7]; // 0xc1(0x07)
	struct FMulticastInlineDelegate OnDiscordEoMDataEvent; // 0xc8(0x10)
	char UnknownData_D8[0x30]; // 0xd8(0x30)
	bool UserIn; // 0x108(0x01)
	char UnknownData_109[0x7]; // 0x109(0x07)
	struct FDiscordRewardNotification rewardNotification; // 0x110(0x40)
	int32_t UserInStatus; // 0x150(0x04)
	bool HasEoM; // 0x154(0x01)
	char UnknownData_155[0x3]; // 0x155(0x03)
	struct FDiscordEoMData EoMData; // 0x158(0x20)
	bool IsConnected; // 0x178(0x01)
	char UnknownData_179[0x1]; // 0x179(0x01)
	bool ServerInfoLoaded; // 0x17a(0x01)
	char UnknownData_17B[0x5]; // 0x17b(0x05)
	struct FMulticastInlineDelegate OnDiscordServerInfoLoaded; // 0x180(0x10)
	struct FMulticastInlineDelegate OnDiscordServerCountLoaded; // 0x190(0x10)
	struct FMulticastInlineDelegate OnDiscordUserInServer; // 0x1a0(0x10)
	char UnknownData_1B0[0x40]; // 0x1b0(0x40)

	void RequestUserInServer(); // Function FSD.DiscordWrapper.RequestUserInServer
	void RequestFactionAdjustment(int32_t Faction, bool force); // Function FSD.DiscordWrapper.RequestFactionAdjustment
	void RequestEoMData(); // Function FSD.DiscordWrapper.RequestEoMData
	void RequestDiscordServerInfo(); // Function FSD.DiscordWrapper.RequestDiscordServerInfo
	void RejectInviteSignature(); // Function FSD.DiscordWrapper.RejectInviteSignature
	void IgnoreInviteSignature(); // Function FSD.DiscordWrapper.IgnoreInviteSignature
	struct FString GetAvatarURL(); // Function FSD.DiscordWrapper.GetAvatarURL
	void AdjustFaction(); // Function FSD.DiscordWrapper.AdjustFaction
	void AcceptInviteSignature(); // Function FSD.DiscordWrapper.AcceptInviteSignature
};

// Class FSD.MULE
// Size: 0x390 (Inherited: 0x378)
struct AMULE : ADeepPathfinderCharacter {
	struct UHealthComponent* HealthComponent; // 0x378(0x08)
	struct USimpleObjectInfoComponent* ObjectInfo; // 0x380(0x08)
	bool IsDown; // 0x388(0x01)
	char UnknownData_389[0x7]; // 0x389(0x07)

	void SetIsDown(bool IsDown); // Function FSD.MULE.SetIsDown
	void SetControlledByDropShip(bool Control); // Function FSD.MULE.SetControlledByDropShip
	void OnRep_IsDown(); // Function FSD.MULE.OnRep_IsDown
};

// Class FSD.DonkeyCharacter
// Size: 0x3b0 (Inherited: 0x390)
struct ADonkeyCharacter : AMULE {
	struct UResourceBank* ResourceBank; // 0x390(0x08)
	struct UOutlineComponent* OutlineComponent; // 0x398(0x08)
	struct FMulticastInlineDelegate OnReachedDropShip; // 0x3a0(0x10)

	void SetOpenForDeposit(bool Open); // Function FSD.DonkeyCharacter.SetOpenForDeposit
	void SetGotoDropShip(struct FVector Location); // Function FSD.DonkeyCharacter.SetGotoDropShip
	void EnableButton(); // Function FSD.DonkeyCharacter.EnableButton
};

// Class FSD.RepairableComponent
// Size: 0xf0 (Inherited: 0xb0)
struct URepairableComponent : UActorComponent {
	struct FMulticastInlineDelegate OnFullyRepairedEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAllResourcesAquiredEvent; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnRepairedEvent; // 0xd0(0x10)
	struct UGemResourceData* RequiresCarriedResource; // 0xe0(0x08)
	int32_t ResourcesRequired; // 0xe8(0x04)
	bool IsFullyRepaired; // 0xec(0x01)
	char UnknownData_ED[0x3]; // 0xed(0x03)

	bool TryRepair(struct APlayerCharacter* User); // Function FSD.RepairableComponent.TryRepair
	void OnRep_ResourcesRequired(); // Function FSD.RepairableComponent.OnRep_ResourcesRequired
	int32_t GetResourcesRequired(); // Function FSD.RepairableComponent.GetResourcesRequired
	void Cheat_Repair(); // Function FSD.RepairableComponent.Cheat_Repair
};

// Class FSD.MiniMule
// Size: 0x3a0 (Inherited: 0x390)
struct AMiniMule : AMULE {
	struct TArray<struct AGem*> LostLegs; // 0x390(0x10)

	void SetLegsVisibleOnScanner(); // Function FSD.MiniMule.SetLegsVisibleOnScanner
	void OnLegsSetVisible(); // Function FSD.MiniMule.OnLegsSetVisible
	struct TArray<struct AGem*> FindLegsInLevelSortedByDistance(); // Function FSD.MiniMule.FindLegsInLevelSortedByDistance
};

// Class FSD.DoubleDrillAggregator
// Size: 0x148 (Inherited: 0x140)
struct UDoubleDrillAggregator : UCapacityBasedItemAggregator {
	char UnknownData_140[0x8]; // 0x140(0x08)
};

// Class FSD.DualAnimatedItem
// Size: 0x370 (Inherited: 0x318)
struct ADualAnimatedItem : AItem {
	struct UAnimInstance* FPAnimInstance; // 0x318(0x08)
	struct UPlayerAnimInstance* TPAnimInstance; // 0x320(0x08)
	struct USkeletalMeshComponent* FPRMesh; // 0x328(0x08)
	struct USkeletalMeshComponent* FPLMesh; // 0x330(0x08)
	struct USkeletalMeshComponent* TPRMesh; // 0x338(0x08)
	struct USkeletalMeshComponent* TPLMesh; // 0x340(0x08)
	struct UAnimMontage* FP_EquipAnimation; // 0x348(0x08)
	struct UAnimMontage* TP_EquipAnimation; // 0x350(0x08)
	float EquipDuration; // 0x358(0x04)
	char UnknownData_35C[0x4]; // 0x35c(0x04)
	struct UItemCharacterAnimationSet* CharacterAnimationSet; // 0x360(0x08)
	char UnknownData_368[0x8]; // 0x368(0x08)

	struct USkeletalMeshComponent* GetRItemMesh(); // Function FSD.DualAnimatedItem.GetRItemMesh
	struct USkeletalMeshComponent* GetLItemMesh(); // Function FSD.DualAnimatedItem.GetLItemMesh
};

// Class FSD.DoubleDrillItem
// Size: 0x4a8 (Inherited: 0x370)
struct ADoubleDrillItem : ADualAnimatedItem {
	char UnknownData_370[0x18]; // 0x370(0x18)
	struct UFirstPersonParticleSystemComponent* FP_Left_DrillParticles; // 0x388(0x08)
	struct UFirstPersonParticleSystemComponent* FP_Right_DrillParticles; // 0x390(0x08)
	struct UDamageComponent* DamageComponent; // 0x398(0x08)
	struct UAudioComponent* AudioComponent; // 0x3a0(0x08)
	struct UDoubleDrillAggregator* Aggregator; // 0x3a8(0x08)
	struct UAnimMontage* FPMineMontage; // 0x3b0(0x08)
	struct UAnimMontage* TPMineMontage; // 0x3b8(0x08)
	struct UAnimMontage* FPOverheat; // 0x3c0(0x08)
	struct UAnimMontage* TPOverheat; // 0x3c8(0x08)
	struct UAnimMontage* FPGunsling; // 0x3d0(0x08)
	struct UAnimMontage* TPGunsling; // 0x3d8(0x08)
	struct FName MiningSpeedAudioParamterName; // 0x3e0(0x08)
	struct UParticleSystem* DrillParticles; // 0x3e8(0x08)
	struct UForceFeedbackEffect* DrillRumble; // 0x3f0(0x08)
	float BlockParticlesScaleFP; // 0x3f8(0x04)
	float BlockParticlesScaleTP; // 0x3fc(0x04)
	enum class EDoubleDrillState State; // 0x400(0x01)
	char UnknownData_401[0x3]; // 0x401(0x03)
	float MovementPenalty; // 0x404(0x04)
	float MiningRate; // 0x408(0x04)
	float HeatReductionPerKill; // 0x40c(0x04)
	struct FVector CarveSize; // 0x410(0x0c)
	float CarveNoise; // 0x41c(0x04)
	float CarverRayCastLength; // 0x420(0x04)
	float CarveTerrainDistanceCheck; // 0x424(0x04)
	float TimeToNextMine; // 0x428(0x04)
	float CurrentDrillSpeed; // 0x42c(0x04)
	float DamageDistance; // 0x430(0x04)
	float DamageRadius; // 0x434(0x04)
	float FriendlyDamageRadius; // 0x438(0x04)
	float DamageRate; // 0x43c(0x04)
	float Damage; // 0x440(0x04)
	float ArmorDamageMultiplier; // 0x444(0x04)
	struct UDamageClass* DamageClass; // 0x448(0x08)
	float friendlyFireModifier; // 0x450(0x04)
	float MaxFuel; // 0x454(0x04)
	float Fuel; // 0x458(0x04)
	float FuelUsePerDig; // 0x45c(0x04)
	float FuelUsePerMelee; // 0x460(0x04)
	float SupplyStatusWeight; // 0x464(0x04)
	struct UDialogDataAsset* ShoutOutOfFuel; // 0x468(0x08)
	struct TArray<struct FHitResult> HitCache; // 0x470(0x10)
	struct TArray<struct FDoubleDrillDamageItem> DamageCache; // 0x480(0x10)
	char UnknownData_490[0x10]; // 0x490(0x10)
	float DrillParticlesDuration; // 0x4a0(0x04)
	bool IsMining; // 0x4a4(0x01)
	bool IsGunslinging; // 0x4a5(0x01)
	char UnknownData_4A6[0x2]; // 0x4a6(0x02)

	void Server_StopMining(); // Function FSD.DoubleDrillItem.Server_StopMining
	void Server_StartMining(); // Function FSD.DoubleDrillItem.Server_StartMining
	void Server_DoDamage(struct TArray<struct FDoubleDrillDamageItem> Targets); // Function FSD.DoubleDrillItem.Server_DoDamage
	void Server_DigBlock(struct FVector_NetQuantize Start, struct FVector_NetQuantize End); // Function FSD.DoubleDrillItem.Server_DigBlock
	void OnTargetKilled(struct AActor* Target, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.DoubleDrillItem.OnTargetKilled
	void OnStopDrilling(); // Function FSD.DoubleDrillItem.OnStopDrilling
	void OnStartDrilling(); // Function FSD.DoubleDrillItem.OnStartDrilling
	void OnRep_SimulatingMining(); // Function FSD.DoubleDrillItem.OnRep_SimulatingMining
	void OnRep_IsGunslinging(); // Function FSD.DoubleDrillItem.OnRep_IsGunslinging
	void OnDrillParticlesTimerElapsed(); // Function FSD.DoubleDrillItem.OnDrillParticlesTimerElapsed
	void Client_Resupply(float percentage); // Function FSD.DoubleDrillItem.Client_Resupply
	void BP_OnDrillDamage(); // Function FSD.DoubleDrillItem.BP_OnDrillDamage
	void All_SimulateDigDebris(struct FVector_NetQuantize Position, int32_t DebrisIndex); // Function FSD.DoubleDrillItem.All_SimulateDigDebris
	void All_SimulateDigBlock(struct FVector_NetQuantize Position, bool spawnParticles, int32_t Material); // Function FSD.DoubleDrillItem.All_SimulateDigBlock
	void All_SimulateDamage(struct TArray<struct FDoubleDrillDamageItem> Targets); // Function FSD.DoubleDrillItem.All_SimulateDamage
};

// Class FSD.DoubleDrillAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UDoubleDrillAnimInstance : UAnimInstance {
	float DrillSpeed; // 0x268(0x04)
	bool IsMining; // 0x26c(0x01)
	bool IsGunslinging; // 0x26d(0x01)
	struct ADoubleDrillItem* Item; // 0x270(0x08)
	char UnknownData_27E[0x2]; // 0x27e(0x02)
};

// Class FSD.DownedStateComponent
// Size: 0x140 (Inherited: 0xf8)
struct UDownedStateComponent : UCharacterStateComponent {
	struct FDeathIntroSettings Intro; // 0xf8(0x24)
	float DownedHealthLossPerSecond; // 0x11c(0x04)
	float TerrainRemovedFallThreshold; // 0x120(0x04)
	bool DownedBombActive; // 0x124(0x01)
	char UnknownData_125[0x3]; // 0x125(0x03)
	struct UDamageComponent* DownedBombDamage; // 0x128(0x08)
	struct FMulticastInlineDelegate OnEnableDownedBombUIEvent; // 0x130(0x10)

	void TriggerDownedBombDamage(); // Function FSD.DownedStateComponent.TriggerDownedBombDamage
	void Server_TriggerDownedBomb(); // Function FSD.DownedStateComponent.Server_TriggerDownedBomb
	void Receive_TriggerDownedBomb(); // Function FSD.DownedStateComponent.Receive_TriggerDownedBomb
	struct UDamageComponent* CreateDownedBombDamage(struct UDamageComponent* DamageClass); // Function FSD.DownedStateComponent.CreateDownedBombDamage
};

// Class FSD.DrinkableActor
// Size: 0x228 (Inherited: 0x220)
struct ADrinkableActor : AActor {
	struct UDrinkableDataAsset* DrinkableData; // 0x220(0x08)

	void Pickup(struct APlayerCharacter* byCharacter); // Function FSD.DrinkableActor.Pickup
	void OnRep_DrinkableData(); // Function FSD.DrinkableActor.OnRep_DrinkableData
	void Fill(); // Function FSD.DrinkableActor.Fill
};

// Class FSD.DrinkableDataAsset
// Size: 0x218 (Inherited: 0x58)
struct UDrinkableDataAsset : USavableDataAsset {
	struct FText DrinkableName; // 0x58(0x18)
	struct FText DrinkableDescription; // 0x70(0x18)
	int32_t DrinkablePrice; // 0x88(0x04)
	char UnknownData_8C[0x4]; // 0x8c(0x04)
	struct TSoftObjectPtr<struct UTexture2D> DrinkableIcon; // 0x90(0x28)
	int32_t RequiredPlayerRank; // 0xb8(0x04)
	bool ParticipatesInFreeBeerEvent; // 0xbc(0x01)
	enum class EDrinkableAlcoholStrength AlcoholStrength; // 0xbd(0x01)
	char UnknownData_BE[0x2]; // 0xbe(0x02)
	struct UDrinkableDataAsset* SupporterEdition; // 0xc0(0x08)
	bool bPlayFireworks; // 0xc8(0x01)
	char UnknownData_C9[0x7]; // 0xc9(0x07)
	struct UMissionStat* StatConsumed; // 0xd0(0x08)
	struct UMissionStat* StatRoundOrdered; // 0xd8(0x08)
	SoftClassProperty DrinkableActorClass; // 0xe0(0x28)
	SoftClassProperty DrinkableItemClass; // 0x108(0x28)
	struct UDialogDataAsset* OrderShout; // 0x130(0x08)
	struct UDialogDataAsset* OrderCheeringShout; // 0x138(0x08)
	struct UDialogDataAsset* DrinkSaluteShout; // 0x140(0x08)
	struct UTemporaryBuff* buff; // 0x148(0x08)
	SoftClassProperty DrinkEffect; // 0x150(0x28)
	struct TMap<struct UResourceData*, int32_t> UnlockCost; // 0x178(0x50)
	struct TMap<struct UResourceData*, int32_t> PurchaseCost; // 0x1c8(0x50)

	bool TryUnlockSpecialDrinks(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.TryUnlockSpecialDrinks
	bool TryUnlockDrink(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.TryUnlockDrink
	bool TryPurchaseDrink(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.TryPurchaseDrink
	void OnRoundOrdered(struct APlayerCharacter* Character); // Function FSD.DrinkableDataAsset.OnRoundOrdered
	bool MustBeUnlocked(); // Function FSD.DrinkableDataAsset.MustBeUnlocked
	bool IsUnlocked(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.IsUnlocked
	bool IsDrinkFree(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.IsDrinkFree
	bool HasSupporterEdition(); // Function FSD.DrinkableDataAsset.HasSupporterEdition
	struct UTexture2D* GetDrinkableIcon(); // Function FSD.DrinkableDataAsset.GetDrinkableIcon
	struct UDrinkableDataAsset* GetDrinkableEdition(struct UObject* WorldContext, struct APlayerController* Player); // Function FSD.DrinkableDataAsset.GetDrinkableEdition
	bool AreSpecialDrinksUnlocked(struct UObject* WorldContext); // Function FSD.DrinkableDataAsset.AreSpecialDrinksUnlocked
};

// Class FSD.DrinkEffectComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UDrinkEffectComponent : UActorComponent {
	char UnknownData_B0[0x8]; // 0xb0(0x08)
	float BeerEffectDurationSeconds; // 0xb8(0x04)
	bool AutoDestroy; // 0xbc(0x01)
	bool EffectIsActive; // 0xbd(0x01)
	char UnknownData_BE[0x2]; // 0xbe(0x02)

	void StopEffect(); // Function FSD.DrinkEffectComponent.StopEffect
	void OnStopEffect(); // Function FSD.DrinkEffectComponent.OnStopEffect
	void OnStartEffect(struct APlayerCharacter* Character); // Function FSD.DrinkEffectComponent.OnStartEffect
	void OnChangedCharacter(struct APlayerCharacter* changedToCharacter, struct UObject* DrinkEffectClass); // Function FSD.DrinkEffectComponent.OnChangedCharacter
};

// Class FSD.DrinkableItem
// Size: 0x370 (Inherited: 0x368)
struct ADrinkableItem : AAnimatedItem {
	struct UDrinkableDataAsset* DrinkableData; // 0x368(0x08)

	void OnRep_DrinkableData(); // Function FSD.DrinkableItem.OnRep_DrinkableData
	void Consume(); // Function FSD.DrinkableItem.Consume
	void ClientConsumed(); // Function FSD.DrinkableItem.ClientConsumed
	bool CheckCanSalute(); // Function FSD.DrinkableItem.CheckCanSalute
};

// Class FSD.DrinkSettings
// Size: 0xb0 (Inherited: 0x30)
struct UDrinkSettings : UDataAsset {
	struct TArray<struct FBarleySpawnItem> BarleySpawns; // 0x30(0x10)
	struct FRandInterval BarleyAmount; // 0x40(0x10)
	struct TMap<struct UResourceData*, int32_t> SpecialBeerUnlockCost; // 0x50(0x50)
	struct TArray<struct UDrinkableDataAsset*> Drinkables; // 0xa0(0x10)

	struct TArray<struct UDrinkableDataAsset*> GetBarDrinkables(struct UObject* WorldContext, bool IncludeDailySpecial, bool includeNotUnlocked, bool includePlayerRankTooLow); // Function FSD.DrinkSettings.GetBarDrinkables
	struct UDrinkableDataAsset* GetBarDailySpecial(struct UObject* WorldContext); // Function FSD.DrinkSettings.GetBarDailySpecial
};

// Class FSD.DroneAbillityStatsComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UDroneAbillityStatsComponent : UActorComponent {
	bool UseOwnArmorDamageMultiplier; // 0xb0(0x01)
	char UnknownData_B1[0xf]; // 0xb1(0x0f)
};

// Class FSD.DroneCharacter
// Size: 0x390 (Inherited: 0x378)
struct ADroneCharacter : ADeepPathfinderCharacter {
	struct UHealthComponent* HealthComponent; // 0x378(0x08)
	struct UOutlineComponent* OutlineComponent; // 0x380(0x08)
	struct USimpleObjectInfoComponent* ObjectInfo; // 0x388(0x08)
};

// Class FSD.DroneDisplayActionComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDroneDisplayActionComponent : USceneComponent {
	struct UTextRenderComponent* DisplayText; // 0x1f0(0x08)
	char UnknownData_1F8[0x8]; // 0x1f8(0x08)

	void SetMode(enum class EDroneActions droneAction); // Function FSD.DroneDisplayActionComponent.SetMode
};

// Class FSD.DroneFlame
// Size: 0x268 (Inherited: 0x220)
struct ADroneFlame : AActor {
	struct UParticleSystemComponent* FlameParticles; // 0x220(0x08)
	struct UDamageComponent* Damage; // 0x228(0x08)
	char UnknownData_230[0x8]; // 0x230(0x08)
	struct TArray<struct FName> FlameParameterNames; // 0x238(0x10)
	struct UStatusEffect* OnFireStatusEffect; // 0x248(0x08)
	float DamageTickRate; // 0x250(0x04)
	char UnknownData_254[0x4]; // 0x254(0x04)
	float Duration; // 0x258(0x04)
	float FlameDiameter; // 0x25c(0x04)
	float Range; // 0x260(0x04)
	char UnknownData_264[0x4]; // 0x264(0x04)
};

// Class FSD.DroneMiningToolBase
// Size: 0xe8 (Inherited: 0xb0)
struct UDroneMiningToolBase : UActorComponent {
	struct FMulticastInlineDelegate HitSomething; // 0xb0(0x10)
	char UnknownData_C0[0x10]; // 0xc0(0x10)
	float Range; // 0xd0(0x04)
	float SameHitDistance; // 0xd4(0x04)
	float MineRadius; // 0xd8(0x04)
	int32_t MineStrength; // 0xdc(0x04)
	char UnknownData_E0[0x8]; // 0xe0(0x08)

	void StopMining(); // Function FSD.DroneMiningToolBase.StopMining
	void StartMining(); // Function FSD.DroneMiningToolBase.StartMining
	void SpawnEffects(struct UTerrainMaterial* aTerrainMaterial, bool aParialHit, struct FVector_NetQuantize aLocation, struct FVector_NetQuantize aImpactNormal); // Function FSD.DroneMiningToolBase.SpawnEffects
};

// Class FSD.DroneUseComponent
// Size: 0x120 (Inherited: 0xb0)
struct UDroneUseComponent : UActorComponent {
	struct FMulticastInlineDelegate OnUsed; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnBeginUse; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnStopUse; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnProgress; // 0xe0(0x10)
	struct UDialogDataAsset* BoscoLaserpointerShout; // 0xf0(0x08)
	char UnknownData_F8[0xc]; // 0xf8(0x0c)
	struct FWeakObjectPtr<struct USingleUsableComponent> SyncToUsable; // 0x104(0x08)
	float Progress; // 0x10c(0x04)
	float useDuration; // 0x110(0x04)
	char UnknownData_114[0x8]; // 0x114(0x08)
	bool ResetOnFail; // 0x11c(0x01)
	bool canUse; // 0x11d(0x01)
	char UnknownData_11E[0x2]; // 0x11e(0x02)

	void SyncedUsableUserCountChangedResponse(int32_t userCount); // Function FSD.DroneUseComponent.SyncedUsableUserCountChangedResponse
	void SyncedUsableUsedResponse(struct APlayerCharacter* User); // Function FSD.DroneUseComponent.SyncedUsableUsedResponse
	void SyncedUsableBeginUseResponse(struct APlayerCharacter* User); // Function FSD.DroneUseComponent.SyncedUsableBeginUseResponse
	void SetUseDuration(float useDuration); // Function FSD.DroneUseComponent.SetUseDuration
	void SetCanUse(bool canUse); // Function FSD.DroneUseComponent.SetCanUse
	float GetProgress(); // Function FSD.DroneUseComponent.GetProgress
	void EndUse(); // Function FSD.DroneUseComponent.EndUse
	void BeginUse(); // Function FSD.DroneUseComponent.BeginUse
};

// Class FSD.DropPod
// Size: 0x290 (Inherited: 0x220)
struct ADropPod : AActor {
	float DropHeight; // 0x220(0x04)
	struct FVector TargetLocation; // 0x224(0x0c)
	struct UAutoCarverComponent* AutoCarver; // 0x230(0x08)
	struct UCurveFloat* DepartCurve; // 0x238(0x08)
	float CarverRotationSpeed; // 0x240(0x04)
	struct FVector CarverScale; // 0x244(0x0c)
	float DepartureTime; // 0x250(0x04)
	char UnknownData_254[0x4]; // 0x254(0x04)
	struct FVector StartLocation; // 0x258(0x0c)
	enum class EDropPodState State; // 0x264(0x01)
	char UnknownData_265[0x7]; // 0x265(0x07)
	float DrillSpeed; // 0x26c(0x04)
	float FreeFallAcceleration; // 0x270(0x04)
	float FreeFallSpeed; // 0x274(0x04)
	char UnknownData_278[0x18]; // 0x278(0x18)

	void StartDrilling(); // Function FSD.DropPod.StartDrilling
	void PrepForTakeOff(); // Function FSD.DropPod.PrepForTakeOff
	void OnRep_State(); // Function FSD.DropPod.OnRep_State
	void OnPrepForTakeOff(); // Function FSD.DropPod.OnPrepForTakeOff
	void OnDroppodImpact(); // Function FSD.DropPod.OnDroppodImpact
	void OnDrillingStarted(); // Function FSD.DropPod.OnDrillingStarted
	void OnDeparting(); // Function FSD.DropPod.OnDeparting
	struct ADropPod* DropToMission(struct UObject* WorldContextObject, struct ADropPod* podClass, struct FVector Location); // Function FSD.DropPod.DropToMission
	void Depart(); // Function FSD.DropPod.Depart
};

// Class FSD.FSDMiningHead
// Size: 0x298 (Inherited: 0x290)
struct AFSDMiningHead : ADropPod {
	struct UResourceBank* ResourceBank; // 0x290(0x08)
};

// Class FSD.DropToTerrainComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UDropToTerrainComponent : UActorComponent {
	char UnknownData_B0[0xc]; // 0xb0(0x0c)
	float FallVelocity; // 0xbc(0x04)
	float TerrainTraceMaxDistance; // 0xc0(0x04)
	char UnknownData_C4[0x4]; // 0xc4(0x04)
	struct FMulticastInlineDelegate OnFallToTerrainStateChanged; // 0xc8(0x10)
	struct FVector CurrentLocation; // 0xd8(0x0c)
	struct FVector DropTarget; // 0xe4(0x0c)
	bool IsDetecting; // 0xf0(0x01)
	char UnknownData_F1[0x7]; // 0xf1(0x07)

	void StopDropDetection(bool stopFalling); // Function FSD.DropToTerrainComponent.StopDropDetection
	void SetParentPositionOnAll(struct FVector CurrentParentLocation); // Function FSD.DropToTerrainComponent.SetParentPositionOnAll
	void OnTerrainRemoved(); // Function FSD.DropToTerrainComponent.OnTerrainRemoved
	void BeginDropDetection(); // Function FSD.DropToTerrainComponent.BeginDropDetection
};

// Class FSD.DualWieldWeapon
// Size: 0x6c8 (Inherited: 0x690)
struct ADualWieldWeapon : AAmmoDrivenWeapon {
	char UnknownData_690[0x8]; // 0x690(0x08)
	struct UFirstPersonSkeletalMeshComponent* FPMeshLeft; // 0x698(0x08)
	struct USkeletalMeshComponent* TPMeshLeft; // 0x6a0(0x08)
	struct UAnimMontage* WPN_Left_Reload; // 0x6a8(0x08)
	struct UAnimMontage* WPN_Left_TP_Reload; // 0x6b0(0x08)
	struct UFXSystemAsset* CasingParticlesLeft; // 0x6b8(0x08)
	struct FName MuzzleLeft; // 0x6c0(0x08)
};

// Class FSD.DualWieldAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UDualWieldAnimInstance : UAnimInstance {
};

// Class FSD.DualMachinePistols
// Size: 0x6d8 (Inherited: 0x6c8)
struct ADualMachinePistols : ADualWieldWeapon {
	struct UStatusEffect* EmptyClipStatusEffect; // 0x6c8(0x08)
	char UnknownData_6D0[0x8]; // 0x6d0(0x08)

	void Server_TriggerStatusEffect(); // Function FSD.DualMachinePistols.Server_TriggerStatusEffect
};

// Class FSD.DynamicReverbComponent
// Size: 0x100 (Inherited: 0xb0)
struct UDynamicReverbComponent : UActorComponent {
	float LargeCaveValue; // 0xb0(0x04)
	float MediumCaveValue; // 0xb4(0x04)
	float SmallCaveValue; // 0xb8(0x04)
	float FadeTime; // 0xbc(0x04)
	float Priority; // 0xc0(0x04)
	char UnknownData_C4[0x3c]; // 0xc4(0x3c)

	void TimerTriggered(); // Function FSD.DynamicReverbComponent.TimerTriggered
};

// Class FSD.ElectroBeam
// Size: 0x2b8 (Inherited: 0x220)
struct AElectroBeam : AActor {
	struct UCapsuleComponent* Collider; // 0x220(0x08)
	struct TArray<struct AActor*> ParentPlants; // 0x228(0x10)
	struct FVector LocationOffset; // 0x238(0x0c)
	struct FVector_NetQuantize SourceLocation; // 0x244(0x0c)
	struct FVector_NetQuantize TargetLocation; // 0x250(0x0c)
	char UnknownData_25C[0x4]; // 0x25c(0x04)
	struct USceneComponent* DelaySource; // 0x260(0x08)
	struct USceneComponent* DelayTarget; // 0x268(0x08)
	struct UParticleSystemComponent* BeamEffect; // 0x270(0x08)
	struct UAudioComponent* ZappSound; // 0x278(0x08)
	struct TArray<struct UStatusEffect*> StatusEffectsToApply; // 0x280(0x10)
	float MaxLitTime; // 0x290(0x04)
	float MinLitTime; // 0x294(0x04)
	float MaxUnlitTime; // 0x298(0x04)
	float MinUnlitTime; // 0x29c(0x04)
	bool ShouldFlicker; // 0x2a0(0x01)
	bool IsLit; // 0x2a1(0x01)
	char UnknownData_2A2[0x16]; // 0x2a2(0x16)

	void SetTarget(struct USceneComponent* TargetPoint); // Function FSD.ElectroBeam.SetTarget
	void SetSource(struct USceneComponent* SourcePoint); // Function FSD.ElectroBeam.SetSource
	void SetParents(struct AActor* firstParent, struct AActor* secondParent); // Function FSD.ElectroBeam.SetParents
	void RecalculateBeam(); // Function FSD.ElectroBeam.RecalculateBeam
	void OnRep_TargetLocation(); // Function FSD.ElectroBeam.OnRep_TargetLocation
	void OnRep_SourceLocation(); // Function FSD.ElectroBeam.OnRep_SourceLocation
	void OnRep_Flag(); // Function FSD.ElectroBeam.OnRep_Flag
	void OnParentTwoDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.ElectroBeam.OnParentTwoDeath
	void OnParentOneDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.ElectroBeam.OnParentOneDeath
	struct UParticleSystemComponent* GetParticleEffect(); // Function FSD.ElectroBeam.GetParticleEffect
	struct UCapsuleComponent* GetCollider(); // Function FSD.ElectroBeam.GetCollider
	struct UAudioComponent* GetAudio(); // Function FSD.ElectroBeam.GetAudio
	void DelayedSetTarget(struct USceneComponent* TargetPoint); // Function FSD.ElectroBeam.DelayedSetTarget
	void DelayedSetSource(struct USceneComponent* SourcePoint); // Function FSD.ElectroBeam.DelayedSetSource
	void DeactivateCollisionAndEffect(); // Function FSD.ElectroBeam.DeactivateCollisionAndEffect
};

// Class FSD.SentryElectroBeam
// Size: 0x2c8 (Inherited: 0x2b8)
struct ASentryElectroBeam : AElectroBeam {
	struct TArray<struct ARedeployableSentryGun*> Sentries; // 0x2b8(0x10)
};

// Class FSD.ElevatorPlant
// Size: 0x2f0 (Inherited: 0x220)
struct AElevatorPlant : AActor {
	struct FMulticastInlineDelegate OnStartTimelineEvent; // 0x220(0x10)
	struct FMulticastInlineDelegate COnStateChangedEvent; // 0x230(0x10)
	struct UAudioComponent* MovingSoundComponent; // 0x240(0x08)
	struct USoundCue* GrabSound; // 0x248(0x08)
	struct FVector RestPositionOffset; // 0x250(0x0c)
	struct FVector RelativeRestLocation; // 0x25c(0x0c)
	struct FVector RelativeDestinationLocation; // 0x268(0x0c)
	struct FVector BaseTangentDirectionOffset; // 0x274(0x0c)
	struct FVector LeafTangentDirectionOffset; // 0x280(0x0c)
	struct FVector LeafLocationNoise; // 0x28c(0x0c)
	struct FRotator LeafNoiseRotator; // 0x298(0x0c)
	float BaseTangentLength; // 0x2a4(0x04)
	struct USplineMeshComponent* CSplineMesh; // 0x2a8(0x08)
	struct USceneComponent* CVineBase; // 0x2b0(0x08)
	struct USceneComponent* CVineLeaf; // 0x2b8(0x08)
	char UnknownData_2C0[0x10]; // 0x2c0(0x10)
	float InitialBaseTangentLength; // 0x2d0(0x04)
	float LeafLocationNoiseSize; // 0x2d4(0x04)
	float VineMovementAlpha; // 0x2d8(0x04)
	bool IsMoving; // 0x2dc(0x01)
	bool IsOpen; // 0x2dd(0x01)
	bool Extend; // 0x2de(0x01)
	char UnknownData_2DF[0x1]; // 0x2df(0x01)
	struct UCurveFloat* DipOffsetCurve; // 0x2e0(0x08)
	struct UCurveFloat* LocationLerpCurve; // 0x2e8(0x08)

	void SetLeafNoiseRotator(struct FRotator aRotator); // Function FSD.ElevatorPlant.SetLeafNoiseRotator
	void SetLeafLocationNoise(struct FVector aVector); // Function FSD.ElevatorPlant.SetLeafLocationNoise
	void SetIsOpen(bool aValue); // Function FSD.ElevatorPlant.SetIsOpen
	void SetIsExtended(bool aValue); // Function FSD.ElevatorPlant.SetIsExtended
	void SetBaseTangentLength(float Value); // Function FSD.ElevatorPlant.SetBaseTangentLength
