// WidgetBlueprintGeneratedClass HUD_CrossHair_FlareGun.HUD_CrossHair_FlareGun_C
// Size: 0x278 (Inherited: 0x230)
struct UHUD_CrossHair_FlareGun_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UImage* Dot; // 0x238(0x08)
	struct UImage* Image_2; // 0x240(0x08)
	struct UImage* Image_3; // 0x248(0x08)
	struct UImage* Image_5; // 0x250(0x08)
	struct UImage* Image_6; // 0x258(0x08)
	struct UImage* Image_7; // 0x260(0x08)
	struct UImage* Image_8; // 0x268(0x08)
	struct UImage* Image_9; // 0x270(0x08)

	void PreConstruct(bool IsDesignTime); // Function HUD_CrossHair_FlareGun.HUD_CrossHair_FlareGun_C.PreConstruct
	void ExecuteUbergraph_HUD_CrossHair_FlareGun(int32_t EntryPoint); // Function HUD_CrossHair_FlareGun.HUD_CrossHair_FlareGun_C.ExecuteUbergraph_HUD_CrossHair_FlareGun
};

