// WidgetBlueprintGeneratedClass ITM_Community_Console_ClaimReward.ITM_Community_Console_ClaimReward_C
// Size: 0x338 (Inherited: 0x250)
struct UITM_Community_Console_ClaimReward_C : UFSDUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UWidgetAnimation* LogoAnimation; // 0x258(0x08)
	struct UImage* Image_Faction; // 0x260(0x08)
	struct USizeBox* SydicateLogoBox; // 0x268(0x08)
	struct UUI_ImageTinted_C* SyndicateLogo; // 0x270(0x08)
	struct UBorder* TextBackground; // 0x278(0x08)
	struct UBorder* TextBorder; // 0x280(0x08)
	struct UUI_ImageTinted_C* UI_ImageTinted_C_1; // 0x288(0x08)
	struct UUI_ImageTinted_C* UI_ImageTinted_C_3; // 0x290(0x08)
	struct UUI_ImageTinted_C* UI_ImageTinted_C_4; // 0x298(0x08)
	struct UUI_ImageTinted_C* UI_ImageTinted_C_5; // 0x2a0(0x08)
	char IconColor; // 0x2a8(0x01)
	char UnknownData_2A9[0x7]; // 0x2a9(0x07)
	struct FSlateBrush IconBrush; // 0x2b0(0x88)

	void PreConstruct(bool IsDesignTime); // Function ITM_Community_Console_ClaimReward.ITM_Community_Console_ClaimReward_C.PreConstruct
	void ExecuteUbergraph_ITM_Community_Console_ClaimReward(int32_t EntryPoint); // Function ITM_Community_Console_ClaimReward.ITM_Community_Console_ClaimReward_C.ExecuteUbergraph_ITM_Community_Console_ClaimReward
};

