// WidgetBlueprintGeneratedClass ITM_MisSel_DotMarker.ITM_MisSel_DotMarker_C
// Size: 0x26c (Inherited: 0x230)
struct UITM_MisSel_DotMarker_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UImage* Icon1; // 0x238(0x08)
	struct UImage* Icon2; // 0x240(0x08)
	struct UImage* Icon3; // 0x248(0x08)
	struct USizeBox* SizeBox_2; // 0x250(0x08)
	struct USizeBox* SizeBox_3; // 0x258(0x08)
	struct USizeBox* SizeBox_4; // 0x260(0x08)
	float Size; // 0x268(0x04)

	void PreConstruct(bool IsDesignTime); // Function ITM_MisSel_DotMarker.ITM_MisSel_DotMarker_C.PreConstruct
	void SetData(int32_t Level); // Function ITM_MisSel_DotMarker.ITM_MisSel_DotMarker_C.SetData
	void ExecuteUbergraph_ITM_MisSel_DotMarker(int32_t EntryPoint); // Function ITM_MisSel_DotMarker.ITM_MisSel_DotMarker_C.ExecuteUbergraph_ITM_MisSel_DotMarker
};

