// WidgetBlueprintGeneratedClass ITM_MisSel_DotMarker_MissionLength.ITM_MisSel_DotMarker_MissionLength_C
// Size: 0x270 (Inherited: 0x230)
struct UITM_MisSel_DotMarker_MissionLength_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UImage* Icon1; // 0x238(0x08)
	struct UImage* Icon2; // 0x240(0x08)
	struct UImage* Icon3; // 0x248(0x08)
	struct USizeBox* SizeBox_3; // 0x250(0x08)
	struct USizeBox* SizeBox_4; // 0x258(0x08)
	struct USizeBox* SizeBox_5; // 0x260(0x08)
	float Size; // 0x268(0x04)
	float RenderAngle; // 0x26c(0x04)

	void PreConstruct(bool IsDesignTime); // Function ITM_MisSel_DotMarker_MissionLength.ITM_MisSel_DotMarker_MissionLength_C.PreConstruct
	void SetData(int32_t Level); // Function ITM_MisSel_DotMarker_MissionLength.ITM_MisSel_DotMarker_MissionLength_C.SetData
	void ExecuteUbergraph_ITM_MisSel_DotMarker_MissionLength(int32_t EntryPoint); // Function ITM_MisSel_DotMarker_MissionLength.ITM_MisSel_DotMarker_MissionLength_C.ExecuteUbergraph_ITM_MisSel_DotMarker_MissionLength
};

