// WidgetBlueprintGeneratedClass ITM_DeepDiveHeaderElite.ITM_DeepDiveHeaderElite_C
// Size: 0x280 (Inherited: 0x230)
struct UITM_DeepDiveHeaderElite_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UImage* Image_106; // 0x238(0x08)
	struct UImage* Image_108; // 0x240(0x08)
	struct UImage* Image_109; // 0x248(0x08)
	struct UImage* Image_110; // 0x250(0x08)
	struct UShadowBG_C* ShadowBG; // 0x258(0x08)
	struct UTextBlock* TextBlock_114; // 0x260(0x08)
	struct FText EliteContents; // 0x268(0x18)

	void SetEliteContents(struct FText EliteContents); // Function ITM_DeepDiveHeaderElite.ITM_DeepDiveHeaderElite_C.SetEliteContents
	void PreConstruct(bool IsDesignTime); // Function ITM_DeepDiveHeaderElite.ITM_DeepDiveHeaderElite_C.PreConstruct
	void ExecuteUbergraph_ITM_DeepDiveHeaderElite(int32_t EntryPoint); // Function ITM_DeepDiveHeaderElite.ITM_DeepDiveHeaderElite_C.ExecuteUbergraph_ITM_DeepDiveHeaderElite
};

