// WidgetBlueprintGeneratedClass TeleportPlayersUI.TeleportPlayersUI_C
// Size: 0x378 (Inherited: 0x230)
struct UTeleportPlayersUI_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UButton* AllToYou; // 0x238(0x08)
	struct UImage* BorderBottom; // 0x240(0x08)
	struct UImage* BorderBottom_2; // 0x248(0x08)
	struct UImage* BorderLeft; // 0x250(0x08)
	struct UImage* BorderLeft_2; // 0x258(0x08)
	struct UImage* BorderLeft_3; // 0x260(0x08)
	struct UImage* BorderLeft_4; // 0x268(0x08)
	struct UButton* DrillerToYou; // 0x270(0x08)
	struct UButton* EngineerToYou; // 0x278(0x08)
	struct UButton* GoToDanceFloor; // 0x280(0x08)
	struct UButton* GoToDeepDiveTerminal; // 0x288(0x08)
	struct UButton* GoToDriller; // 0x290(0x08)
	struct UButton* GoToEngineer; // 0x298(0x08)
	struct UButton* GoToGunner; // 0x2a0(0x08)
	struct UButton* GoToLeftOuterWalkway; // 0x2a8(0x08)
	struct UButton* GoToMidFloor; // 0x2b0(0x08)
	struct UButton* GoToMissionStart; // 0x2b8(0x08)
	struct UButton* GoToPromotion; // 0x2c0(0x08)
	struct UButton* GoToRightOuterWalkway; // 0x2c8(0x08)
	struct UButton* GoToScout; // 0x2d0(0x08)
	struct UButton* GoToStar; // 0x2d8(0x08)
	struct UButton* GoToTopFloor; // 0x2e0(0x08)
	struct UButton* GoToTopOfMemorialHall; // 0x2e8(0x08)
	struct UButton* GoToTopOfSpaceRig; // 0x2f0(0x08)
	struct UButton* GunnerToYou; // 0x2f8(0x08)
	struct UImage* Image; // 0x300(0x08)
	struct UImage* Image_2; // 0x308(0x08)
	struct UImage* Image_3; // 0x310(0x08)
	struct UImage* Image_4; // 0x318(0x08)
	struct UImage* Image_5; // 0x320(0x08)
	struct UImage* Image_6; // 0x328(0x08)
	struct UImage* Image_8; // 0x330(0x08)
	struct UImage* Image_9; // 0x338(0x08)
	struct UImage* Image_12; // 0x340(0x08)
	struct UImage* Image_640; // 0x348(0x08)
	struct UImage* Image_785; // 0x350(0x08)
	struct UImage* Image_987; // 0x358(0x08)
	struct UImage* Image_1410; // 0x360(0x08)
	struct UButton* ScoutToYou; // 0x368(0x08)
	struct AMod045_C* Teleport Players 045; // 0x370(0x08)

	void Construct(); // Function TeleportPlayersUI.TeleportPlayersUI_C.Construct
	void BndEvt__Button_880_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__Button_880_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__ScoutToYou_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__ScoutToYou_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	void BndEvt__AllToYou_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__AllToYou_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature
	void BndEvt__DrillerToYou_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__DrillerToYou_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GunnerToYou_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GunnerToYou_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToEngineer_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToEngineer_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToScout_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToScout_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToDriller_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToDriller_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToGunner_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToGunner_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToPromotion_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToPromotion_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToDanceFloor_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToDanceFloor_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToStar_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToStar_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToTopOfMemorialHall_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToTopOfMemorialHall_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToTopOfSpaceRig_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToTopOfSpaceRig_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToDeepDiveTerminal_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToDeepDiveTerminal_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToMidFloor_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToMidFloor_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToTopFloor_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToTopFloor_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToLeftOuterWalkway_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToLeftOuterWalkway_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToRightOuterWalkway_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToRightOuterWalkway_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature
	void BndEvt__GoToMissionStart_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature(); // Function TeleportPlayersUI.TeleportPlayersUI_C.BndEvt__GoToMissionStart_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature
	void ExecuteUbergraph_TeleportPlayersUI(int32_t EntryPoint); // Function TeleportPlayersUI.TeleportPlayersUI_C.ExecuteUbergraph_TeleportPlayersUI
};

