// WidgetBlueprintGeneratedClass UI_SpawnMenu.UI_SpawnMenu_C
// Size: 0x1230 (Inherited: 0x230)
struct UUI_SpawnMenu_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UCheckBox* AllowInSpaceRig_CheckBox; // 0x238(0x08)
	struct USpinBox* AutoPauseQueue_SpinBox; // 0x240(0x08)
	struct UW_TabButton_C* Config_TabButton; // 0x248(0x08)
	struct UW_TabButton_C* Creatures_TabButton; // 0x250(0x08)
	struct USpinBox* Delay_SpinBox; // 0x258(0x08)
	struct UW_Button_Basic2_C* DeleteButton; // 0x260(0x08)
	struct UCheckBox* Despawn_CheckBox; // 0x268(0x08)
	struct UW_Button_Basic2_C* DuplicateButton; // 0x270(0x08)
	struct UW_ProfileEditForm_C* EditProfileWidget; // 0x278(0x08)
	struct UW_TabButton_C* Environment_TabButton; // 0x280(0x08)
	struct UW_TabButton_C* Game_TabButton; // 0x288(0x08)
	struct UCheckBox* InteractivityEnabled_CheckBox; // 0x290(0x08)
	struct USpinBox* LifeTime_SpinBox; // 0x298(0x08)
	struct USpinBox* MaxDistance_SpinBox; // 0x2a0(0x08)
	struct USpinBox* MaxSlope_SpinBox; // 0x2a8(0x08)
	struct USpinBox* MinDistance_SpinBox; // 0x2b0(0x08)
	struct USpinBox* MinSlope_SpinBox; // 0x2b8(0x08)
	struct UW_Button_Basic2_C* NewProfileButton; // 0x2c0(0x08)
	struct USpinBox* OffsetX_SpinBox; // 0x2c8(0x08)
	struct USpinBox* OffsetY_SpinBox; // 0x2d0(0x08)
	struct USpinBox* OffsetZ_SpinBox; // 0x2d8(0x08)
	struct UCheckBox* OnAll_Checkbox; // 0x2e0(0x08)
	struct UCheckBox* OnDriller_Checkbox; // 0x2e8(0x08)
	struct UCheckBox* OnEngineer_Checkbox; // 0x2f0(0x08)
	struct UCheckBox* OnGunner_CheckBox; // 0x2f8(0x08)
	struct UCheckBox* OnHost_CheckBox; // 0x300(0x08)
	struct UCheckBox* OnRandom_Checkbox; // 0x308(0x08)
	struct UCheckBox* OnScout_CheckBox; // 0x310(0x08)
	struct UCheckBox* PreventSpawnsCheckBox; // 0x318(0x08)
	struct UScrollBox* ProfileEntriesScrollBox; // 0x320(0x08)
	struct UW_TabButton_C* Profiles_TabButton; // 0x328(0x08)
	struct USpinBox* QueueInterval_SpinBox; // 0x330(0x08)
	struct USpinBox* QueueIntialDelay_SpinBox; // 0x338(0x08)
	struct UW_TabButton_C* Resources_TabButton; // 0x340(0x08)
	struct USpinBox* RotationX_SpinBox; // 0x348(0x08)
	struct USpinBox* RotationY_SpinBox; // 0x350(0x08)
	struct USpinBox* RotationZ_SpinBox; // 0x358(0x08)
	struct UW_Button_Basic2_C* SaveButton; // 0x360(0x08)
	struct USpinBox* ScaleX_SpinBox; // 0x368(0x08)
	struct USpinBox* ScaleY_SpinBox; // 0x370(0x08)
	struct USpinBox* ScaleZ_SpinBox; // 0x378(0x08)
	struct UCheckBox* ShowNotifications_CheckBox; // 0x380(0x08)
	struct USpinBox* SpawnCount_SpinBox; // 0x388(0x08)
	struct UHorizontalBox* TabButtonsHorizontalBox; // 0x390(0x08)
	struct UW_TabButton_C* Tools_TabButton; // 0x398(0x08)
	struct UW_TitleBar_C* W_GroupSeparator; // 0x3a0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_2; // 0x3a8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_3; // 0x3b0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_4; // 0x3b8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_5; // 0x3c0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_6; // 0x3c8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_7; // 0x3d0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_8; // 0x3d8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_9; // 0x3e0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_10; // 0x3e8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_11; // 0x3f0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_12; // 0x3f8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_13; // 0x400(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_14; // 0x408(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_15; // 0x410(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_16; // 0x418(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_17; // 0x420(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_18; // 0x428(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_19; // 0x430(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_20; // 0x438(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_21; // 0x440(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_22; // 0x448(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_23; // 0x450(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_24; // 0x458(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_25; // 0x460(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_26; // 0x468(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_27; // 0x470(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_28; // 0x478(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_29; // 0x480(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_30; // 0x488(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_31; // 0x490(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_32; // 0x498(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_33; // 0x4a0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_34; // 0x4a8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_35; // 0x4b0(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_36; // 0x4b8(0x08)
	struct UW_TitleBar_C* W_GroupSeparator_37; // 0x4c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton; // 0x4c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_2; // 0x4d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_3; // 0x4d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_4; // 0x4e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_5; // 0x4e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_6; // 0x4f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_7; // 0x4f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_8; // 0x500(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_9; // 0x508(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_11; // 0x510(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_12; // 0x518(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_13; // 0x520(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_14; // 0x528(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_15; // 0x530(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_16; // 0x538(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_17; // 0x540(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_18; // 0x548(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_19; // 0x550(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_20; // 0x558(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_21; // 0x560(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_22; // 0x568(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_23; // 0x570(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_24; // 0x578(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_25; // 0x580(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_26; // 0x588(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_27; // 0x590(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_28; // 0x598(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_29; // 0x5a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_30; // 0x5a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_31; // 0x5b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_32; // 0x5b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_33; // 0x5c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_34; // 0x5c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_35; // 0x5d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_36; // 0x5d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_37; // 0x5e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_38; // 0x5e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_39; // 0x5f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_40; // 0x5f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_41; // 0x600(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_42; // 0x608(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_43; // 0x610(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_44; // 0x618(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_45; // 0x620(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_46; // 0x628(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_47; // 0x630(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_48; // 0x638(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_49; // 0x640(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_50; // 0x648(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_51; // 0x650(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_52; // 0x658(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_53; // 0x660(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_54; // 0x668(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_55; // 0x670(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_56; // 0x678(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_57; // 0x680(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_58; // 0x688(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_59; // 0x690(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_60; // 0x698(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_61; // 0x6a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_62; // 0x6a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_63; // 0x6b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_64; // 0x6b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_65; // 0x6c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_66; // 0x6c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_67; // 0x6d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_68; // 0x6d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_69; // 0x6e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_70; // 0x6e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_71; // 0x6f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_72; // 0x6f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_73; // 0x700(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_74; // 0x708(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_75; // 0x710(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_76; // 0x718(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_77; // 0x720(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_78; // 0x728(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_79; // 0x730(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_80; // 0x738(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_81; // 0x740(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_82; // 0x748(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_83; // 0x750(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_84; // 0x758(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_85; // 0x760(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_86; // 0x768(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_87; // 0x770(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_88; // 0x778(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_89; // 0x780(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_90; // 0x788(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_91; // 0x790(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_92; // 0x798(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_93; // 0x7a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_94; // 0x7a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_95; // 0x7b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_96; // 0x7b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_97; // 0x7c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_98; // 0x7c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_99; // 0x7d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_100; // 0x7d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_101; // 0x7e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_102; // 0x7e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_103; // 0x7f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_104; // 0x7f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_105; // 0x800(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_106; // 0x808(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_107; // 0x810(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_108; // 0x818(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_109; // 0x820(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_110; // 0x828(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_111; // 0x830(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_112; // 0x838(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_113; // 0x840(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_114; // 0x848(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_115; // 0x850(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_116; // 0x858(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_117; // 0x860(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_118; // 0x868(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_119; // 0x870(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_120; // 0x878(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_121; // 0x880(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_122; // 0x888(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_123; // 0x890(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_124; // 0x898(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_125; // 0x8a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_126; // 0x8a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_127; // 0x8b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_128; // 0x8b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_129; // 0x8c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_130; // 0x8c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_131; // 0x8d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_132; // 0x8d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_133; // 0x8e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_134; // 0x8e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_135; // 0x8f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_136; // 0x8f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_137; // 0x900(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_138; // 0x908(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_139; // 0x910(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_140; // 0x918(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_141; // 0x920(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_142; // 0x928(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_143; // 0x930(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_144; // 0x938(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_145; // 0x940(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_146; // 0x948(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_147; // 0x950(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_148; // 0x958(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_149; // 0x960(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_150; // 0x968(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_151; // 0x970(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_152; // 0x978(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_153; // 0x980(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_154; // 0x988(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_155; // 0x990(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_156; // 0x998(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_157; // 0x9a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_158; // 0x9a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_159; // 0x9b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_160; // 0x9b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_161; // 0x9c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_162; // 0x9c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_163; // 0x9d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_164; // 0x9d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_165; // 0x9e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_166; // 0x9e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_167; // 0x9f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_168; // 0x9f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_169; // 0xa00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_170; // 0xa08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_171; // 0xa10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_172; // 0xa18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_173; // 0xa20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_174; // 0xa28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_175; // 0xa30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_176; // 0xa38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_177; // 0xa40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_178; // 0xa48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_179; // 0xa50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_180; // 0xa58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_181; // 0xa60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_182; // 0xa68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_183; // 0xa70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_184; // 0xa78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_185; // 0xa80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_186; // 0xa88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_187; // 0xa90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_188; // 0xa98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_189; // 0xaa0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_190; // 0xaa8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_191; // 0xab0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_192; // 0xab8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_193; // 0xac0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_194; // 0xac8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_195; // 0xad0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_196; // 0xad8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_197; // 0xae0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_198; // 0xae8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_199; // 0xaf0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_200; // 0xaf8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_201; // 0xb00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_202; // 0xb08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_203; // 0xb10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_204; // 0xb18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_205; // 0xb20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_206; // 0xb28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_207; // 0xb30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_208; // 0xb38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_209; // 0xb40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_210; // 0xb48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_211; // 0xb50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_212; // 0xb58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_213; // 0xb60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_214; // 0xb68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_215; // 0xb70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_216; // 0xb78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_217; // 0xb80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_218; // 0xb88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_219; // 0xb90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_220; // 0xb98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_221; // 0xba0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_222; // 0xba8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_223; // 0xbb0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_224; // 0xbb8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_225; // 0xbc0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_226; // 0xbc8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_227; // 0xbd0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_228; // 0xbd8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_229; // 0xbe0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_230; // 0xbe8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_231; // 0xbf0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_232; // 0xbf8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_233; // 0xc00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_234; // 0xc08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_235; // 0xc10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_236; // 0xc18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_237; // 0xc20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_238; // 0xc28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_239; // 0xc30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_240; // 0xc38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_241; // 0xc40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_242; // 0xc48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_243; // 0xc50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_244; // 0xc58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_245; // 0xc60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_246; // 0xc68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_247; // 0xc70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_248; // 0xc78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_249; // 0xc80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_250; // 0xc88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_251; // 0xc90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_252; // 0xc98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_253; // 0xca0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_254; // 0xca8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_255; // 0xcb0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_256; // 0xcb8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_257; // 0xcc0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_258; // 0xcc8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_259; // 0xcd0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_260; // 0xcd8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_261; // 0xce0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_262; // 0xce8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_263; // 0xcf0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_264; // 0xcf8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_265; // 0xd00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_266; // 0xd08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_267; // 0xd10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_268; // 0xd18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_269; // 0xd20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_270; // 0xd28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_271; // 0xd30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_272; // 0xd38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_273; // 0xd40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_274; // 0xd48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_275; // 0xd50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_276; // 0xd58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_277; // 0xd60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_278; // 0xd68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_279; // 0xd70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_280; // 0xd78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_281; // 0xd80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_282; // 0xd88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_283; // 0xd90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_284; // 0xd98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_285; // 0xda0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_286; // 0xda8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_287; // 0xdb0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_288; // 0xdb8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_289; // 0xdc0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_290; // 0xdc8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_291; // 0xdd0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_292; // 0xdd8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_293; // 0xde0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_294; // 0xde8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_295; // 0xdf0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_296; // 0xdf8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_297; // 0xe00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_298; // 0xe08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_299; // 0xe10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_300; // 0xe18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_301; // 0xe20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_302; // 0xe28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_303; // 0xe30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_304; // 0xe38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_305; // 0xe40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_306; // 0xe48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_307; // 0xe50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_308; // 0xe58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_309; // 0xe60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_310; // 0xe68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_311; // 0xe70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_312; // 0xe78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_313; // 0xe80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_314; // 0xe88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_315; // 0xe90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_316; // 0xe98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_317; // 0xea0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_318; // 0xea8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_319; // 0xeb0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_320; // 0xeb8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_321; // 0xec0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_322; // 0xec8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_323; // 0xed0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_324; // 0xed8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_325; // 0xee0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_326; // 0xee8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_327; // 0xef0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_328; // 0xef8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_329; // 0xf00(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_330; // 0xf08(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_331; // 0xf10(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_332; // 0xf18(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_333; // 0xf20(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_334; // 0xf28(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_335; // 0xf30(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_336; // 0xf38(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_337; // 0xf40(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_338; // 0xf48(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_339; // 0xf50(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_340; // 0xf58(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_341; // 0xf60(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_342; // 0xf68(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_343; // 0xf70(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_344; // 0xf78(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_345; // 0xf80(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_346; // 0xf88(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_347; // 0xf90(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_348; // 0xf98(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_349; // 0xfa0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_350; // 0xfa8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_351; // 0xfb0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_352; // 0xfb8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_353; // 0xfc0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_354; // 0xfc8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_355; // 0xfd0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_356; // 0xfd8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_357; // 0xfe0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_358; // 0xfe8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_359; // 0xff0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_360; // 0xff8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_361; // 0x1000(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_362; // 0x1008(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_363; // 0x1010(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_364; // 0x1018(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_365; // 0x1020(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_366; // 0x1028(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_367; // 0x1030(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_368; // 0x1038(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_369; // 0x1040(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_370; // 0x1048(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_371; // 0x1050(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_372; // 0x1058(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_373; // 0x1060(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_374; // 0x1068(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_375; // 0x1070(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_378; // 0x1078(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_379; // 0x1080(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_380; // 0x1088(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_381; // 0x1090(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_382; // 0x1098(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_383; // 0x10a0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_384; // 0x10a8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_385; // 0x10b0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_386; // 0x10b8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_387; // 0x10c0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_388; // 0x10c8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_389; // 0x10d0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_390; // 0x10d8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_391; // 0x10e0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_392; // 0x10e8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_393; // 0x10f0(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_394; // 0x10f8(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_395; // 0x1100(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_396; // 0x1108(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_397; // 0x1110(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_752; // 0x1118(0x08)
	struct UW_Button_Spawn_C* W_SpawnButton_1009; // 0x1120(0x08)
	struct UWidgetSwitcher* WidgetSwitcher; // 0x1128(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_172; // 0x1130(0x08)
	struct FMulticastInlineDelegate On Settings Changed; // 0x1138(0x10)
	struct USpawnMenuSettingsSave_C* Settings Save Game; // 0x1148(0x08)
	struct FMulticastInlineDelegate On Spawn Button Clicked; // 0x1150(0x10)
	struct FMulticastInlineDelegate On Despawn Button Clicked; // 0x1160(0x10)
	struct FMulticastInlineDelegate On Interactivity Enabled Changed; // 0x1170(0x10)
	struct FMulticastInlineDelegate On Prevent Natural Creatures Changed; // 0x1180(0x10)
	struct FMulticastInlineDelegate On Queue Interval Changed; // 0x1190(0x10)
	struct TArray<struct UW_ProfileEntry_C*> Profile Entry Widgets; // 0x11a0(0x10)
	struct FMulticastInlineDelegate On Spawn Profile Group; // 0x11b0(0x10)
	struct TMap<struct FString, struct AActor*> Game Objects; // 0x11c0(0x50)
	struct TArray<struct FGuid> Added IDs; // 0x1210(0x10)
	struct TArray<struct FString> Expanded Groups; // 0x1220(0x10)

	void Expand Profile Group(struct FString Group Name, bool Is Expanded); // Function UI_SpawnMenu.UI_SpawnMenu_C.Expand Profile Group
	void Does Profile Group Exist(struct FString Group Name, bool Result); // Function UI_SpawnMenu.UI_SpawnMenu_C.Does Profile Group Exist
	void Get Game Object Name By Actor(struct AActor* Actor, struct FString Result); // Function UI_SpawnMenu.UI_SpawnMenu_C.Get Game Object Name By Actor
	void Generate Game Objects(); // Function UI_SpawnMenu.UI_SpawnMenu_C.Generate Game Objects
	void Update Profile(struct FSpawnProfile Updated Profile); // Function UI_SpawnMenu.UI_SpawnMenu_C.Update Profile
	void Clear Profile Entries(); // Function UI_SpawnMenu.UI_SpawnMenu_C.Clear Profile Entries
	void Set Settings(struct USpawnMenuSettingsSave_C* Settings); // Function UI_SpawnMenu.UI_SpawnMenu_C.Set Settings
