// BlueprintGeneratedClass BP_Halloween_CandleBlock.BP_Halloween_CandleBlock_C
// Size: 0x278 (Inherited: 0x220)
struct ABP_Halloween_CandleBlock_C : AActor {
	UPointLightComponent* PointLight4; // 0x220(0x08)
	UPointLightComponent* PointLight3; // 0x228(0x08)
	UStaticMeshComponent* StaticMesh2; // 0x230(0x08)
	UPointLightComponent* PointLight2; // 0x238(0x08)
	UStaticMeshComponent* StaticMesh1; // 0x240(0x08)
	UPointLightComponent* PointLight1; // 0x248(0x08)
	UStaticMeshComponent* StaticMesh; // 0x250(0x08)
	UPointLightComponent* PointLight; // 0x258(0x08)
	UStaticMeshComponent* Mesh_MainBlock; // 0x260(0x08)
	UStaticMeshComponent* Mesh_Flame01; // 0x268(0x08)
	USceneComponent* SharedRoot; // 0x270(0x08)
};

