// BlueprintGeneratedClass BP_SpaceRig_Cabin01.BP_SpaceRig_Cabin01_C
// Size: 0x3c0 (Inherited: 0x220)
struct ABP_SpaceRig_Cabin01_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220(0x08)
	UPointLightComponent* PointLight5; // 0x228(0x08)
	UStaticMeshComponent* StaticMeshComponent016; // 0x230(0x08)
	UPointLightComponent* PointLight4; // 0x238(0x08)
	UPointLightComponent* PointLight3; // 0x240(0x08)
	UPointLightComponent* PointLight2; // 0x248(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_0014; // 0x250(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_0013; // 0x258(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_0012; // 0x260(0x08)
	UStaticMeshComponent* SM_PosItNote_001; // 0x268(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_0011; // 0x270(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_0010; // 0x278(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_009; // 0x280(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_008; // 0x288(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_007; // 0x290(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_006; // 0x298(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_005; // 0x2a0(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_004; // 0x2a8(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_003; // 0x2b0(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_002; // 0x2b8(0x08)
	UStaticMeshComponent* SM_FireExtinguisher_001; // 0x2c0(0x08)
	UChildActorComponent* Monitor_MotivationalQuotes1; // 0x2c8(0x08)
	UStaticMeshComponent* StaticMesh; // 0x2d0(0x08)
	UStaticMeshComponent* StaticMeshComponent018; // 0x2d8(0x08)
	UPointLightComponent* PointLight1; // 0x2e0(0x08)
	UPointLightComponent* PointLight; // 0x2e8(0x08)
	UWidgetComponent* Widget; // 0x2f0(0x08)
	UStaticMeshComponent* StaticMeshComponent017; // 0x2f8(0x08)
	UStaticMeshComponent* StaticMeshComponent015; // 0x300(0x08)
	UStaticMeshComponent* StaticMeshComponent014; // 0x308(0x08)
	UStaticMeshComponent* StaticMeshComponent013; // 0x310(0x08)
	UChildActorComponent* Monitor_MotivationalQuotes; // 0x318(0x08)
	UStaticMeshComponent* StaticMeshComponent012; // 0x320(0x08)
	UStaticMeshComponent* StaticMeshComponent011; // 0x328(0x08)
	UStaticMeshComponent* StaticMeshComponent010; // 0x330(0x08)
	UStaticMeshComponent* StaticMeshComponent09; // 0x338(0x08)
	UStaticMeshComponent* StaticMesh3; // 0x340(0x08)
	UStaticMeshComponent* StaticMeshComponent08; // 0x348(0x08)
	UStaticMeshComponent* StaticMeshComponent07; // 0x350(0x08)
	UStaticMeshComponent* StaticMeshComponent05; // 0x358(0x08)
	UStaticMeshComponent* StaticMesh2; // 0x360(0x08)
	UChildActorComponent* BP_MissionStats; // 0x368(0x08)
	USceneComponent* Scene1; // 0x370(0x08)
	UAudioComponent* SimpleConstant_steam_cue; // 0x378(0x08)
	UParticleSystemComponent* P_SpaceRig_GrateSteam01; // 0x380(0x08)
	UStaticMeshComponent* StaticMesh1; // 0x388(0x08)
	UStaticMeshComponent* SM_Vent_A_2m; // 0x390(0x08)
	UStaticMeshComponent* SM_Vent_A; // 0x398(0x08)
	UStaticMeshComponent* StaticMeshComponent06; // 0x3a0(0x08)
	UStaticMeshComponent* StaticMeshComponent04; // 0x3a8(0x08)
	UStaticMeshComponent* cabin; // 0x3b0(0x08)
	USceneComponent* Scene; // 0x3b8(0x08)

	void ReceiveBeginPlay();
	void Steam();
	void ExecuteUbergraph_BP_SpaceRig_Cabin01(int32_t EntryPoint);
};

