// WidgetBlueprintGeneratedClass UI_LockOn_Scanning.UI_LockOn_Scanning_C
// Size: 0x288 (Inherited: 0x230)
struct UUI_LockOn_Scanning_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	UWidgetAnimation* AnimScanning; // 0x238(0x08)
	UImage* Image_2; // 0x240(0x08)
	UImage* Image_3; // 0x248(0x08)
	UImage* Image_4; // 0x250(0x08)
	UImage* Image_5; // 0x258(0x08)
	UImage* Image_6; // 0x260(0x08)
	UImage* Image_7; // 0x268(0x08)
	UImage* Image_8; // 0x270(0x08)
	UImage* Image_9; // 0x278(0x08)
	UImage* Image_10; // 0x280(0x08)

	void Construct();
	void ExecuteUbergraph_UI_LockOn_Scanning(int32_t EntryPoint);
};

