// AnimBlueprintGeneratedClass ABP_InfectedMule.ABP_InfectedMule_C
// Size: 0xd48 (Inherited: 0x280)
struct UABP_InfectedMule_C : UConvertedRobotAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	FAnimNode_Root AnimGraphNode_Root; // 0x288(0x30)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2b8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2e0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x308(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x330(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x358(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x380(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x3a8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3d0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3f8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x420(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x448(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x470(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x498(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4c0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4e8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x510(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x538(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x560(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x5d8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x608(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x680(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x6b0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x728(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x758(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7d0(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x800(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x878(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x8a8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x920(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x950(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9c8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x9f8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa70(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xaa0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb18(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb48(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xbc0(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xbf0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc68(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc98(0xb0)

	void AnimGraph(FPoseLink AnimGraph);
	void ExecuteUbergraph_ABP_InfectedMule(int32_t EntryPoint);
};

