// AnimBlueprintGeneratedClass ABP_CaveShark.ABP_CaveShark_C
// Size: 0x1170 (Inherited: 0x410)
struct UABP_CaveShark_C : USharkAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x410(0x08)
	FAnimNode_Root AnimGraphNode_Root; // 0x418(0x30)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x448(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x470(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x498(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4c0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4e8(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x510(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x538(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x560(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x588(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5b0(0x28)
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5d8(0x28)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x600(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x678(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x6a8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x720(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x750(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x7c8(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x7f8(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x870(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x8a0(0x78)
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x918(0xc8)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x9e0(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa58(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xa88(0x78)
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb00(0x30)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb30(0x78)
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xba8(0xc8)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xc70(0xe0)
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xd50(0x30)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xd80(0xe0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xe60(0x78)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xed8(0xa0)
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xf78(0x30)
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xfa8(0xb0)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1058(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10f8(0x78)

	void AnimGraph(FPoseLink AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_TransitionResult_7B59457B40ABED780A6C1AAAF39812BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_TransitionResult_79C0F03847D5FAB39611FBAB18F98B8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_TransitionResult_2DEB15DC43FD1A6A099D4BA0017B182F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_TransitionResult_BE587DC84F6CF9E8442C988D7763B11D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_BlendSpacePlayer_FBA762CE47A85FF9DEAAC5966E6DC40B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_SequencePlayer_A6554B054EFDBD939F21A49F648951AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_BlendListByBool_94E55E644588911C5B7146ACC30BB7DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CaveShark_AnimGraphNode_TransitionResult_85364AAA437573A26A8EFA93D2995103();
	void ExecuteUbergraph_ABP_CaveShark(int32_t EntryPoint);
};

