// BlueprintGeneratedClass BP_Compressed_Gold.BP_Compressed_Gold_C
// Size: 0x368 (Inherited: 0x321)
struct ABP_Compressed_Gold_C : ABP_Gem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x08)
	UPointLightComponent* PointLight6; // 0x330(0x08)
	UPointLightComponent* PointLight5; // 0x338(0x08)
	UPointLightComponent* PointLight4; // 0x340(0x08)
	UPointLightComponent* PointLight3; // 0x348(0x08)
	UPointLightComponent* PointLight2; // 0x350(0x08)
	UPointLightComponent* PointLight1; // 0x358(0x08)
	UPointLightComponent* PointLight; // 0x360(0x08)

	void All_PlayDugFree();
	void Receive_OnDeposited(APlayerCharacter* fromPlayer);
	void ExecuteUbergraph_BP_Compressed_Gold(int32_t EntryPoint);
};

