// BlueprintGeneratedClass BP_DropPod_Base.BP_DropPod_Base_C
// Size: 0x83a (Inherited: 0x368)
struct ABP_DropPod_Base_C : AMiningPod {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368(0x08)
	UAutoCarverComponent* AutoCarverArm; // 0x370(0x08)
	UAudioComponent* Audio_Molly_Loadbeam; // 0x378(0x08)
	USkeletalMeshComponent* SK_DropPod_DroneBay; // 0x380(0x08)
	USkeletalMeshComponent* SK_DropPod_MuleBay; // 0x388(0x08)
	UBoxComponent* Ramp_DwarfDetector; // 0x390(0x08)
	UPathfinderCollisionComponent* PathfinderWalkable; // 0x398(0x08)
	UPathfinderCollisionComponent* PathfinderBlockerDrill_Walk; // 0x3a0(0x08)
	UPathfinderCollisionComponent* PathfinderBlockerDrill_Block; // 0x3a8(0x08)
	UStaticMeshComponent* Monitor_Right; // 0x3b0(0x08)
	UStaticMeshComponent* Monitor_Left; // 0x3b8(0x08)
	UStaticMeshComponent* DrillBlocker; // 0x3c0(0x08)
	UPointLightComponent* light_filler2; // 0x3c8(0x08)
	UPointLightComponent* light_filler1; // 0x3d0(0x08)
	UChildActorComponent* Widget_RandomCode6; // 0x3d8(0x08)
	UChildActorComponent* Widget_RandomCode5; // 0x3e0(0x08)
	UChildActorComponent* Widget_RandomCode4; // 0x3e8(0x08)
	UChildActorComponent* Widget_RandomCode3; // 0x3f0(0x08)
	UChildActorComponent* Widget_RandomCode1; // 0x3f8(0x08)
	UPointLightComponent* light_readySign1; // 0x400(0x08)
	USceneComponent* RedLights; // 0x408(0x08)
	UStaticMeshComponent* StaticMesh17; // 0x410(0x08)
	UPointLightComponent* light_display4; // 0x418(0x08)
	UPointLightComponent* light_display3; // 0x420(0x08)
	UStaticMeshComponent* SM_DropPod_ClimbTread; // 0x428(0x08)
	UStaticMeshComponent* SM_DropPod_ClimbTread3; // 0x430(0x08)
	UStaticMeshComponent* SM_DropPod_ClimbTread2; // 0x438(0x08)
	UStaticMeshComponent* SM_DropPod_ClimbTread1; // 0x440(0x08)
	USkeletalMeshComponent* OreBox_Left; // 0x448(0x08)
	USkeletalMeshComponent* OreBox_Right; // 0x450(0x08)
	USkeletalMeshComponent* OreBox_Back; // 0x458(0x08)
	UChildActorComponent* BP_TruckerBalls1; // 0x460(0x08)
	UChildActorComponent* BP_TruckerBalls; // 0x468(0x08)
	UStaticMeshComponent* StaticMesh16; // 0x470(0x08)
	UStaticMeshComponent* StaticMesh15; // 0x478(0x08)
	UStaticMeshComponent* StaticMesh14; // 0x480(0x08)
	UStaticMeshComponent* StaticMesh13; // 0x488(0x08)
	UStaticMeshComponent* StaticMesh12; // 0x490(0x08)
	UStaticMeshComponent* StaticMesh11; // 0x498(0x08)
	UPointLightComponent* PointLight15; // 0x4a0(0x08)
	UPointLightComponent* PointLight14; // 0x4a8(0x08)
	UPointLightComponent* PointLight13; // 0x4b0(0x08)
	UPointLightComponent* PointLight12; // 0x4b8(0x08)
	UPointLightComponent* PointLight11; // 0x4c0(0x08)
	UPointLightComponent* PointLight10; // 0x4c8(0x08)
	UPointLightComponent* PointLight9; // 0x4d0(0x08)
	UPointLightComponent* PointLight8; // 0x4d8(0x08)
	UPointLightComponent* PointLight7; // 0x4e0(0x08)
	UPointLightComponent* PointLight6; // 0x4e8(0x08)
	UPointLightComponent* PointLight5; // 0x4f0(0x08)
	UPointLightComponent* PointLight4; // 0x4f8(0x08)
	UBoxComponent* InSidePodArea; // 0x500(0x08)
	UOxygenSourceComponent* OxygenSource; // 0x508(0x08)
	UChildActorComponent* Widget_RandomCode2; // 0x510(0x08)
	UChildActorComponent* Widget_RandomCode; // 0x518(0x08)
	UChildActorComponent* Widget_MissionData; // 0x520(0x08)
	UChildActorComponent* Widget_CaveData; // 0x528(0x08)
	UChildActorComponent* Widget_DangerLevel2; // 0x530(0x08)
	UChildActorComponent* Widget_DangerLevel; // 0x538(0x08)
	UChildActorComponent* Widget_ResourceScreen2; // 0x540(0x08)
	UChildActorComponent* Widget_ResourceScreen; // 0x548(0x08)
	UAudioComponent* AudioCenter; // 0x550(0x08)
	UAudioComponent* AudioBack; // 0x558(0x08)
	UAudioComponent* AudioFront; // 0x560(0x08)
	UAudioComponent* AudioRight; // 0x568(0x08)
	UAudioComponent* AudioLeft; // 0x570(0x08)
	UAutoCarverComponent* PrettyCarver; // 0x578(0x08)
	UChildActorComponent* Widget_CountDown02; // 0x580(0x08)
	UChildActorComponent* Widget_CountDown01; // 0x588(0x08)
	UTerrainPlacementComponent* terrainPlacement; // 0x590(0x08)
	USphereComponent* KillSphere; // 0x598(0x08)
	UBoxComponent* DwarfChecker; // 0x5a0(0x08)
	UStaticMeshComponent* StaticMesh6; // 0x5a8(0x08)
	UStaticMeshComponent* StaticMesh10; // 0x5b0(0x08)
	UStaticMeshComponent* StaticMesh9; // 0x5b8(0x08)
	UStaticMeshComponent* StaticMesh8; // 0x5c0(0x08)
	UStaticMeshComponent* StaticMesh7; // 0x5c8(0x08)
	UPathfinderCollisionComponent* PathfinderBlocker; // 0x5d0(0x08)
	UBoxComponent* Box; // 0x5d8(0x08)
	USceneComponent* DonkeyReturnDropPosition; // 0x5e0(0x08)
	USceneComponent* DonkeySpawnPosition; // 0x5e8(0x08)
	USkeletalMeshComponent* Ramp; // 0x5f0(0x08)
	UChildActorComponent* BP_Drop_CamShake; // 0x5f8(0x08)
	UChildActorComponent* Spawn2; // 0x600(0x08)
	UChildActorComponent* Spawn1; // 0x608(0x08)
	UChildActorComponent* Spawn4; // 0x610(0x08)
	USkeletalMeshComponent* SK_DropPod_Drill; // 0x618(0x08)
	UWidgetComponent* Widget_SeatMonitorRight; // 0x620(0x08)
	UWidgetComponent* Widget_SeatMonitorLeft; // 0x628(0x08)
	UPointLightComponent* PointLight1; // 0x630(0x08)
	UPointLightComponent* PointLight; // 0x638(0x08)
	USceneComponent* floorCollision; // 0x640(0x08)
	UStaticMeshComponent* Spot2; // 0x648(0x08)
	UStaticMeshComponent* Spot1; // 0x650(0x08)
	USceneComponent* hull; // 0x658(0x08)
	USceneComponent* seats; // 0x660(0x08)
	USceneComponent* lights_interior; // 0x668(0x08)
	USkeletalMeshComponent* SK_DropPod_Airlock; // 0x670(0x08)
	UChildActorComponent* Spawn3; // 0x678(0x08)
	USimpleObjectInfoComponent* SimpleObjectInfo; // 0x680(0x08)
	UStaticMeshComponent* StaticMesh5; // 0x688(0x08)
	UStaticMeshComponent* StaticMesh4; // 0x690(0x08)
	UStaticMeshComponent* StaticMesh3; // 0x698(0x08)
	UStaticMeshComponent* StaticMesh2; // 0x6a0(0x08)
	UStaticMeshComponent* StaticMesh1; // 0x6a8(0x08)
	UStaticMeshComponent* StaticMesh; // 0x6b0(0x08)
	UStaticMeshComponent* Cone2; // 0x6b8(0x08)
	USpotLightComponent* SpotLight2; // 0x6c0(0x08)
	USpotLightComponent* SpotLight1; // 0x6c8(0x08)
	UStaticMeshComponent* Cone1; // 0x6d0(0x08)
	UStaticMeshComponent* SM_DropPod_Hull; // 0x6d8(0x08)
	UStaticMeshComponent* SM_DropPod_Hull_NoCol; // 0x6e0(0x08)
	UStaticMeshComponent* Seat_Empty4; // 0x6e8(0x08)
	UStaticMeshComponent* Seat_Empty3; // 0x6f0(0x08)
	UStaticMeshComponent* Seat_Empty2; // 0x6f8(0x08)
	UStaticMeshComponent* Seat_Empty1; // 0x700(0x08)
	UPointLightComponent* light_display2; // 0x708(0x08)
	UPointLightComponent* light_display1; // 0x710(0x08)
	float Timeline_1_LerpDelay_3C91DA044E3AE316CFE9988822F28BC8; // 0x718(0x04)
	float Timeline_1_Lerp_3C91DA044E3AE316CFE9988822F28BC8; // 0x71c(0x04)
	enum class ETimelineDirection Timeline_1__Direction_3C91DA044E3AE316CFE9988822F28BC8; // 0x720(0x01)
	UTimelineComponent* Timeline_2; // 0x728(0x08)
	float Timeline_5_LerpDelay_BD4E08A7452DF28657A134A2565D0A25; // 0x730(0x04)
	float Timeline_5_Lerp_BD4E08A7452DF28657A134A2565D0A25; // 0x734(0x04)
	enum class ETimelineDirection Timeline_5__Direction_BD4E08A7452DF28657A134A2565D0A25; // 0x738(0x01)
	UTimelineComponent* Timeline_6; // 0x740(0x08)
	float Timeline_0_RedLightIntensity_2F2B1CD4469260DD2E665FA77E175746; // 0x748(0x04)
	enum class ETimelineDirection Timeline_0__Direction_2F2B1CD4469260DD2E665FA77E175746; // 0x74c(0x01)
	UTimelineComponent* Timeline_1; // 0x750(0x08)
	float light_readysign_intensity; // 0x758(0x04)
	UAudioComponent* DrillSound; // 0x760(0x08)
	AMULE* MuleInstance; // 0x768(0x08)
	FTransform MuleTransform; // 0x770(0x30)
	bool MuleSequenceComplete; // 0x7a0(0x01)
	bool OpenDoorsOnLanding; // 0x7a1(0x01)
	bool UnloadMule; // 0x7a2(0x01)
	FTimerHandle CarverRotationTimer; // 0x7a8(0x08)
	bool ShouldTurnOnHeadlight; // 0x7b0(0x01)
	bool CanControlHeadlight; // 0x7b1(0x01)
	enum class DroppodDoorState DoorState; // 0x7b2(0x01)
	UMaterialInstanceDynamic* LightFlickerMaterial; // 0x7b8(0x08)
	UParticleSystemComponent* MulebayParticle; // 0x7c0(0x08)
	FMulticastInlineDelegate DoorStateChanged; // 0x7c8(0x10)
	FTransform MuleUnloadTransform; // 0x7e0(0x30)
	bool MuleBayOpen; // 0x810(0x01)
	FMulticastInlineDelegate OnMuleBayOpenedDispatch; // 0x818(0x10)
	TArray<AMULE*> MulesToCollect; // 0x828(0x10)
	bool CarvingComplete; // 0x838(0x01)
	bool MuleWasLoaded; // 0x839(0x01)

	void OnRep_MuleSequenceComplete();
	void CollectMule(AMULE* MULE);
	void OnRep_MuleUnloadTransform();
	void GetMuleUnloadTarget(AMULE* MULE, FTransform RelativeTransform);
	void EnableMulebay();
	void OnRep_DoorState();
	float OperateMuleBay(bool Open, UAnimMontage* Montage);
	bool AnyPlayersOnRamp();
	void HandleRampPhotosensitivity();
	void SetPathBlockersEnabled(bool enable);
	void DestroyIfClose(TArray<AActor*> Actors, float DistanceSQ);
	void RemoveDangerousCaveItems(float Distance);
	void SetAllPlayersAnsel(bool Active);
	FVector GetDonkeyReturnPickupLocation();
	void SetDoorState(enum class DroppodDoorState DoorState);
	void GetCountDown(bool First, ABP_Widget_DropPod_AltitudeMeter_C* AsBP Count Down Actor);
	void OnRep_MuleInstance();
	void OnMuleLoaded();
	void GetMule(ADonkeyCharacter* Donkey);
	void SetStandingDown(bool IsStandingDown);
	void CloseRamp();
	void OpenRamp();
	void OnAllPlayersLeftPod();
	void SetPreferredCharacter(UChildActorComponent* Spawn, UPlayerCharacterID* Class);
	void UserConstructionScript();
	void Timeline_5__FinishedFunc();
	void Timeline_5__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(AActor* OtherActor);
	void ReceiveActorEndOverlap(AActor* OtherActor);
	void StartDeparture();
	void OnDroppodImpact();
	void Start Donkey Unload Sequence();
	void Unload Donkey();
	void OnDrillingStarted();
	void Load Donkey(AMULE* MULE);
	void Fade to Black();
	void BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
	void BndEvt__DwarfChecker_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);
	void BndEvt__KillSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
	void DrillRotate();
	void OnCharacterEnter(APlayerCharacter* Character);
	void OnCharacterExit(APlayerCharacter* Character);
	void SetMuleInstance(ADonkeyCharacter* Donkey);
	void DropPodSetAnsel(bool Active);
	void AllSetAnsel(bool Active);
	void BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
	void BndEvt__InSidePodArea_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);
	void MakeTruckerDicesMove();
	void OnRep_RampState();
	void OnFirstPlayerLeftPod();
	void ReceiveDestroyed();
	void OnRepDoorState();
	void LowerMuleToGround();
	void OpenMuleBay();
	void OnMuleBayOpenedDispatch_Event_1();
	void OnGeneratedMissionChanged(UGeneratedMission* OutGeneratedMission);
	void ExecuteUbergraph_BP_DropPod_Base(int32_t EntryPoint);
	void OnMuleBayOpenedDispatch__DelegateSignature();
	void DoorStateChanged__DelegateSignature(enum class DroppodDoorState DoorState);
};

