// BlueprintGeneratedClass BP_EnorEmd.BP_EnorEmd_C
// Size: 0x370 (Inherited: 0x321)
struct ABP_EnorEmd_C : ABP_Gem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x08)
	UGemTracker* GemTracker; // 0x330(0x08)
	UPointLightComponent* PointLight6; // 0x338(0x08)
	UPointLightComponent* PointLight5; // 0x340(0x08)
	UPointLightComponent* PointLight4; // 0x348(0x08)
	UPointLightComponent* PointLight3; // 0x350(0x08)
	UPointLightComponent* PointLight2; // 0x358(0x08)
	UPointLightComponent* PointLight1; // 0x360(0x08)
	UPointLightComponent* PointLight; // 0x368(0x08)

	void All_PlayDugFree();
	void ExecuteUbergraph_BP_EnorEmd(int32_t EntryPoint);
};

