// BlueprintGeneratedClass BP_EscortDestination.BP_EscortDestination_C
// Size: 0x658 (Inherited: 0x260)
struct ABP_EscortDestination_C : AEscortDestination {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	UBP_Extractor_Shell_C* Layer3Break3_Shell3; // 0x268(0x08)
	UBP_Extractor_Shell_C* Layer3Break3_Shell2; // 0x270(0x08)
	UBP_Extractor_Shell_C* Layer3Break3_Shell1; // 0x278(0x08)
	UBP_Extractor_Shell_C* Layer3Break2_Shell2; // 0x280(0x08)
	UBP_Extractor_Shell_C* Layer3Break2_Shell1; // 0x288(0x08)
	UStaticMeshComponent* Layer3Break2; // 0x290(0x08)
	UStaticMeshComponent* Layer3Break1; // 0x298(0x08)
	UBP_Extractor_Shell_C* OuterBreak4_Shell4; // 0x2a0(0x08)
	UBP_Extractor_Shell_C* OuterBreak4_Shell3; // 0x2a8(0x08)
	UBP_Extractor_Shell_C* OuterBreak4_Shell2; // 0x2b0(0x08)
	UBP_Extractor_Shell_C* OuterBreak4_Shell1; // 0x2b8(0x08)
	UBP_Extractor_Shell_C* OuterBreak3_Shell3; // 0x2c0(0x08)
	UBP_Extractor_Shell_C* OuterBreak3_Shell2; // 0x2c8(0x08)
	UBP_Extractor_Shell_C* OuterBreak3_Shell1; // 0x2d0(0x08)
	UBP_Extractor_Shell_C* OuterBreak2_Shell3; // 0x2d8(0x08)
	UBP_Extractor_Shell_C* OuterBreak2_Shell2; // 0x2e0(0x08)
	UBP_Extractor_Shell_C* OuterBreak2_Shell1; // 0x2e8(0x08)
	UStaticMeshComponent* OuterBreak3; // 0x2f0(0x08)
	UStaticMeshComponent* OuterBreak2; // 0x2f8(0x08)
	UStaticMeshComponent* OuterBreak1; // 0x300(0x08)
	UAudioComponent* FlyingRocksEnergyLinkLoop; // 0x308(0x08)
	UBillboardComponent* BeamerSpawnLocation_10; // 0x310(0x08)
	UBillboardComponent* BeamerSpawnLocation_6; // 0x318(0x08)
	UBillboardComponent* BeamerSpawnLocation_11; // 0x320(0x08)
	UChildActorComponent* BP_Heartstone_Claw_04; // 0x328(0x08)
	USceneComponent* BeamersR; // 0x330(0x08)
	UBillboardComponent* BeamerSpawnLocation_8; // 0x338(0x08)
	UBillboardComponent* BeamerSpawnLocation_9; // 0x340(0x08)
	UBillboardComponent* BeamerSpawnLocation_3; // 0x348(0x08)
	UBillboardComponent* BeamerSpawnLocation_5; // 0x350(0x08)
	UBillboardComponent* BeamerSpawnLocation_13; // 0x358(0x08)
	UBillboardComponent* BeamerSpawnLocation_4; // 0x360(0x08)
	USphereComponent* Sphere12; // 0x368(0x08)
	USphereComponent* Sphere10; // 0x370(0x08)
	USphereComponent* Sphere9; // 0x378(0x08)
	USphereComponent* Sphere8; // 0x380(0x08)
	USphereComponent* Sphere7; // 0x388(0x08)
	USphereComponent* Sphere5; // 0x390(0x08)
	USphereComponent* Sphere4; // 0x398(0x08)
	USphereComponent* Sphere3; // 0x3a0(0x08)
	USphereComponent* Sphere2; // 0x3a8(0x08)
	USceneComponent* BeamersL; // 0x3b0(0x08)
	UParticleSystemComponent* P_Heartstone_AmbientDust; // 0x3b8(0x08)
	UParticleSystemComponent* P_CaveFX_heartstoneHangingDust; // 0x3c0(0x08)
	UStaticMeshComponent* Cone3; // 0x3c8(0x08)
	USpotLightComponent* SpotLight3; // 0x3d0(0x08)
	UPointLightComponent* PointLight3; // 0x3d8(0x08)
	USceneComponent* SpotlightCenter; // 0x3e0(0x08)
	UBillboardComponent* Check_25; // 0x3e8(0x08)
	UBillboardComponent* Check_24; // 0x3f0(0x08)
	UBillboardComponent* Check_23; // 0x3f8(0x08)
	UBillboardComponent* Check_22; // 0x400(0x08)
	UBillboardComponent* Check_21; // 0x408(0x08)
	UBillboardComponent* Check_20; // 0x410(0x08)
	UBillboardComponent* Check_19; // 0x418(0x08)
	UBillboardComponent* Check_18; // 0x420(0x08)
	UBillboardComponent* Check_17; // 0x428(0x08)
	UBillboardComponent* Check_16; // 0x430(0x08)
	UBillboardComponent* Check_15; // 0x438(0x08)
	UBillboardComponent* Check_14; // 0x440(0x08)
	UBillboardComponent* Check_13; // 0x448(0x08)
	UBillboardComponent* Check_12; // 0x450(0x08)
	UBillboardComponent* Check_11; // 0x458(0x08)
	UBillboardComponent* Check_10; // 0x460(0x08)
	UBillboardComponent* Check_9; // 0x468(0x08)
	UBillboardComponent* Check_8; // 0x470(0x08)
	UBillboardComponent* Check_7; // 0x478(0x08)
	UBillboardComponent* Check_6; // 0x480(0x08)
	UBillboardComponent* Check_5; // 0x488(0x08)
	UBillboardComponent* Check_4; // 0x490(0x08)
	UBillboardComponent* Check_3; // 0x498(0x08)
	UBillboardComponent* Check_2; // 0x4a0(0x08)
	USceneComponent* PlatformChecks; // 0x4a8(0x08)
	UBillboardComponent* AoE_Origin; // 0x4b0(0x08)
	UDamageComponent* GroundSlamDamage; // 0x4b8(0x08)
	UTerrainScannerStaticMesh* TerrainScannerStaticMesh; // 0x4c0(0x08)
	ULevelGenerationDebris* LevelGenerationDebris_Ring_02; // 0x4c8(0x08)
	ULevelGenerationCarverComponent* 1_LevelGenerationCarver_Floor; // 0x4d0(0x08)
	ULevelGenerationCarverComponent* 2_LevelGeneration_CleanCarver; // 0x4d8(0x08)
	UStaticMeshComponent* GunTower_Carver01; // 0x4e0(0x08)
	USceneComponent* ArenaCarvers; // 0x4e8(0x08)
	UStaticMeshComponent* CleanCraterCarver; // 0x4f0(0x08)
	USimpleObjectInfoComponent* SimpleObjectInfo; // 0x4f8(0x08)
	UChildActorComponent* BP_Heartstone_Claw_07; // 0x500(0x08)
	UChildActorComponent* BP_Heartstone_Claw_08; // 0x508(0x08)
	UChildActorComponent* BP_Heartstone_Claw_06; // 0x510(0x08)
	UChildActorComponent* BP_Heartstone_Claw_02; // 0x518(0x08)
	USceneComponent* Spikes; // 0x520(0x08)
	USpawnActorWithDebrisPosComponent* LaserClawDebrisPos; // 0x528(0x08)
	ULevelGenerationDebris* LevelGenerationDebris_Ring_01; // 0x530(0x08)
	ULevelGenerationDebris* LevelGenerationDebris_CORE; // 0x538(0x08)
	UStaticMeshComponent* Layer1Broken; // 0x540(0x08)
	UStaticMeshComponent* Layer1; // 0x548(0x08)
	UStaticMeshComponent* Layer2Broken; // 0x550(0x08)
	UStaticMeshComponent* Layer2; // 0x558(0x08)
	UStaticMeshComponent* Layer3Broken; // 0x560(0x08)
	UStaticMeshComponent* Layer3; // 0x568(0x08)
	UStaticMeshComponent* Layer4Broken; // 0x570(0x08)
	UStaticMeshComponent* Layer4; // 0x578(0x08)
	USceneComponent* HeartstoneMeshes; // 0x580(0x08)
	UPathfinderCollisionComponent* PathfinderCollision; // 0x588(0x08)
	UPointLightComponent* PointLight; // 0x590(0x08)
	USceneComponent* Rings; // 0x598(0x08)
	ULevelGenerationDebris* LevelGenerationDebris_MultipleRings; // 0x5a0(0x08)
	USceneComponent* GemSpawnPos; // 0x5a8(0x08)
	UTerrainPlacementComponent* terrainPlacement; // 0x5b0(0x08)
	USceneComponent* DefaultSceneRoot; // 0x5b8(0x08)
	int32_t Stage; // 0x5c0(0x04)
	UEscortObjective* EscortObj; // 0x5c8(0x08)
	int32_t SmarkRockSpawnGroups; // 0x5d0(0x04)
	UEWC_Escort_EndDefense_C* WaveController_FinalFight; // 0x5d8(0x08)
	int32_t SmartRockSpawnIndex; // 0x5e0(0x04)
	float SmartRockGropuDelay; // 0x5e4(0x04)
	TArray<ABP_Heartstone_DefensiveCrystal_C*> DefensiveCrystals; // 0x5e8(0x10)
	bool IsMainCrystalWave; // 0x5f8(0x01)
	float LaserClawSpawnRadius; // 0x5fc(0x04)
	TArray<FVector> ForbiddenBeamerLocations; // 0x600(0x10)
	TArray<USceneComponent*> BeamerLocationsL; // 0x610(0x10)
	TArray<USceneComponent*> BeamerLocationsR; // 0x620(0x10)
	int32_t BeamerIndexL; // 0x630(0x04)
	int32_t BeamerIndexR; // 0x634(0x04)
	bool LRBeamerToggle; // 0x638(0x01)
	int32_t NumActiveFlyingRocks; // 0x63c(0x04)
	int32_t OuterShellMiniBreakStage; // 0x640(0x04)
	float prevBreakPoint; // 0x644(0x04)
	TArray<FVector> SpawnPoints; // 0x648(0x10)

	void Update Shell Break Sub Stage();
	void OnRep_OuterShellMiniBreakStage();
	void OnRep_Stage();
	void ReleaseShellCustom(UBP_Extractor_Shell_C* Shell);
	void OnRep_NumActiveFlyingRocks();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void DrillingComplete();
	void CountdownTimeChanged(float Progress);
	void NewStage();
	void SpawnRocks(int32_t SpawnCountPerGroup, int32_t NumGroups);
	void GrowLaserClaws();
	void DoBrokenShellEffects();
	void OnObjectiveUpdated(UObjective* Objective);
	void RegisterCrystal(ABP_Heartstone_DefensiveCrystal_C* Crystal);
	void DoAoEPush();
	void CheckForEngPlatofrms();
	void MoreLaserClaws();
	void TurnOffBrokenSHellEmissive();
	void OnPickedUp_Event_1();
	void TurnSpotOff();
	void SpawnBeamer();
	void DisableAllBeamers();
	void RegisterFlyingRock();
	void DeRegisterFlyingRock();
	void Spawn Group();
	void ExecuteUbergraph_BP_EscortDestination(int32_t EntryPoint);
};

