// BlueprintGeneratedClass BP_TutorialManager_Base.BP_TutorialManager_Base_C
// Size: 0x310 (Inherited: 0x260)
struct ABP_TutorialManager_Base_C : ATutorialManager {
	UTutorial_Hint_Refinery_BoscoBuilding_C* Tutorial_Hint_Refinery_BoscoBuilding; // 0x260(0x08)
	UTutorial_Hint_Escort_BoscoOilShale_C* Tutorial_Hint_Escort_BoscoOilShale; // 0x268(0x08)
	UTutorial_Hint_LowO2_C* Tutorial_Hint_LowO2; // 0x270(0x08)
	UTutorial_Hint_Escort_Repair_C* Tutorial_Hint_Escort_Repair; // 0x278(0x08)
	UTutorial_Hint_Escort_BoscoDefend_C* Tutorial_Hint_Escort_BoscoDefend; // 0x280(0x08)
	UTutorial_Hint_LowOnAmmo_C* Tutorial_Hint_LowOnAmmo; // 0x288(0x08)
	UTutorial_Hint_Resupply_C* Tutorial_Hint_Resupply; // 0x290(0x08)
	UTutorial_Hint_Nitra_C* Tutorial_Hint_Nitra; // 0x298(0x08)
	UTutorial_Hint_EquipTraversalTool_C* Tutorial_Hint_EquipTraversalTool; // 0x2a0(0x08)
	UTutorial_Hint_EquipSecondaryWeapon_C* Tutorial_Hint_EquipSecondaryWeapon; // 0x2a8(0x08)
	UTutorial_Hint_EquipGrenade_C* Tutorial_Hint_EquipGrenade; // 0x2b0(0x08)
	UTutorial_Hint_EquipClassTool_C* Tutorial_Hint_EquipClassTool; // 0x2b8(0x08)
	UTutorial_Hint_BoscoFirstSoloMission_C* Tutorial_Hint_BoscoFirstSoloMission; // 0x2c0(0x08)
	UTutorial_Hint_MinersManual_C* Tutorial_Hint_MinersManual; // 0x2c8(0x08)
	UTutorial_ThrowCarriable_C* Tutorial_ThrowCarriable; // 0x2d0(0x08)
	UTutorial_Hint_FocusShot_C* Tutorial_FocusShot; // 0x2d8(0x08)
	UTutorial_Hint_BoscoAbility_C* Tutorial_Hint_BoscoAbility; // 0x2e0(0x08)
	UTutorial_Hint_EggMissionTerrainScanner_C* Tutorial_Hint_EggMissionTerrainScanner; // 0x2e8(0x08)
	UTutorial_Hint_Deposite_C* Tutorial_Hint_Deposite; // 0x2f0(0x08)
	UTutorial_Hint_LaserPointer_C* Tutorial_Hint_LaserPointer; // 0x2f8(0x08)
	UTutorial_Hint_Flares_C* Tutorial_Hint_Flares; // 0x300(0x08)
	USceneComponent* DefaultSceneRoot; // 0x308(0x08)
};

