// Class FSD.AcceptInviteBlueprintCallProxy
// Size: 0x88 (Inherited: 0x30)
struct UAcceptInviteBlueprintCallProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	UObject* WorldContextObject; // 0x50(0x08)

	UAcceptInviteBlueprintCallProxy* AcceptInvite(UObject* WorldContextObject, FString ListName, FString UserId);
};

// Class FSD.Objective
// Size: 0x150 (Inherited: 0xb0)
struct UObjective : UActorComponent {
	FMulticastInlineDelegate OnObjectiveUpdated; // 0xb0(0x10)
	UObjectiveWidget* ObjectiveWidgetClass; // 0xc8(0x08)
	FMissionShouts MissionShouts; // 0xd0(0x38)
	FText MissionDescription; // 0x108(0x18)
	int32_t CompletionRewardInCredits; // 0x120(0x04)
	int32_t CompletionRewardInXP; // 0x124(0x04)
	bool ScaleObjectiveToMission; // 0x128(0x01)
	bool RequiredReturnObjectiveCompleted; // 0x129(0x01)
	UMissionStat* ObjectiveCompletedStat; // 0x130(0x08)
	int32_t IsPrimaryObjective; // 0x138(0x04)
	float MissionScale; // 0x13c(0x04)
	TArray<UBiome*> BannedInBiomes; // 0x140(0x10)

	void SignalObjectiveUpdated();
	void Receive_StartTracking();
	void OnRep_IsPrimaryObjective();
	bool IsTutorialObjective();
	bool IsPrimary();
	bool IsObjectiveResource(UResourceData* InResource);
	bool IsFinalBattle();
	bool IsCompleted();
	bool HasReplicated();
	UObjectiveWidget* GetWidgetClassOrDefault(UObjectiveWidget* DefaultWidgetClass);
	int32_t GetRewardXP();
	FCreditsReward GetRewardCredits();
	UOptionalObjectiveWidget* GetOptionalMissionWidget();
	FText GetObjectiveText();
	FObjectiveMissionIcon GetObjectiveMissionIconFromClass(UObjective* objectiveClass);
	UTexture2D* GetObjectiveIconFromClass(UObjective* objectiveClass);
	UTexture2D* GetObjectiveIcon();
	FText GetObjectiveDescriptionFromClass(UObjective* objectiveClass, float missionLength);
	FText GetObjectiveDescription(float missionLength);
	int32_t GetObjectiveAmountFromClass(UObjective* objectiveClass, float missionLength);
	int32_t GetObjectiveAmount(float missionLength);
	FObjectiveMissionIcon GetMissionIcon();
	FText GetInMissionText();
	FText GetInMissionCounterText();
	UTexture2D* GetInMissionCounterIcon();
};

// Class FSD.ActivationOjective
// Size: 0x158 (Inherited: 0x150)
struct UActivationOjective : UObjective {
	int32_t ObjectivesFound; // 0x150(0x04)
	int32_t ObjectivesToFind; // 0x154(0x04)

	void OnRep_ObjectivesToFind(int32_t prevAmount);
	void OnRep_ObjectivesFound(int32_t prevAmount);
};

// Class FSD.ActivationObject
// Size: 0x230 (Inherited: 0x220)
struct AActivationObject : AActor {
	USingleUsableComponent* Usable; // 0x220(0x08)
	bool HasBeenUsed; // 0x228(0x01)

	void OnUsedBy(APlayerCharacter* User);
};

// Class FSD.ActorFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActorFunctionLibrary : UBlueprintFunctionLibrary {

	void UnlockSpecificCharacters(UObject* WorldContextObject, TArray<APlayerCharacter*> Characters, enum class ECharacterState UnlockIf, enum class ECharacterState UnlockTo);
	void UnlockCharacters(UObject* WorldContextObject);
	float TimeSince(UObject* WorldContextObject, float Time);
	void SetScalarParameters(FName ParameterName, float Value, TArray<UMaterialInstanceDynamic*> Materials);
	void PlayCueOnClient(APlayerController* Target, USoundCue* cue);
	void PlayCueOnAll(UObject* WorldContextObject, USoundCue* cue);
	float PingPong(float Time, float Length, bool normalize);
	float MoveTowards(float current, float End, float step);
	void LockSpecificCharactersIfState(UObject* WorldContextObject, TArray<APlayerCharacter*> Characters, enum class ECharacterState stateToLock);
	void LockSpecificCharacters(UObject* WorldContextObject, TArray<APlayerCharacter*> Characters);
	bool LockSpecificCharacterIfState(UObject* WorldContextObject, APlayerCharacter* Character, enum class ECharacterState LockIf, enum class ECharacterState LockTo);
	void LockCharacters(UObject* WorldContextObject);
	UWindowWidget* LoadWindowWidgetClass(TSoftClassPtr<UObject> WidgetClass);
	UUserWidget* LoadWidgetClass(TSoftClassPtr<UObject> WidgetClass);
	UObject* LoadClass(TSoftClassPtr<UObject> softReference);
	void KillActorWithEffects(AActor* Actor, USceneComponent* visualsToHide, USoundCue* deathSound, UFXSystemAsset* deathParticles, float particleScale, UPathfinderCollisionComponent* pathColliderToDisable);
	bool IsWeakPoint(UFSDPhysicalMaterial* Material);
	bool IsSingleplayer(UObject* WorldContextObject);
	bool IsInRangeOfLocalPlayer(AActor* toActor, float MinDistance, float MaxDistance);
	bool IsCloseToLocalPlayer(AActor* toActor, float Distance);
	int32_t GetTotalHeroLevels(UObject* WorldContextObject, UPlayerCharacterID* characterID);
	FGuid GetSaveGameIDFromCharacterID(UPlayerCharacterID* characterID);
	FGuid GetSavegameID(UObject* objectClass);
	TArray<APlayerCharacter*> GetPlayersInRange(UObject* WorldContextObject, FVector Origin, float Radius, bool MustBeAlive);
	int32_t GetPlayerCount(UObject* WorldContextObject);
	UItemID* GetItemID(AActor* itemClass);
	float GetHeroXP(UObject* WorldContextObject, UPlayerCharacterID* characterID);
	FText GetHeroSwitchToMessage(APlayerCharacter* playerClass);
	FString GetHeroSourceName(APlayerCharacter* playerClass);
	float GetHeroProgress(UObject* WorldContextObject, UPlayerCharacterID* characterID);
	FText GetHeroName(APlayerCharacter* playerClass);
	int32_t GetHeroLevel(UObject* WorldContextObject, UPlayerCharacterID* characterID);
	UInventoryList* GetHeroInventoryList(UPlayerCharacterID* characterID);
	FHeroInfo GetHeroInfo(APlayerCharacter* playerClass);
	UTexture2D* GetHeroImageSmall(APlayerCharacter* playerClass);
	UTexture2D* GetHeroImageFullSize(APlayerCharacter* playerClass);
	UTexture2D* GetHeroImage(APlayerCharacter* playerClass);
	FLinearColor GetHeroColor(APlayerCharacter* playerClass);
	UActorComponent* GetComponentFromClass(AActor* Actor, UActorComponent* ComponentClass);
	UActorComponent* GetComponentByClass(AActor* Actor, UActorComponent* ComponentClass);
	UPlayerCharacterID* GetCharacterIDFromCharacter(APlayerCharacter* Character);
	UPlayerCharacterID* GetCharacterID(APlayerCharacter* playerClass);
	TArray<APlayerCharacter*> GetAllPlayerCharacters(UObject* WorldContext);
	FVector GetActorTargetCenter(AActor* TargetActor);
	void FSDRemoveBlendable(UPostProcessComponent* PostProcessComponent, TScriptInterface<IBlendableInterface> InBlendableObject);
	void FSDRemoveAllWidgets(UObject* WorldContextObject);
	void FSDDumpCallStack(FString Msg);
	APlayerCharacter* FindNearestPlayerCharacter(UObject* WorldContextObject, FVector fromLocation, float MaxRadius, bool MustBeAlive, bool MustBeUnparalyzed, bool MustHaveLineOfSight);
	FVector FindLatejoinDroppodLocation(AFSDGameMode* GameMode);
	AActor* FindClosestEnemyFromLocation(FVector fromLocation, float Range, bool LineOfSightCheck, UObject* WorldContextObject, FVector Offset);
	AActor* FindClosestEnemyFromActor(AActor* FromActor, float Range, bool LineOfSightCheck, FGameplayTagQuery tagQuery, FVector Offset);
	void FadeMaterials(UObject* WorldContextObject, UMeshComponent* Mesh, float Duration);
	float EvaluateRuntimeCurve(UObject* WorldContextObject, FRuntimeFloatCurve Curve, float Time);
	void DamagePlayersInArea(FVector Origin, AActor* Instigator, float Damage, float Radius, UDamageClass* DamageClass);
	UHealthComponentBase* DamageIfInRange(float MaxDistance, float Damage, AActor* Target, AActor* Attacker, UDamageClass* DamageClass);
	void DamageAllInAreaExcept(FVector Origin, AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, TArray<AActor*> IgnoreActors, float friendlyFireModifier, UDamageClass* DamageClass);
	void DamageAllInArea(FVector Origin, AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, float friendlyFireModifier, UDamageClass* DamageClass);
	TArray<UMaterialInstanceDynamic*> CreateDynamicMaterialInstances(UMeshComponent* Mesh);
	float AddHeroXP(UObject* WorldContextObject, UPlayerCharacterID* characterID, float amount);
	void AddEnemyKill(APlayerCharacter* Instigator, UEnemyComponent* EnemyComponent, AFSDGameState* GameState);
	bool ActorMatchesTagQuery(FGameplayTagQuery Query, AActor* InActor);
};

// Class FSD.StatusEffectsFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UStatusEffectsFunctionLibrary : UBlueprintFunctionLibrary {

	float GetMaxResistance(UStatusEffect* StatusEffect);
	UDamageClass* GetDamageClass(UStatusEffect* StatusEffect);
	bool CanTrigger(UStatusEffect* StatusEffect, AActor* OtherActor);
};

// Class FSD.FrontendBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFrontendBlueprintLibrary : UBlueprintFunctionLibrary {

	void OpenURLInExternalBrowser(FString URL);
	bool IsShippingBuild();
	enum class EFSDTargetPlatform FSDTargetPlatform();
};

// Class FSD.GameModeFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UGameModeFunctionLibrary : UBlueprintFunctionLibrary {

	FTransform FindRandomEscapePodLocation(UObject* WorldContextObject);
	FTransform FindEscapePodLocationAtDistance(UObject* WorldContextObject, float Distance, float aboveDistanceBias, AActor* optionalFrom);
};

// Class FSD.FSDConversionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFSDConversionLibrary : UBlueprintFunctionLibrary {

	FVector_NetQuantizeNormal VectorToNetQuantizeNormal(FVector Vec);
	FVector_NetQuantize VectorToNetQuantize(FVector Vec);
	FVector QuatToVector(FQuat Quat);
	FRotator QuatToRotator(FQuat Quat);
	FVector_NetQuantizeNormal QuadToNetQuantizeNormal(FQuat Quat);
	FVector ComponentToWorldLocation(USceneComponent* Component);
	FVector ActorToWorldLocation(AActor* Actor);
};

// Class FSD.ActorStateComponent
// Size: 0x100 (Inherited: 0xb0)
struct UActorStateComponent : UActorComponent {
	FMulticastInlineDelegate OnBeginState; // 0xb0(0x10)
	FMulticastInlineDelegate OnTickState; // 0xc0(0x10)
	FMulticastInlineDelegate OnEndState; // 0xd0(0x10)
	UActorStateComponent* CurrentState; // 0xe0(0x08)
	UActorStateComponent* NextState; // 0xe8(0x08)
	UActorStateComponent* MasterState; // 0xf0(0x08)
	float StateActiveTime; // 0xf8(0x04)

	void OnRep_CurrentState(UActorStateComponent* PreviousState);
	bool IsStateActive();
	void GotoState();
};

// Class FSD.FSDUserWidget
// Size: 0x250 (Inherited: 0x230)
struct UFSDUserWidget : UUserWidget {
	FMulticastInlineDelegate OnVisibilityChanged; // 0x230(0x10)
	APlayerCharacter* Character; // 0x248(0x08)

	void SetOpacity(float alpha);
	void ScaleByBaseResolution();
	void Refresh();
	void ReceiveNewVisibility(enum class ESlateVisibility NewVisibility);
	void OnCloseMenuReleased(bool Handled);
	void OnCloseMenuPressed(bool Handled);
	bool HasCharacter();
	float GetOpacity();
	AFSDPlayerState* GetFSDPlayerState();
	AItem* GetEquippedItem();
	float GetBaseResolutionScale();
	void BP_OnRefresh();
};

// Class FSD.ActorTrackingWidget
// Size: 0x278 (Inherited: 0x250)
struct UActorTrackingWidget : UFSDUserWidget {
	TWeakObjectPtr<USceneComponent> TargetComponent; // 0x250(0x08)
	float WorldHeightOffset; // 0x258(0x04)
	float ScaleBy; // 0x25c(0x04)
	FMargin ScreenMargin; // 0x260(0x10)
	int32_t WidgetZOrder; // 0x270(0x04)
	bool bTrackCenterOfMass; // 0x274(0x01)

	void SetTargetComponent(USceneComponent* Component);
	void SetTarget(AActor* Actor);
	void OnTargetSet(AActor* NewTarget);
	void OnTargetDistanceChanged(float Distance);
	void OnShow();
	void OnInViewChanged(bool inView, float Angle);
	AActor* GetTarget();
	FVector2D GetRenderTranslation();
	bool FindScreenPosition(APlayerController* PlayerController, FVector WorldLocation, FMargin Margin, FVector ScreenCord, float Angle);
	UActorTrackingWidget* CreateTrackingWidget(APlayerController* PlayerController, UActorTrackingWidget* WidgetType, USceneComponent* TargetComponent);
};

// Class FSD.ActorTrackingComponent
// Size: 0x210 (Inherited: 0x1f0)
struct UActorTrackingComponent : USceneComponent {
	UActorTrackingWidget* WidgetType; // 0x1f0(0x08)
	bool VisibleOnHoldTAB; // 0x1f8(0x01)
	bool VisibleFromStart; // 0x1f9(0x01)
	bool bIconHidden; // 0x1fa(0x01)
	TWeakObjectPtr<UActorTrackingWidget> Widget; // 0x1fc(0x08)

	void ToggleIcon(bool Visible);
	void OnHoldTAB(bool IsDown);
	bool IsIconVisible();
};

// Class FSD.AdicPuddle
// Size: 0x248 (Inherited: 0x220)
struct AAdicPuddle : AActor {
	USphereComponent* SphereTrigger; // 0x220(0x08)
	USoundBase* SpawnSound; // 0x228(0x08)
	UStatusEffect* InflictedStatusEffect; // 0x230(0x08)
	float LifeTime; // 0x240(0x04)

	void OnPuddleEndOverLap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);
	void OnPuddleBeginOverLap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
};

// Class FSD.AdventureObjective
// Size: 0x150 (Inherited: 0x150)
struct UAdventureObjective : UObjective {
};

// Class FSD.AfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UAfflictionEffect : UObject {

	bool ShouldInstantiate();
	void ReceiveEndEffect(UPawnAfflictionComponent* Target);
	void ReceiveBeginEffect(UPawnAfflictionComponent* Target);
};

// Class FSD.PawnFrozenUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnFrozenUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.PawnBurningUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnBurningUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SpawnAtLocationParticleAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct USpawnAtLocationParticleAfflictionEffect : UAfflictionEffect {
	FScaledEffect ScaledParticleEffect; // 0x28(0x10)
};

// Class FSD.AttachedParticlesAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct UAttachedParticlesAfflictionEffect : UAfflictionEffect {
	UFXSystemAsset* ParticleEffect; // 0x28(0x08)
	TArray<UFXSystemAsset*> ParticleEffects; // 0x30(0x10)
	enum class EAfflictionSocket Socket; // 0x40(0x01)
	bool ScaleToActor; // 0x41(0x01)
	bool UseVisibilityHack; // 0x42(0x01)
};

// Class FSD.CharacterShoutAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCharacterShoutAfflictionEffect : UAfflictionEffect {
	UDialogDataAsset* Shout; // 0x28(0x08)
};

// Class FSD.CameraParticleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCameraParticleAfflictionEffect : UAfflictionEffect {
	UParticleSystem* ParticleEffect; // 0x28(0x08)
};

// Class FSD.ShieldLinkedAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UShieldLinkedAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SoundAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct USoundAfflictionEffect : UAfflictionEffect {
	USoundCue* BeginSound; // 0x28(0x08)
	USoundCue* EndSound; // 0x30(0x08)
	bool Attach; // 0x38(0x01)
	FName AttachBone; // 0x3c(0x08)
	float FadeOnLoopEndDuration; // 0x44(0x04)
};

// Class FSD.AttachMeshesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAttachMeshesAfflictionEffect : UAfflictionEffect {
	TArray<FAttachMeshesAfflictionItem> AttachItems; // 0x28(0x10)
	UParticleSystem* OnRemoveEffect; // 0x38(0x08)
};

// Class FSD.FrozenAfflictionEffect
// Size: 0x58 (Inherited: 0x28)
struct UFrozenAfflictionEffect : UAfflictionEffect {
	TArray<FFrozenAfflictionItem> IceParts; // 0x28(0x10)
	UMaterialInterface* MaterialOverride; // 0x38(0x08)
	FName ParticleBone; // 0x40(0x08)
	TArray<UMaterialInterface*> IceMaterials; // 0x48(0x10)
};

// Class FSD.BurningAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UBurningAfflictionEffect : UAfflictionEffect {
	enum class EFrozenBitsSize FireParticleSize; // 0x28(0x01)
};

// Class FSD.StaggeredAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UStaggeredAfflictionEffect : UAfflictionEffect {
	float StaggerStrength; // 0x28(0x04)
};

// Class FSD.BoneParticlesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UBoneParticlesAfflictionEffect : UAfflictionEffect {
	TArray<UParticleSystem*> Particles; // 0x28(0x10)
	USoundCue* Sound; // 0x38(0x08)
};

// Class FSD.AnimatedItemParticleAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAnimatedItemParticleAfflictionEffect : UAfflictionEffect {
	enum class EItemCategory ItemCategory; // 0x28(0x01)
	UParticleSystem* ParticleEffect; // 0x30(0x08)
	FName Socket; // 0x38(0x08)
};

// Class FSD.PlayerCharacterMontageAfflictionEffect
// Size: 0x50 (Inherited: 0x28)
struct UPlayerCharacterMontageAfflictionEffect : UAfflictionEffect {
	UAnimMontage* FP_Montage; // 0x28(0x08)
	UAnimMontage* TP_Montage; // 0x30(0x08)
	float BlendOut; // 0x38(0x04)
	TArray<FName> RandomStarts; // 0x40(0x10)
};

// Class FSD.EnemySkinAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct UEnemySkinAfflictionEffect : UAfflictionEffect {
	TArray<UMaterialInterface*> NewMaterials; // 0x28(0x10)
};

// Class FSD.EnemyScaleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UEnemyScaleAfflictionEffect : UAfflictionEffect {
	float Scale; // 0x28(0x04)
	bool RevertOnEndEffect; // 0x2c(0x01)
};

// Class FSD.HeroEnemyAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UHeroEnemyAfflictionEffect : UAfflictionEffect {
	FGameplayTag TagToAdd; // 0x28(0x08)
};

// Class FSD.FSDPawn
// Size: 0x2e8 (Inherited: 0x280)
struct AFSDPawn : APawn {
	FMulticastInlineDelegate OnFrozenEvent; // 0x290(0x10)
	UStatusEffectsComponent* StatusEffects; // 0x2a0(0x08)
	UEnemyTemperatureComponent* Temperature; // 0x2a8(0x08)
	FGameplayTagContainer GameplayTags; // 0x2b0(0x20)
	UEnemyDescriptor* SpawnedFromDescriptor; // 0x2d0(0x08)
	bool IsFrozen; // 0x2d8(0x01)
	bool CanFlee; // 0x2d9(0x01)
	bool FleeInsteadOfBackingOff; // 0x2da(0x01)
	bool IsFleeing; // 0x2db(0x01)
	UPawnStatsComponent* PawnStatsInstance; // 0x2e0(0x08)

	void UnFreeze();
	void StopFleeing();
	void StartFleeing(FVector fromLocation);
	void SetAlerted(bool isAlerted);
	void Receive_Alerted();
	void OnUnFrozen();
	void OnStoppedFleeing();
	void OnStartedFleeing();
	void OnRep_IsFrozen();
	void OnFrozen(AActor* Source);
	void OnFirstHostileDamageTaken();
	void OnEnemyScaled(float NewScale);
	void OnArmorPartsDestroyedFromRadialDamage(TArray<char> destroyedParts);
	void OnAlerted();
	void MakeRagdollMesh(USkeletalMeshComponent* Mesh);
	void MakeElite();
	bool GetIsAlerted();
	UHealthComponentBase* GetHealthComponent();
	AFSDAIController* GetFSDAIController();
	enum class EPawnAttitude GetAttitude();
	void Freeze(AActor* Source);
	void BackOffFromLocation(FVector fromLocation);
	void All_ArmorPartsDestroyed(TArray<char> parts);
};

// Class FSD.DeepPathfinderCharacter
// Size: 0x378 (Inherited: 0x2e8)
struct ADeepPathfinderCharacter : AFSDPawn {
	UDeepPathfinderMovement* PathfinderMovement; // 0x2f8(0x08)
	USkeletalMeshComponent* Mesh; // 0x300(0x08)
	FName CenterMassSocketName; // 0x308(0x08)
	UDeepPatherFinderCharacterAfflictionComponent* affliction; // 0x310(0x08)
	float AnimationOffset; // 0x318(0x04)
	bool CanPlayerStandOn; // 0x31c(0x01)
	bool UseDormancy; // 0x31d(0x01)
	float StaggerDurationMultiplier; // 0x320(0x04)
	float StaggerImunityWindow; // 0x324(0x04)
	bool StaggerPauseLogic; // 0x328(0x01)
	bool IsHidden; // 0x329(0x01)
	bool IsStaggered; // 0x32a(0x01)
	bool FrozenPauseLogic; // 0x32b(0x01)
	float AttackerRadius; // 0x348(0x04)
	TArray<UMaterialInterface*> CachedMaterials; // 0x350(0x10)
	float AllowedInFormationChance; // 0x360(0x04)

	bool TryJoinFormation();
	void SetHidden(bool shouldHide);
	void OnPausedMovementElapsed();
	void OnControlledByPlayer(bool IsControlled, bool IsLocallyControlled);
	void LeaveFormation();
};

// Class FSD.FlyingDeepPathfinderCharacter
// Size: 0x3a8 (Inherited: 0x378)
struct AFlyingDeepPathfinderCharacter : ADeepPathfinderCharacter {
	UPhysicalMaterial* FrozenMaterial; // 0x388(0x08)
	UPhysicsAsset* FrozenAsset; // 0x390(0x08)
	USoundCue* FrozenDeathSound; // 0x398(0x08)
	UParticleSystem* FrozenDeathparticles; // 0x3a0(0x08)

	void TriggerFrozenRagdoll();
	void OnFreezeImpact(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult Hit);
	void BP_FreezeImpact();
};

// Class FSD.FlyingEnemyDeepPathfinderCharacter
// Size: 0x3c8 (Inherited: 0x3a8)
struct AFlyingEnemyDeepPathfinderCharacter : AFlyingDeepPathfinderCharacter {
	UEnemyHealthComponent* HealthComponent; // 0x3b0(0x08)
	FQueuedMontage QueuedMontage; // 0x3b8(0x10)

	void OnRep_QueuedMontage();
};

// Class FSD.AFlyingBug
// Size: 0x478 (Inherited: 0x3c8)
struct AAFlyingBug : AFlyingEnemyDeepPathfinderCharacter {
	UEnemyComponent* EnemyComponent; // 0x3c8(0x08)
	UPawnStatsComponent* PawnStats; // 0x3d0(0x08)
	UOutlineComponent* outline; // 0x3d8(0x08)
	UPawnSensingComponent* Senses; // 0x3e0(0x08)
	UPawnAlertComponent* Alert; // 0x3e8(0x08)
	USphereComponent* ExplosionSphere; // 0x3f0(0x08)
	UAudioComponent* WingSoundComponent; // 0x3f8(0x08)
	FMulticastInlineDelegate OnStartFizzle; // 0x400(0x10)
	TArray<UAnimSequenceBase*> HitReactions; // 0x410(0x10)
	FVector_NetQuantize RagdollImpact; // 0x420(0x0c)
	AActor* RotateTarget; // 0x440(0x08)
	UPhysicsAsset* PhysicalAssetAfterDeath; // 0x448(0x08)
	USoundBase* ChatterSound; // 0x450(0x08)
	float FirstHitReactBlendIn; // 0x458(0x04)
	float OverrideHitReactBlendIn; // 0x45c(0x04)
	float DistanceForAttackMode; // 0x460(0x04)
	float MinChatterDelay; // 0x464(0x04)
	float MaxChatterDelay; // 0x468(0x04)
	float AttackModeRotationSpeed; // 0x46c(0x04)
	bool UsesAttackStance; // 0x470(0x01)
	bool SetLifeTime; // 0x471(0x01)
	bool AttackStance; // 0x472(0x01)
	bool LookStraight; // 0x473(0x01)
	bool UseDefaultRagdoll; // 0x474(0x01)

	void StartFizzle();
	void SetRotateTarget(AActor* aTarget);
	void SetExternallyControlled(bool isExternallyControlled);
	void SetAttackStance(bool isAttackStance);
	void Ragdoll(bool applyForce, FVector force);
	void PlayVoice();
	void OnRep_RagdollImpact();
	void OnRep_AttackStance();
	void OnRagdoll();
	void OnDamaged(float amount);
	void OnBugDeath(UHealthComponentBase* Health);
	float GetMidZpointFromCielingAndFloor(float distanceFromCieling, float distanceFromFloor);
	bool GetIsInAttackStance();
	void AlertNearbyEnemies();
};

// Class FSD.EnemyAnimInstance
// Size: 0x2c0 (Inherited: 0x270)
struct UEnemyAnimInstance : UAnimInstance {
	FMulticastInlineDelegate OnRangedAttackNotify; // 0x268(0x10)
	FMulticastInlineDelegate OnMeleeAttackNotify; // 0x278(0x10)
	FMulticastInlineDelegate OnStopLeadingNotify; // 0x288(0x10)
	FMulticastInlineDelegate OnIsAttackingChanged; // 0x298(0x10)
	bool IsAttacking; // 0x2a8(0x01)
	bool IsAlive; // 0x2a9(0x01)
	float RandomStartPosition; // 0x2ac(0x04)
	UHealthComponentBase* HealthComponent; // 0x2b0(0x08)

	bool IsSlotPlayingAnyAnimation(FName SlotNodeName);
	USkeletalMeshComponent* GetSkeletalMesh();
};

// Class FSD.SimpleMovingEnemyAnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct USimpleMovingEnemyAnimInstance : UEnemyAnimInstance {
	float Speed; // 0x2b8(0x04)
	FVector Velocity; // 0x2bc(0x0c)
	float WalkCycleSpeed; // 0x2c8(0x04)
	float StartMovingSpeed; // 0x2cc(0x04)
	float StopMovingSpeed; // 0x2d0(0x04)
	float WalkCycleMinRate; // 0x2d4(0x04)
	float WalkCyclePlayRate; // 0x2d8(0x04)
	float MeshScale; // 0x2dc(0x04)
	bool IsMoving; // 0x2e0(0x01)

	void SetMeshScale(float NewScale);
};

// Class FSD.FlyingBugAnimInstance
// Size: 0x2f0 (Inherited: 0x2f0)
struct UFlyingBugAnimInstance : USimpleMovingEnemyAnimInstance {
	bool IsInAttackMode; // 0x2e8(0x01)
	bool IsStaggered; // 0x2e9(0x01)
};

// Class FSD.AIFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIFunctionLibrary : UBlueprintFunctionLibrary {

	void SetAICanSense(bool canSense);
	int32_t MakeEnemiesFleeFromArea(UObject* WorldContextObject, FVector Center, float Radius, int32_t maxEnemiesAffected);
	void MakeEnemiesBackOutOfArea(UObject* WorldContextObject, FVector Center, float Radius);
	bool IsEnemyAlertet(APawn* enemy);
	APlayerCharacter* GetPlayerTarget(AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, AActor* ignoreTarget, bool IsFlying);
	UAttackerPositioningComponent* GetAttackableTarget(AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, AActor* ignoreTarget, bool IsFlying);
	APlayerCharacter* ConsiderChangingTarget(APlayerCharacter* CurrentTarget, AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool CurrentTargetMustBeAlive, bool IsFlying);
	void AlertEnemy(APawn* enemy);
	void AlertEnemiesInRange(UObject* WorldContextObject, FVector Origin, float Range, APawn* alerter);
};

// Class FSD.AIPlayerControlComponent
// Size: 0x160 (Inherited: 0xb0)
struct UAIPlayerControlComponent : UActorComponent {
	FRotator AngularAcceleration; // 0xb0(0x0c)
	FRotator AngularDampening; // 0xbc(0x0c)
	FRotator MaxAngularVelocity; // 0xc8(0x0c)
	FRotator MaxRotation; // 0xd4(0x0c)
	float SpeedTarget; // 0xe0(0x04)
	float SpeedMin; // 0xe4(0x04)
	float SpeedMax; // 0xe8(0x04)
	float AccelerationBase; // 0xec(0x04)
	float AccelerationMultiplier; // 0xf0(0x04)
	float DecelerationMultiplier; // 0xf4(0x04)
	float AccelerationOnSlopeMultiplier; // 0xf8(0x04)
	float DecelerationOnSlopeMultiplier; // 0xfc(0x04)
	float InitialConnectionBlendTime; // 0x100(0x04)
	UAnimMontage* GetOnMontageAI; // 0x108(0x08)
	UAnimMontage* GetOnMontagePlayer; // 0x110(0x08)
	UAnimMontage* LetGoMontageAI; // 0x118(0x08)
	UAnimMontage* LetGoMontagePlayer; // 0x120(0x08)
	UDialogDataAsset* GetOnShout; // 0x128(0x08)
	UDialogDataAsset* LetGoShout; // 0x130(0x08)
	UControlEnemyUsable* Usable; // 0x138(0x08)
};

// Class FSD.EnemyGroupDescriptor
// Size: 0x50 (Inherited: 0x30)
struct UEnemyGroupDescriptor : UDataAsset {
	TArray<FEnemyGroupDescriptorItem> Enemies; // 0x30(0x10)
	FRandInterval Diversity; // 0x40(0x10)
};

// Class FSD.AmberEventEnemyPool
// Size: 0x68 (Inherited: 0x50)
struct UAmberEventEnemyPool : UEnemyGroupDescriptor {
	float MaxTimeBetweenSpawn; // 0x50(0x04)
	float MinTimeBetweenSpawn; // 0x54(0x04)
	int32_t MaxEnemyCap; // 0x58(0x04)
	int32_t AmbersNeededdToComplete; // 0x5c(0x04)
	int32_t AmbersNeededOnePlayer; // 0x60(0x04)
};

// Class FSD.GameEvent
// Size: 0x358 (Inherited: 0x220)
struct AGameEvent : AActor {
	FMulticastInlineDelegate EventTriggeredDelegate; // 0x228(0x10)
	FMulticastInlineDelegate EventFinishedDelegate; // 0x238(0x10)
	FMulticastInlineDelegate StageCompleteDelegate; // 0x248(0x10)
	FMulticastInlineDelegate ProgressChangedDelegate; // 0x258(0x10)
	FMulticastInlineDelegate TimeProgressChanged; // 0x268(0x10)
	FMulticastInlineDelegate ObjectivesPerStageChanged; // 0x278(0x10)
	TArray<AEventStarterButton*> StarterObjects; // 0x288(0x10)
	bool bGameEventSetup; // 0x298(0x01)
	FText EventName; // 0x2a0(0x18)
	FText ObjectiveText; // 0x2b8(0x18)
	FName AnalyticsName; // 0x2d0(0x08)
	FGameplayTagContainer GameplayTags; // 0x2d8(0x20)
	UChildActorComponent* StartEventObject; // 0x2f8(0x08)
	UDialogDataAsset* EventTriggeredShout; // 0x300(0x08)
	UDialogDataAsset* EventFinishedShout; // 0x308(0x08)
	UDialogDataAsset* EventFailedShout; // 0x310(0x08)
	float EventTriggeredShoutDelay; // 0x318(0x04)
	float EventFinishedShoutDelay; // 0x31c(0x04)
	float StageProgress; // 0x320(0x04)
	float TimeLimit; // 0x324(0x04)
	float DelayUITime; // 0x328(0x04)
	int32_t objectivesPerStage; // 0x330(0x04)
	bool EventStartersActive; // 0x338(0x01)
	bool StopScriptedWavesWhileActive; // 0x339(0x01)
	bool StopNormalWavesWhileActive; // 0x33a(0x01)
	bool EventStarted; // 0x33b(0x01)
	bool FailedEvent; // 0x33c(0x01)
	bool ShowRemainingTimeOnHUD; // 0x33d(0x01)
	bool ShowScoreStatusOnHUD; // 0x33e(0x01)
	bool SkipEventStarters; // 0x340(0x01)
	TArray<AActor*> EventParticipants; // 0x348(0x10)

	void TrySetupGameEvent();
	void TriggerEvent();
	void StartShout();
	void StageObjectiveCompleted();
	ARessuplyPod* SpawnEventPod(ARessuplyPod* podClass, FVector aSpawnLocation, int32_t Delay);
	AActor* SpawnEventActor(AActor* eventActorClass, FTransform aSpawnLocation);
	void SetStageProgress(float Progress);
	void SetObjectivesPerStage(int32_t objectivesPerStage);
	void RemoveParticipant(AActor* participant);
	void OnStarterObjectUsed(AEventStarterButton* eventStarter);
	void OnStageProgress(float Progress);
	void OnStageComplete(int32_t Stage);
	void OnRep_StageProgress();
	void OnRep_ObjectivesPerStage();
	void OnRep_IsEventStartersActive();
	void OnRep_FailedEvent();
	void OnRep_EventStarted();
	void OnRep_EventParticipants();
	void OnEventTriggered();
	void OnEventFinished(bool eventSuccess);
	void OnEventBooted();
	bool IsEventActive();
	float GetStageProgress();
	bool GetShowTimeOnHUD();
	bool GetShowScoreOnHUD();
	FText GetObjectiveText();
	int32_t GetObjectivesPerStage();
	FText GetEventName();
	bool GetEventFailed();
	float GetDelayUITime();
	void EndShout();
	FTransform DebreePositionPoint(AProceduralSetup* setup, FVector fromLocation, float Radius, UDebrisPositioning* DebrisPositioning, AActor* terrainPlacement, TArray<FVector> locationsToAvoid, UCurveFloat* avoidCostCurve, float maxPathLength);
	void BootUpEvent();
	void AddStageProgress(float progressToAdd);
};

// Class FSD.AmberEvent
// Size: 0x3a8 (Inherited: 0x358)
struct AAmberEvent : AGameEvent {
	UDamageComponent* EndExplosionDamage; // 0x358(0x08)
	TArray<UAmberEventEnemyPool*> EnemyPools; // 0x360(0x10)
	TArray<AFSDPawn*> spawnedEnemies; // 0x370(0x10)
	TWeakObjectPtr<UAmberEventEnemyPool> CurrentPool; // 0x388(0x08)
	float InitialDelayBeforeSpawn; // 0x390(0x04)
	float MaxSpawnRange; // 0x394(0x04)

	void OnSpawnedDeath(UHealthComponentBase* spawnedHealthComponent);
	void OnEnemySpawned(APawn* Pawn);
};

// Class FSD.AmmoCountWidget
// Size: 0x250 (Inherited: 0x230)
struct UAmmoCountWidget : UUserWidget {
	APlayerCharacter* Character; // 0x230(0x08)
	AItem* Item; // 0x238(0x08)
	UItemAggregator* Aggregator; // 0x240(0x08)

	void OnVisibleChanged(bool Visible, bool showClipCount);
	void OnTotalVisibleChanged(bool Visible);
	void OnTotalChanged(int32_t Total);
	void OnItemTotalChanged(int32_t Value);
	void OnItemEquipped(AItem* NewItem);
	void OnItemAmountChanged(int32_t Value);
	void OnAmountChanged(int32_t count);
	void DoItemEquipped();
};

// Class FSD.Item
// Size: 0x318 (Inherited: 0x220)
struct AItem : AActor {
	FVector FPCameraOffset; // 0x258(0x0c)
	bool EnableDangerousSaveGameIDEditing; // 0x264(0x01)
	FGuid SavegameID; // 0x268(0x10)
	UItemID* ItemID; // 0x278(0x08)
	APlayerCharacter* Character; // 0x280(0x08)
	UUpgradableItemComponent* UpgradableItem; // 0x288(0x08)
	UCameraShake* CameraShake; // 0x290(0x08)
	bool CameraShakeOnStartUsing; // 0x298(0x01)
	bool CameraShakeOnEquip; // 0x299(0x01)
	UCurveFloat* HeatCurve; // 0x2a8(0x08)
	float ManualHeatPerUse; // 0x2b0(0x04)
	float CooldownRate; // 0x2b4(0x04)
	float ManualCooldownDelay; // 0x2b8(0x04)
	float UnjamDuration; // 0x2bc(0x04)
	float CurrentTemperature; // 0x2c4(0x04)
	USoundBase* AudioTemperature; // 0x2c8(0x08)
	float AudioTemperatureFadeout; // 0x2d0(0x04)
	FName TemperatureFloatParam; // 0x2d4(0x08)
	UAudioComponent* TemperatureAudioComponent; // 0x2e0(0x08)
	bool Overheated; // 0x2e8(0x01)
	UDialogDataAsset* ShoutOverheated; // 0x2f0(0x08)
	bool bAimAssistEnabled; // 0x2f8(0x01)
	float MovementRateWhileUsing; // 0x2fc(0x04)
	bool CanPlayLedgeClimbWhileUsing; // 0x300(0x01)
	bool CanInspectItem; // 0x301(0x01)
	bool CanSprintWithItem; // 0x302(0x01)
	UItemsBarIcon* CustomIconWidget; // 0x308(0x08)
	bool IsEquipped; // 0x310(0x01)
	bool IsUsing; // 0x311(0x01)

	void UpdateSkin();
	void Server_StartUsing(bool IsUsing);
	void Resupply(float percentage);
	void RemovedFromInventory(ACharacter* oldCharacter);
	void RecieveUnequipped();
	void RecieveStopUsing();
	void RecieveStartUsing();
	void RecieveEquipped();
	void RecieveCycledItem();
	void Recieve_UpdateMeshses(bool IsFirstPerson);
	void ReceiveResupply(float percentage);
	void Receive_Overheated();
	UStaticMeshComponent* Receive_GetTPAnimationEventMesh();
	UFirstPersonStaticMeshComponent* Receive_GetFPAnimationEventMesh();
	void OnTemperatureChanged(float Temperature, bool Overheated);
	void OnSkinChanged(USkinEffect* Skin);
	void OnRep_IsUsing(bool OldValue);
	void OnOwnerDestroyed(AActor* owningActor);
	bool IsLocallyControlled();
	bool IsFirstPerson();
	AActor* GetWeaponViewClass();
	FItemLoadoutAnimations GetLoadoutAnimations();
	FText GetItemName();
	UTexture2D* GetItemIconLine();
	UTexture2D* GetItemIconBG();
	AItem* GetItemDefaultObject(AItem* itemClass);
	FText GetItemCategory();
	USceneComponent* GetHeatingAudioSceneComponent();
	UItemCharacterAnimationSet* GetCharacterAnimationSet();
	FString GetAnalyticsItemName();
	FString GetAnalyticsItemCategory();
	void AddedToInventory(APlayerCharacter* ItemOwner);
};

// Class FSD.AnimatedItem
// Size: 0x368 (Inherited: 0x318)
struct AAnimatedItem : AItem {
	USkinnableComponent* Skinnable; // 0x318(0x08)
	UPlayerAnimInstance* FPAnimInstance; // 0x320(0x08)
	UPlayerAnimInstance* TPAnimInstance; // 0x328(0x08)
	USkeletalMeshComponent* FPMesh; // 0x330(0x08)
	USkeletalMeshComponent* TPMesh; // 0x338(0x08)
	UAnimMontage* FP_EquipAnimation; // 0x340(0x08)
	UAnimMontage* TP_EquipAnimation; // 0x348(0x08)
	float EquipDuration; // 0x350(0x04)
	UItemCharacterAnimationSet* CharacterAnimationSet; // 0x358(0x08)

	void OnReceiveEquippedFinished();
	FTransform GetMuzzle();
	USkeletalMeshComponent* GetItemMesh();
};

// Class FSD.AmmoDrivenWeapon
// Size: 0x690 (Inherited: 0x368)
struct AAmmoDrivenWeapon : AAnimatedItem {
	FMulticastInlineDelegate OnClipCountChanged; // 0x388(0x10)
	FMulticastInlineDelegate OnTryReloadEvent; // 0x398(0x10)
	FMulticastInlineDelegate OnReloadingEvent; // 0x3a8(0x10)
	FMulticastInlineDelegate OnStoppedUsingEvent; // 0x3b8(0x10)
	UWeaponFireComponent* WeaponFire; // 0x3c8(0x08)
	UAmmoDriveWeaponAggregator* Aggregator; // 0x3d0(0x08)
	bool LoopFireAnimation; // 0x3d8(0x01)
	float LoopFireAnimationBlendoutTime; // 0x3dc(0x04)
	UAnimMontage* FP_FireAnimation; // 0x3e0(0x08)
	UAnimMontage* TP_FireAnimation; // 0x3e8(0x08)
	UAnimMontage* FP_ReloadAnimation; // 0x3f0(0x08)
	FItemAnimationItem OverheatAnimation; // 0x3f8(0x18)
	TArray<FItemAnimationItem> GunslingAnimations; // 0x410(0x10)
	UAnimMontage* TP_ReloadAnimation; // 0x420(0x08)
	UAnimMontage* WPN_Fire; // 0x428(0x08)
	UAnimMontage* WPN_FireLastBullet; // 0x430(0x08)
	UAnimMontage* WPN_Reload; // 0x438(0x08)
	UAnimMontage* WPN_Reload_TP; // 0x440(0x08)
	UFXSystemAsset* MuzzleParticles; // 0x448(0x08)
	UFXSystemAsset* TPMuzzleParticles; // 0x450(0x08)
	bool UseTriggeredMuzzleParticles; // 0x458(0x01)
	FTracerData Tracer; // 0x468(0x30)
	UParticleSystem* TracerParticles; // 0x498(0x08)
	UParticleSystem* TrailParticles; // 0x4a0(0x08)
	float MinTracerDistance; // 0x4a8(0x04)
	float TracerSpeed; // 0x4ac(0x04)
	float TracerOffset; // 0x4b0(0x04)
	UFXSystemAsset* CasingParticles; // 0x4b8(0x08)
	bool UseTriggeredCasingParticleSystem; // 0x4c0(0x01)
	ULightComponent* MuzzleFlashLight; // 0x4d0(0x08)
	FRuntimeFloatCurve MuzzleFlashLightCurve; // 0x4d8(0x88)
	USoundCue* FireSound; // 0x568(0x08)
	USoundCue* RicochetSound; // 0x570(0x08)
	UFXSystemAsset* RicochetParticle; // 0x578(0x08)
	float FireSoundDelayToTail; // 0x580(0x04)
	USoundCue* FireSoundTail; // 0x590(0x08)
	bool IsFireSoundTail2D; // 0x598(0x01)
	UForceFeedbackEffect* FireForceFeedbackEffect; // 0x5a0(0x08)
	UAudioComponent* FireSoundInstance; // 0x5a8(0x08)
	float FireSoundFadeDuration; // 0x5b0(0x04)
	USoundCue* ReloadSound; // 0x5b8(0x08)
	int32_t BulletsRemainingForNearEmptySound; // 0x5c0(0x04)
	USoundCue* NearEmptySound; // 0x5c8(0x08)
	USoundCue* WeaponEmptySound; // 0x5d0(0x08)
	UDialogDataAsset* ShoutShotFired; // 0x5d8(0x08)
	UDialogDataAsset* ShoutOutOfAmmo; // 0x5e0(0x08)
	UDialogDataAsset* ShoutReloading; // 0x5e8(0x08)
	int32_t MaxAmmo; // 0x5f0(0x04)
	int32_t ClipSize; // 0x5f4(0x04)
	int32_t ShotCost; // 0x5f8(0x04)
	float RateOfFire; // 0x5fc(0x04)
	int32_t BurstCount; // 0x600(0x04)
	float BurstCycleTime; // 0x604(0x04)
	float ReloadDuration; // 0x608(0x04)
	int32_t AmmoCount; // 0x60c(0x04)
	int32_t ClipCount; // 0x610(0x04)
	float AutoReloadDuration; // 0x614(0x04)
	USoundCue* AutoReloadCompleteCue; // 0x618(0x08)
	FMulticastInlineDelegate OnItemAutoReloaded; // 0x620(0x10)
	float SupplyStatusWeight; // 0x634(0x04)
	float CycleTimeLeft; // 0x638(0x04)
	float ReloadTimeLeft; // 0x640(0x04)
	bool AutomaticReload; // 0x644(0x01)
	bool CanReload; // 0x645(0x01)
	FRecoilSettings RecoilSettings; // 0x648(0x28)
	bool HasAutomaticFire; // 0x670(0x01)
	bool IsFiring; // 0x671(0x01)
	enum class EAmmoWeaponState WeaponState; // 0x68a(0x01)

	void Upgraded_Blueprint_Implementation(TArray<UItemUpgrade*> Upgrades);
	void Server_StopReload();
	void Server_ReloadWeapon();
	void Server_PlayBurstFire(char shotCount);
	void Server_Gunsling(char Index);
	void RecieveFiredWeapon();
	void Receive_ReloadEnd();
	void Receive_ReloadBegin();
	void Receive_IsFiringChanged(bool NewValue);
	void OnWeaponFireEnded();
	void OnWeaponFired(FVector Location);
	void OnRicochet(FVector Origin, FVector Location, FVector Normal);
	void OnRep_IsFiring();
	bool IsClipFull();
	void InstantlyReload();
	void CustomEvent1();
	void Client_RefillAmmo(float percentage);
	void All_StopReload();
	void All_StartReload();
	void All_PlayBurstFire(char shotCount);
	void All_Gunsling(char Index);
};

// Class FSD.ItemAggregator
// Size: 0xc8 (Inherited: 0xb0)
struct UItemAggregator : UActorComponent {
	FText CounterText; // 0xb0(0x18)

	void UnbindAllEvents();
};

// Class FSD.ClipBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UClipBasedItemAggregator : UItemAggregator {
	FMulticastInlineDelegate OnClipAmountChanged; // 0xc8(0x10)
	FMulticastInlineDelegate OnTotalAmountChanged; // 0xd8(0x10)
	FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool ShowTotalAmount; // 0x138(0x01)

	void ReloadStarted();
	void ReloadComplete();
	int32_t GetTotalAmount();
	int32_t GetClipAmount();
};

// Class FSD.AmmoDriveWeaponAggregator
// Size: 0x148 (Inherited: 0x140)
struct UAmmoDriveWeaponAggregator : UClipBasedItemAggregator {
	AAmmoDrivenWeapon* Weapon; // 0x140(0x08)
};

// Class FSD.AmmoDrivenWeaponAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAmmoDrivenWeaponAnimInstance : UAnimInstance {
	AAmmoDrivenWeapon* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ClipFullPercentage; // 0x274(0x04)

	bool IsFull();
	bool IsEmpty();
};

// Class FSD.PlatformGunAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UPlatformGunAnimInstance : UAmmoDrivenWeaponAnimInstance {
	float SpinRate; // 0x278(0x04)
	float NormalSpinRate; // 0x27c(0x04)
	float LerpSpeed; // 0x280(0x04)
	float FiredSpinRate; // 0x284(0x04)

	void WeaponFired();
};

// Class FSD.AnchorTurner
// Size: 0x2c0 (Inherited: 0x220)
struct AAnchorTurner : AActor {
	USceneComponent* Root; // 0x220(0x08)
	USkeletalMeshComponent* Mesh; // 0x228(0x08)
	USphereComponent* PushCollider1; // 0x230(0x08)
	USphereComponent* PushCollider2; // 0x238(0x08)
	USphereComponent* PushCollider3; // 0x240(0x08)
	USphereComponent* PushCollider4; // 0x248(0x08)
	FMulticastInlineDelegate OnSpunUp; // 0x250(0x10)
	FVector AttatchmentOffset; // 0x280(0x0c)
	TArray<FName> AttachmentPoints; // 0x290(0x10)
	float PerPlayerMultiplier; // 0x2a0(0x04)
	float TurnSpeed; // 0x2a4(0x04)
	float Progress; // 0x2a8(0x04)
	float MaxProgress; // 0x2ac(0x04)
	bool Finished; // 0x2b4(0x01)
	float DecaySpeed; // 0x2b8(0x04)

	void OnRep_Finished();
	void OnLeftPushpoint(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);
	void OnEnteredPushpoint(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
	void GeneratorSpunUp();
};

// Class FSD.AnchorTurnerAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAnchorTurnerAnimInstance : UAnimInstance {
	float ModuleRotation; // 0x268(0x04)
	float Percent; // 0x26c(0x04)
	float TurnSpeed; // 0x270(0x04)
	bool IsFinished; // 0x274(0x01)
};

// Class FSD.BaseArmorDamageComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UBaseArmorDamageComponent : UActorComponent {
	bool ArmorDamageEnabled; // 0xb0(0x01)
	TArray<UParticleSystem*> ArmorBreakParticles; // 0xb8(0x10)
	TArray<UFSDPhysicalMaterial*> ArmorPhysMats; // 0xc8(0x10)
	USkeletalMeshComponent* Mesh; // 0xd8(0x08)
};

// Class FSD.SimpleArmorDamageComponent
// Size: 0x148 (Inherited: 0xe0)
struct USimpleArmorDamageComponent : UBaseArmorDamageComponent {
	FMulticastInlineDelegate OnRadialArmorPartsDestroyedEvent; // 0xe0(0x10)
	float ArmorStrength; // 0xf0(0x04)
	TMap<FName, FDestructableBodypartItem> PhysBoneToArmor; // 0xf8(0x50)

	void DamageArmor_All(TArray<char> parts);
};

// Class FSD.ArmorHealthDamageComponent
// Size: 0x148 (Inherited: 0xe0)
struct UArmorHealthDamageComponent : UBaseArmorDamageComponent {
	FMulticastInlineDelegate OnArmorPartDestroyedEvent; // 0xe0(0x10)
	TMap<FName, FArmorHealthItem> PhysBoneToArmor; // 0xf0(0x50)
	uint32_t ArmorDamageIndex; // 0x140(0x04)
	bool AffectedByAmorBreak; // 0x144(0x01)

	bool SetHealthOnBodypartItem(FName BoneName, float newHealth);
	void SetHealthOnAllItems(float newHealth);
	void RegrowAllArmor(float baseHealth);
	void OnRep_ArmorDamageIndex(uint32_t OldValue);
};

// Class FSD.CompositeArmorComponent
// Size: 0xf0 (Inherited: 0xe0)
struct UCompositeArmorComponent : UBaseArmorDamageComponent {
	TArray<FCompositeArmorItem> ArmorItems; // 0xe0(0x10)

	void AddArmorPart(UPrimitiveComponent* Primitive, float Health);
};

// Class FSD.ArmorPiece
// Size: 0x2a8 (Inherited: 0x220)
struct AArmorPiece : AActor {
	UUpgradableGearComponent* Upgradable; // 0x238(0x08)
	TMap<UPawnStat*, float> StatModifiers; // 0x240(0x50)
	ALoadoutItemProxy* LoadoutProxy; // 0x290(0x08)
	UItemID* ItemID; // 0x298(0x08)
	AActor* WeaponPreviewClass; // 0x2a0(0x08)

	AActor* GetWeaponViewClass();
	AArmorPiece* GetArmorPieceDefaultObject(AArmorPiece* armorPieceClass);
};

// Class FSD.ThrowableItem
// Size: 0x3e0 (Inherited: 0x368)
struct AThrowableItem : AAnimatedItem {
	AThrowableActor* ThrowableClass; // 0x370(0x08)
	UAnimMontage* FPThrowMontage; // 0x378(0x08)
	UAnimMontage* TPThrowMontage; // 0x380(0x08)
	float ThrowVelocity; // 0x388(0x04)
	float InheritOwnerVelocityScale; // 0x38c(0x04)
	float ThrowAngle; // 0x390(0x04)
	float CooldownAfterThrow; // 0x394(0x04)
	float CooldownAfterDetonation; // 0x398(0x04)
	bool CanThrowBeforeEquipAnimFinish; // 0x39c(0x01)
	float ThrowDelay; // 0x3a0(0x04)
	float ThrowZOffset; // 0x3a4(0x04)
	float CooldownLeft; // 0x3a8(0x04)
	TArray<UItemUpgrade*> Upgrades; // 0x3b0(0x10)
	AItem* LoadoutItem; // 0x3c0(0x08)
	TArray<TWeakObjectPtr<AThrowableActor>> ThrownActors; // 0x3c8(0x10)

	void Simulate_Throw(AThrowableActor* ActorClass);
	void Server_Throw(AThrowableActor* ActorClass);
	void ReceiveItemThrown(AThrowableActor* thrownActor);
	void ReceiveItemSpawned(AThrowableActor* thrownActor);
	void OnThrownActorDestroyed(AActor* Actor);
	FVector GetThrowLocation();
};

// Class FSD.ArmorRegeneratorItem
// Size: 0x458 (Inherited: 0x3e0)
struct AArmorRegeneratorItem : AThrowableItem {
	UCapacityHoldingItemAggregator* ChargeCapacity; // 0x3f0(0x08)
	UCapacityHoldingItemAggregator* CarryCapacity; // 0x3f8(0x08)
	float RechargeDuration; // 0x400(0x04)
	int32_t UnchargedCount; // 0x404(0x04)
	float RechargeProgress; // 0x408(0x04)
	float SupplyStatusWeight; // 0x40c(0x04)
	UDialogDataAsset* ShoutRecarged; // 0x410(0x08)
	FCoolDownProgressStyle RechargeProgressUI; // 0x418(0x40)

	void ReceiveGeneratorReturned();
	void ReceiveGeneratorRechargeProgress(float Progress);
	void ReceiveGeneratorRecharged();
	void OnRep_UnchargedCount(int32_t OldCount);
	bool GetIsRecharging();
	void GeneratorReturned();
};

// Class FSD.ThrowableActor
// Size: 0x230 (Inherited: 0x220)
struct AThrowableActor : AActor {
	UProjectileMovementComponent* Movement; // 0x220(0x08)
	bool IsMoving; // 0x228(0x01)
	bool IgnoreFellOutOfWorld; // 0x229(0x01)
	bool IgnoreOwnersCollision; // 0x22a(0x01)

	void ReceiveIgnoreCharacter(APlayerCharacter* Character);
	void ReceiveHitObject();
	void OnRep_IsMoving();
};

// Class FSD.ArmorRegeneratorActor
// Size: 0x240 (Inherited: 0x230)
struct AArmorRegeneratorActor : AThrowableActor {
	float GeneratorRadius; // 0x230(0x04)
	float DeployDelay; // 0x234(0x04)
	bool bPushStatusEffectOnExit; // 0x238(0x01)
	float GeneratorLifetime; // 0x23c(0x04)
};

// Class FSD.AsyncLevelPersistanceActor
// Size: 0x240 (Inherited: 0x220)
struct AAsyncLevelPersistanceActor : AActor {
	TArray<UObject*> References; // 0x220(0x10)
};

// Class FSD.AsyncManager
// Size: 0x58 (Inherited: 0x30)
struct UAsyncManager : UGameInstanceSubsystem {
	TArray<UObject*> PermanentReferences; // 0x30(0x10)

	void ReleaseAllHandles();
	void AsyncLoadSoftObjects(TArray<TSoftObjectPtr<UObject>> Items, enum class EAsyncPersistence persistence, FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority);
	void AsyncLoadSoftObject(TSoftObjectPtr<UObject> Item, enum class EAsyncPersistence persistence, FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority);
	void AsyncLoadSoftClass(TSoftClassPtr<UObject> Item, enum class EAsyncPersistence persistence, FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority);
	void AsyncLoadAssets(TArray<FSoftObjectPath> Items, enum class EAsyncPersistence persistence, FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority);
	void AsyncLoadAsset(FSoftObjectPath Item, enum class EAsyncPersistence persistence, FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority);
};

// Class FSD.AttackBaseComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UAttackBaseComponent : UActorComponent {
	FName AttackName; // 0xc0(0x08)
	float MaxSurfaceAngle; // 0xc8(0x04)
	FFloatInterval Range; // 0xcc(0x08)
	float MinRange; // 0xd4(0x04)
	float MaxRange; // 0xd8(0x04)

	UAttackBaseComponent* ReplaceAttackComponent(UAttackBaseComponent* componentToReplace, UAttackBaseComponent* newComponentClass);
	void ReceiveAttackTarget(AActor* Target);
	void ReceiveAbortAttack();
	void CompleteAttack(bool success);
};

// Class FSD.AttackEffect
// Size: 0x28 (Inherited: 0x28)
struct UAttackEffect : UObject {
};

// Class FSD.AttackCooldownComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackCooldownComponent : UActorComponent {
	TArray<FAttackCooldown> AttackCooldowns; // 0xb0(0x10)

	void SetCooldown(FName AttackName, float cooldownSeconds);
	bool IsAttackOffCooldown(FName AttackName);
	bool IsAnyAttackOffCooldown();
	void AttackUsed(FName Name);
};

// Class FSD.AttackerManagerComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackerManagerComponent : UActorComponent {
	TArray<UAttackerPositioningComponent*> Components; // 0xb0(0x10)
};

// Class FSD.AttackerPositioningComponent
// Size: 0x108 (Inherited: 0xb0)
struct UAttackerPositioningComponent : UActorComponent {
	bool DebugPositions; // 0xb0(0x01)
	int32_t MaxAttackers; // 0xb4(0x04)
	TArray<FAttackerInfo> Attackers; // 0xb8(0x10)
	TArray<int32_t> FreePositions; // 0xc8(0x10)
	TArray<FAttackerInfo> FlyingAttackers; // 0xd8(0x10)
	TArray<int32_t> FlyingFreePositions; // 0xe8(0x10)
	float CharacterPersonalSphere; // 0xf8(0x04)
	float CharacterHalfHeight; // 0xfc(0x04)
	float CostModifier; // 0x100(0x04)

	void UnregisterAttacker(AActor* Attacker, bool IsFlying);
	void RegisterAttacker(AActor* Attacker, bool IsFlying);
	void OnFlyingAttackerDeath(UHealthComponentBase* HealthComponent);
	void OnAttackerDeath(UHealthComponentBase* HealthComponent);
	FVector GetFlyingAttackerPosition(AActor* Attacker, float AttackerRadius);
	FVector GetAttackerPosition(AActor* Attacker, float AttackerRadius);
};

// Class FSD.PlayerAttackPositionComponent
// Size: 0x110 (Inherited: 0x108)
struct UPlayerAttackPositionComponent : UAttackerPositioningComponent {
	float OnZiplineFlyingModifier; // 0x108(0x04)
	float OnZiplineWalkingModifier; // 0x10c(0x04)
};

// Class FSD.ObjectAttackerPositioning
// Size: 0x110 (Inherited: 0x108)
struct UObjectAttackerPositioning : UAttackerPositioningComponent {
	UHealthComponentBase* Health; // 0x108(0x08)
};

// Class FSD.CustomObjectAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UCustomObjectAttackerPositioning : UAttackerPositioningComponent {
	UHealthComponentBase* Health; // 0x108(0x08)
	TArray<FVector> AttackerPositions; // 0x110(0x10)
};

// Class FSD.EnemyAttackerPositioningComponent
// Size: 0x108 (Inherited: 0x108)
struct UEnemyAttackerPositioningComponent : UAttackerPositioningComponent {
};

// Class FSD.EscortMuleAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UEscortMuleAttackerPositioning : UAttackerPositioningComponent {
	UHealthComponentBase* Health; // 0x108(0x08)
	TArray<FVector> AttackerPositions; // 0x110(0x10)

	void SetNewMaxAttackers(int32_t newMaxAttackers);
	void SetCostModifier(float newModifier);
};

// Class FSD.AttackingPointInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttackingPointInterface : UInterface {
};

// Class FSD.AudioFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAudioFunctionLibrary : UBlueprintFunctionLibrary {

	float SetSoundClassVolume(USoundClass* SoundClass, float Volume);
	void PushTimedSoundMix(UObject* contextObject, USoundMix* mix, float Duration);
	float GetSoundClassVolume(USoundClass* SoundClass);
};

// Class FSD.SoundClassWidget
// Size: 0x230 (Inherited: 0x230)
struct USoundClassWidget : UUserWidget {
};

// Class FSD.AutoCannon
// Size: 0x758 (Inherited: 0x690)
struct AAutoCannon : AAmmoDrivenWeapon {
	float StartingFireRate; // 0x690(0x04)
	float MaxFireRate; // 0x694(0x04)
	FRuntimeFloatCurve FireRateCurve; // 0x698(0x88)
	float FireTimeReductionScale; // 0x720(0x04)
	float FireTimeIncreaseScale; // 0x724(0x04)
	float MaxFireTimeCap; // 0x728(0x04)
	float DamageBonusAtFullROF; // 0x72c(0x04)
	bool StatusEffectAtFullROF; // 0x730(0x01)
	float FireTimeOffsetForMaxRateOfFireBonus; // 0x734(0x04)
	float StartLoopingSoundAt; // 0x738(0x04)
	UStatusEffect* StatusAtFullROF; // 0x740(0x08)
	UAnimMontage* WPN_Fire_3; // 0x748(0x08)
	float CurrentFireTime; // 0x750(0x04)

	void Server_SetStatusActive(bool IsActive);
};

// Class FSD.AutoCannonAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UAutoCannonAnimInstance : UAnimInstance {
};

// Class FSD.AutoCarverComponent
// Size: 0x4c0 (Inherited: 0x480)
struct UAutoCarverComponent : UStaticMeshComponent {
	UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	float Frequency; // 0x488(0x04)
	float ExpensiveNoise; // 0x48c(0x04)
	float MinDistanceMoved; // 0x490(0x04)
	enum class ECarveFilterType Filter; // 0x494(0x01)
	FMulticastInlineDelegate OnCarveDoneEvent; // 0x498(0x10)

	void ForceCarve();
};

// Class FSD.STLMeshCarverComponent
// Size: 0x410 (Inherited: 0x3f0)
struct USTLMeshCarverComponent : UPrimitiveComponent {
	UTerrainMaterialBase* TerrainMaterial; // 0x3f0(0x08)
	USTLMeshCarver* MeshCarver; // 0x3f8(0x08)
	enum class ECarveFilterType Filter; // 0x400(0x01)
	bool PreviewEnabled; // 0x401(0x01)
};

// Class FSD.MeshCarverComponent
// Size: 0x4a0 (Inherited: 0x480)
struct UMeshCarverComponent : UStaticMeshComponent {
	UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	enum class ECarveFilterType Filter; // 0x488(0x01)
	float ExpensiveNoise; // 0x48c(0x04)
	enum class CarveOptionsCellSize CarverSize; // 0x490(0x01)

	void Carve();
};

// Class FSD.LevelGenerationCarverComponent
// Size: 0x420 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent : UPrimitiveComponent {
	USTLMeshCarver* MeshCarver; // 0x3f0(0x08)
	UStaticMesh* ConvexCarver; // 0x3f8(0x08)
	UStaticMeshCarver* StaticMeshCarver; // 0x400(0x08)
	UTerrainMaterialBase* TerrainMaterial; // 0x408(0x08)
	enum class ECarveFilterType Filter; // 0x410(0x01)
	float ConvexExpensiveNoise; // 0x414(0x04)
	enum class CarveOptionsCellSize CarveCellSize; // 0x418(0x01)
	bool PreviewEnabled; // 0x419(0x01)
	bool CarvingDisabled; // 0x41a(0x01)
	bool SelfActivate; // 0x41b(0x01)
};

// Class FSD.RandomizedInstantMeshCarver
// Size: 0x268 (Inherited: 0x220)
struct ARandomizedInstantMeshCarver : AActor {
	TArray<UStaticMesh*> CarvingMeshes; // 0x220(0x10)
	TArray<USTLMeshCarver*> STLCarvingMeshes; // 0x230(0x10)
	TArray<UStaticMeshCarver*> StaticMeshCarvers; // 0x240(0x10)
	FRandRange RandomScale; // 0x250(0x08)
	UTerrainMaterialBase* TerrainMaterial; // 0x258(0x08)
	enum class ECarveFilterType Filter; // 0x260(0x01)
};

// Class FSD.LevelGenerationCarverComponent2
// Size: 0x550 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent2 : UPrimitiveComponent {
	ACSGBuilder* Carver; // 0x3f0(0x08)
	bool CarvingDisabled; // 0x3f8(0x01)
	int32_t PreviewSeed; // 0x3fc(0x04)
	FBakeSettings CarverSettings; // 0x400(0x140)
	bool SelfActivate; // 0x540(0x01)
	UCSGPreviewComponent* PreviewComponent; // 0x548(0x08)
};

// Class FSD.Ball
// Size: 0xb0 (Inherited: 0xb0)
struct UBall : UActorComponent {
};

// Class FSD.WindowWidget
// Size: 0x270 (Inherited: 0x230)
struct UWindowWidget : UUserWidget {
	FMulticastInlineDelegate OnWindowClosed; // 0x230(0x10)
	bool bHandleCloseCommand; // 0x268(0x01)
	bool bResolutionDownscaleWhenOpen; // 0x269(0x01)

	void WindowDelegate__DelegateSignature(UWindowWidget* Window);
	void ReceiveSelectPreviousCommand();
	void ReceiveSelectNextCommand();
	void ReceiveSelectCharacterCommand();
	void ReceiveOkCommand();
	void ReceiveCloseCommand();
	void OnShown();
	void OnNewTopWindow();
	void OnClosed();
	void ConsumeCommand();
	void CloseThisWindow();
};

// Class FSD.BarMenuWidget
// Size: 0x278 (Inherited: 0x270)
struct UBarMenuWidget : UWindowWidget {
	TWeakObjectPtr<ASpaceRigBar> SpaceRigBar; // 0x270(0x08)
};

// Class FSD.WeaponFireComponent
// Size: 0x110 (Inherited: 0xb0)
struct UWeaponFireComponent : UActorComponent {
	FMulticastInlineDelegate OnWeaponFired; // 0xb8(0x10)
	FMulticastInlineDelegate OnWeaponFireEnded; // 0xc8(0x10)
	FMulticastInlineDelegate OnRicochetEvent; // 0xd8(0x10)
	TScriptInterface<IWeaponFireOwner> Weapon; // 0xf8(0x10)

	void StopFire();
	void Server_SetShotPower(float shotPower);
	void Fire(FVector Origin, FVector_NetQuantizeNormal Direction);
};

// Class FSD.BasicWeaponFireComponent
// Size: 0x110 (Inherited: 0x110)
struct UBasicWeaponFireComponent : UWeaponFireComponent {

	void Server_FireWeapon();
	void Server_EndFire();
	void All_WeaponFired();
};

// Class FSD.BeltDrivenWeapon
// Size: 0x6c0 (Inherited: 0x690)
struct ABeltDrivenWeapon : AAmmoDrivenWeapon {
	UAudioComponent* BarrelAudio; // 0x690(0x08)
	USoundCue* BarrelSound; // 0x698(0x08)
	float BarrelFadeIn; // 0x6a0(0x04)
	float BarrelFadeOut; // 0x6a4(0x04)
	UCurveFloat* BarrelPitchCurve; // 0x6a8(0x08)
	float BarrelSpinUpTime; // 0x6b0(0x04)
	float BarrelSpinDownTime; // 0x6b4(0x04)
	float CurrentSpinRate; // 0x6b8(0x04)
	bool Simulate_SpinBarrel; // 0x6bc(0x01)

	void Server_StopBarrel();
	void Server_StartBarrel();
};

// Class FSD.GatlingGun
// Size: 0x720 (Inherited: 0x6c0)
struct AGatlingGun : ABeltDrivenWeapon {
	bool BarrelProximityDamageEnabled; // 0x6c0(0x01)
	float BarrelProximityDamageDistance; // 0x6c4(0x04)
	float BarrelProximityDamageRadius; // 0x6c8(0x04)
	float BarrelProximityDamageLength; // 0x6cc(0x04)
	float TimeBetweenProximityDamageTicks; // 0x6d0(0x04)
	float DamageMultiplierAtMaxStabilization; // 0x6e8(0x04)
	UFXSystemAsset* HotShellsTracerParticles; // 0x6f0(0x08)
	float HeatRemovedOnKill; // 0x700(0x04)
	bool CriticalOverheatEnabled; // 0x704(0x01)
	bool HotShellsOn; // 0x705(0x01)
	float HotShellsTemperatureRequired; // 0x708(0x04)
	UDamageComponent* DamageComponent; // 0x710(0x08)
	UDamageComponent* BarrelProximityDamageComponent; // 0x718(0x08)

	void Server_SetHotShellsOn(bool hotShellsIsOn);
	void OnRep_HotShellsTracerOn();
	void OnGatlingTemperatureChanged(float Temperature, bool isOverheated);
	void OnEnemyKilled(AActor* Target, UFSDPhysicalMaterial* PhysMat);
	void Client_RemoveHeat();
};

// Class FSD.BeltDrivenAnimInstance
// Size: 0x2a0 (Inherited: 0x270)
struct UBeltDrivenAnimInstance : UAnimInstance {
	float BarrelSpinRate; // 0x268(0x04)
	float CurrentBarrelSpinRate; // 0x26c(0x04)
	bool IsFiring; // 0x270(0x01)
	bool Overheated; // 0x271(0x01)
	FVector ExternalForce; // 0x274(0x0c)
	float ExternalForceScale; // 0x280(0x04)
	FName ExternalForceBoneName; // 0x284(0x08)
};

// Class FSD.Biome
// Size: 0x428 (Inherited: 0x30)
struct UBiome : UDataAsset {
	FText BiomeName; // 0x30(0x18)
	FText BiomeShortName; // 0x48(0x18)
	FText BiomeDescription; // 0x60(0x18)
	FColor BiomeColor; // 0x78(0x04)
	int32_t BiomeIndex; // 0x7c(0x04)
	FString BiomeAnalyticsIndex; // 0x80(0x10)
	TSoftObjectPtr<UFileMediaSource> BiomeMovie; // 0x90(0x28)
	TSoftObjectPtr<UTexture2D> BiomePicture; // 0xb8(0x28)
	TSoftObjectPtr<UTexture2D> BiomeIcon; // 0xe0(0x28)
	TSoftObjectPtr<UTexture2D> BiomeLargeImage; // 0x108(0x28)
	TSoftObjectPtr<UTexture2D> BiomeWorldMap; // 0x130(0x28)
	TSoftObjectPtr<UTexture2D> BiomeMissionBar; // 0x158(0x28)
	TSoftClassPtr<UObject> BiomeMapWidget; // 0x180(0x28)
	FHeatSource BiomeHeatSource; // 0x1a8(0x08)
	FRandRange DepthRange; // 0x1b0(0x08)
	TSoftObjectPtr<UParticleSystem> AtmosphericParticles; // 0x1b8(0x28)
	TArray<TSoftClassPtr<UObject>> CaveScriptComponents; // 0x1e0(0x10)
	float ExtraCaveSize; // 0x1f0(0x04)
	TArray<UDebrisSet*> Debris; // 0x1f8(0x10)
	TSoftClassPtr<UObject> DebrisActor; // 0x208(0x28)
	TArray<FBiomeDebrisInfluencerVariant> DebrisInfluencerVariants; // 0x230(0x10)
	TSoftClassPtr<UObject> PostProcessActorClass; // 0x240(0x28)
	UTerrainMaterial* RockMaterial; // 0x268(0x08)
	UTerrainMaterial* DirtMaterial; // 0x270(0x08)
	UTerrainMaterial* BurnedMaterialOverride; // 0x278(0x08)
	TArray<FBiomeNoiseItem> RoomNoises; // 0x280(0x10)
	UMissionStat* MissionCompleted; // 0x290(0x08)
	UFloodFillSettings* CeilingNoise; // 0x298(0x08)
	UDetailNoise* CeilingDetailNoise; // 0x2a0(0x08)
	UFloodFillSettings* WallNoise; // 0x2a8(0x08)
	UDetailNoise* WallDetailNoise; // 0x2b0(0x08)
	UFloodFillSettings* FloorNoise; // 0x2b8(0x08)
	UDetailNoise* FloorDetailNoise; // 0x2c0(0x08)
	UFloodFillSettings* PillarNoise; // 0x2c8(0x08)
	UDetailNoise* PillarDetailNoise; // 0x2d0(0x08)
	UPillarSettings* PillarSettings; // 0x2d8(0x08)
	TArray<UTunnelSetting*> TunnelSettings; // 0x2e0(0x10)
	UFloodFillSettings* TunnelCeilingNoise; // 0x2f0(0x08)
	UFloodFillSettings* TunnelWallNoise; // 0x2f8(0x08)
	UFloodFillSettings* TunnelFloorNoise; // 0x300(0x08)
	TArray<FResourceSpawner> Resources; // 0x308(0x10)
	TArray<FBiomeEnemyEntry> Enemies; // 0x318(0x10)
	TArray<UEnemyDescriptor*> BannedEnemies; // 0x328(0x10)
	TArray<UEnemyDescriptor*> StationaryEnemies; // 0x338(0x10)
	TArray<UCritterDescriptor*> Critters; // 0x348(0x10)
	TSoftObjectPtr<USoundCue> AmbientSounds; // 0x358(0x28)
	bool Use3DAmbient; // 0x380(0x01)
	FReverbSettings ReverbSettings; // 0x388(0x20)
	float SmallCaveReverbVolume; // 0x3a8(0x04)
	UReverbEffect* SmallCaveReverb; // 0x3b0(0x08)
	float MediumCaveReverbVolume; // 0x3b8(0x04)
	UReverbEffect* MediumCaveReverb; // 0x3c0(0x08)
	float LargeCaveReverbVolume; // 0x3c8(0x04)
	UReverbEffect* LargeCaveReverb; // 0x3d0(0x08)
	TSoftObjectPtr<ULevelSequence> BiomeLoaderLevelSequence; // 0x3d8(0x28)
	FString BiomeLoaderLevelName; // 0x400(0x10)
	TArray<FText> Quotes; // 0x410(0x10)
	float PlanetZoneSelectionWeight; // 0x420(0x04)

	UTerrainMaterial* GetRockMaterial();
	TSoftClassPtr<UObject> GetPostProcessActorClass_Soft();
	UTerrainMaterial* GetDirtMaterial();
	TSoftClassPtr<UObject> GetDebrisActorSoftClass();
	UTexture2D* GetBiomeWorldMap();
	UTexture2D* GetBiomePicture();
	FText GetBiomeName();
	UTexture2D* GetBiomeMissionBar();
	UUserWidget* GetBiomeMapWidget();
	TArray<FSoftObjectPath> GetBiomeMapAssetList();
	UTexture2D* GetBiomeLargeImage();
	int32_t GetBiomeIndex();
	UTexture2D* GetBiomeIcon();
	FString GetBiomeAnalyticsIndex();
	UParticleSystem* GetAtmosphericParticles();
	USoundCue* GetAmbientSounds();
};

// Class FSD.BobbingComponent
// Size: 0x220 (Inherited: 0x1f0)
struct UBobbingComponent : USceneComponent {
	FMulticastInlineDelegate OnMovedIntoSomethingEvent; // 0x1f0(0x10)
	AActor* OwnerActor; // 0x200(0x08)
	bool DoOrientationChecks; // 0x208(0x01)
	float BobSpeed; // 0x20c(0x04)
	float BobSize; // 0x210(0x04)
	float OrentationChecksPerSecond; // 0x214(0x04)

	void SetOwner(AActor* AActor);
};

// Class FSD.BoltActionWeapon
// Size: 0x7a8 (Inherited: 0x690)
struct ABoltActionWeapon : AAmmoDrivenWeapon {
	FMulticastInlineDelegate FullyFocusedEvent; // 0x690(0x10)
	UDamageComponent* DamageComponent; // 0x6a0(0x08)
	UHitscanBaseComponent* HitscanComponent; // 0x6a8(0x08)
	UStatusEffect* FocusedHitSTE; // 0x6b0(0x08)
	bool RequireWeakspotForFocusedHitSTE; // 0x6b8(0x01)
	bool IsNoGravityOnFocusEnabled; // 0x6b9(0x01)
	float NoGravityOnFocusDuration; // 0x6bc(0x04)
	float NoGravityFocusFallFriction; // 0x6c0(0x04)
	float NoGravityFocusGravityScale; // 0x6c4(0x04)
	float ZoomSpreadAmount; // 0x6cc(0x04)
	float ZoomMinSpreadWhileMoving; // 0x6d0(0x04)
	float ChargeSpeed; // 0x6d8(0x04)
	float ChargeAmmoCost; // 0x6dc(0x04)
	float ChargeRecoilMult; // 0x6e0(0x04)
	USoundCue* ZoomedInAudio; // 0x6f8(0x08)
	UParticleSystem* ChargedShotTrailParticles; // 0x700(0x08)
	FTracerData ChargedShotTracer; // 0x708(0x30)
	USoundCue* ChargedShotFireSound; // 0x738(0x08)
	float ChargedFoVChange; // 0x740(0x04)
	float ChargedFoVFadeSpeed; // 0x744(0x04)
	float MinCharge; // 0x748(0x04)
	float SlowMovementAtCharge; // 0x74c(0x04)
	float FullChargeDamageBonus; // 0x750(0x04)
	float AimedShotStaggerChance; // 0x754(0x04)
	float AimedWeakspotKilLRange; // 0x758(0x04)
	float TargetKilledReloadTimeBoost; // 0x760(0x04)
	float TargetKilledReloadTimeBoostDuration; // 0x764(0x04)
	bool LastShotWasAimed; // 0x77a(0x01)
	bool IsMovementSlowed; // 0x788(0x01)
	bool ChargeAffectsDamage; // 0x7a0(0x01)
	bool Charging; // 0x7a1(0x01)
	float ChargeProgress; // 0x7a4(0x04)

	void SetOverheated(bool isOverheated);
	void Server_SetIsMovementSlowed(bool bisMovementSlowed);
	void Server_SetIsLatestShotFocused(bool bisShotFocused);
	void Server_SetIsChargingShot(bool bisCharging);
	void OnTimerElapsed();
	void OnTargetKilled(AActor* Target, UFSDPhysicalMaterial* PhysicalMaterial);
	void OnTargetDamaged(UHealthComponentBase* Health, float amount, UFSDPhysicalMaterial* PhysicalMaterial);
	void OnShotPowerSet();
	void OnMovementSlowed(bool isSlowed);
	void Client_OnTargetKilled(bool BoostReloadTime);
};

// Class FSD.BoltActionWeaponAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UBoltActionWeaponAnimInstance : UAnimInstance {
};

// Class FSD.Bomber
// Size: 0x540 (Inherited: 0x478)
struct ABomber : AAFlyingBug {
	UAudioComponent* GooSoundComponent; // 0x478(0x08)
	UParticleSystemComponent* AcidEmitterLeft; // 0x480(0x08)
	UParticleSystemComponent* AcidEmitterRight; // 0x488(0x08)
	AProjectile* AcidProjectile; // 0x4b8(0x08)
	UParticleSystem* deathParticles; // 0x4c0(0x08)
	USoundBase* deathSound; // 0x4c8(0x08)
	USoundBase* DeathPanicSound; // 0x4d0(0x08)
	UParticleSystem* BleedParticles; // 0x4d8(0x08)
	USoundBase* BladderDestroyedNoise; // 0x4e0(0x08)
	TWeakObjectPtr<UParticleSystemComponent> BleedParticlesComponent; // 0x4e8(0x08)
	TWeakObjectPtr<UAudioComponent> PanicAudioComponent; // 0x4f0(0x08)
	float RagdollForceModifier; // 0x4f8(0x04)
	float DeathYRotationSpeed; // 0x4fc(0x04)
	float DeathXRotationSpeed; // 0x500(0x04)
	float SearchRange; // 0x504(0x04)
	float NewPointMax; // 0x508(0x04)
	float NewPointMin; // 0x50c(0x04)
	float DeathSpeed; // 0x510(0x04)
	float DeathAcceleration; // 0x514(0x04)
	float AcidRate; // 0x518(0x04)
	float PostDeathAcidTime; // 0x51c(0x04)
	bool HasDied; // 0x538(0x01)
	bool IsRightDestroyed; // 0x539(0x01)
	bool IsLeftDestroyed; // 0x53a(0x01)
	bool dropAcid; // 0x53b(0x01)

	void StopSpinAndDie();
	void SetDropAcid(bool dropAcid);
	void OnStartDeathPanic();
	void OnRep_DropAcid();
	void OnRep_Death();
	void OnRagdollHitGround(UPrimitiveComponent* HitComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, FVector NormalImpulse, FHitResult Hit);
	void OnBladderDamage(float amount);
	void OnArmorDestroyed(FName Name);
	void HideMesh();
	bool GetDropAcid();
	bool AreBladdersDestroyed();
};

// Class FSD.BomberAnimInstance
// Size: 0x300 (Inherited: 0x2f0)
struct UBomberAnimInstance : UFlyingBugAnimInstance {
	bool IsBombing; // 0x2f0(0x01)
	bool IsSpiraling; // 0x2f1(0x01)
};

// Class FSD.BoscoAbillity
// Size: 0x68 (Inherited: 0x30)
struct UBoscoAbillity : UDataAsset {
	FName AbillityName; // 0x30(0x08)
	UAnimSequenceBase* AbillityAnimation; // 0x38(0x08)
	USoundBase* VoiceOnUse; // 0x40(0x08)
	enum class EBoscoAbillityTargetPreference TargetType; // 0x48(0x01)
	float Cooldown; // 0x4c(0x04)
	float WindUp; // 0x50(0x04)
	float Duration; // 0x54(0x04)
	float Range; // 0x58(0x04)
	float RechargeTime; // 0x5c(0x04)
	int32_t MaxCharges; // 0x60(0x04)
	bool TargetActorIfValid; // 0x64(0x01)
	bool RotateTowardsTarget; // 0x65(0x01)
};

// Class FSD.BoscoSpawnActorAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoSpawnActorAbillity : UBoscoAbillity {
	AActor* SpawnedActorClass; // 0x68(0x08)
};

// Class FSD.BoscoProjectileAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoProjectileAbillity : UBoscoAbillity {
	AProjectile* projectileClass; // 0x68(0x08)
};

// Class FSD.Bosco
// Size: 0x6c8 (Inherited: 0x378)
struct ABosco : ADeepPathfinderCharacter {
	UHealthComponent* HealthComponent; // 0x3b0(0x08)
	UBoscoAbillityComponent* AbillityComponent; // 0x3b8(0x08)
	UDamageComponent* Damage; // 0x3c0(0x08)
	UPawnSensingComponent* Senses; // 0x3c8(0x08)
	UDroneMiningToolBase* MiningTool; // 0x3d0(0x08)
	UBobbingComponent* BobbingComponent; // 0x3d8(0x08)
	USkeletalMeshComponent* BoscoMesh; // 0x3e0(0x08)
	UHitscanComponent* DroneHitScan; // 0x3e8(0x08)
	USpotLightComponent* SpotLightComponent; // 0x3f0(0x08)
	UPointLightComponent* PointLightComponent; // 0x3f8(0x08)
	UParticleSystemComponent* LTrail; // 0x400(0x08)
	UParticleSystemComponent* RTrail; // 0x408(0x08)
	UAudioComponent* MomentumSound; // 0x410(0x08)
	UDialogDataAsset* DefendDrilldozerShout; // 0x418(0x08)
	UDialogDataAsset* MineOrderShout; // 0x420(0x08)
	UDialogDataAsset* KillOrderShout; // 0x428(0x08)
	UDialogDataAsset* GoToOrderShout; // 0x430(0x08)
	UDialogDataAsset* ReviveOrderShout; // 0x438(0x08)
	UDialogDataAsset* PickupGemShout; // 0x440(0x08)
	UDialogDataAsset* ReviveThankShout; // 0x448(0x08)
	UDialogDataAsset* GeneralCallShout; // 0x450(0x08)
	UDialogDataAsset* RocketAbillityShout; // 0x458(0x08)
	UDialogDataAsset* CryoGrenadeAbillityShout; // 0x460(0x08)
	USoundBase* MineResponse; // 0x468(0x08)
	USoundBase* CombatResponse; // 0x470(0x08)
	USoundBase* LightResponse; // 0x478(0x08)
	USoundBase* ReviveResponse; // 0x480(0x08)
	USoundBase* AbillityResponse; // 0x488(0x08)
	USoundBase* CurrentResponse; // 0x490(0x08)
	float ResponseTime; // 0x498(0x04)
	FMulticastInlineDelegate OnReviveused; // 0x4a0(0x10)
	FMulticastInlineDelegate OnStateChanged; // 0x4b0(0x10)
	float CarryingSpeed; // 0x4d0(0x04)
	float CarryingAcceleration; // 0x4d4(0x04)
	float CarryingDampOmega; // 0x4d8(0x04)
	FGameplayTagContainer LosMatchTags; // 0x4f0(0x20)
	float SeeTargetTime; // 0x510(0x04)
	USoundBase* AbillityErrorSound; // 0x518(0x08)
	float INcreasedMiningArea; // 0x520(0x04)
	float TimeToResetMiningBoost; // 0x524(0x04)
	float MiningBoosMultiplier; // 0x528(0x04)
	TArray<UItemUpgrade*> Upgrades; // 0x530(0x10)
	UBoscoProjectileAbillity* RocketAbillity; // 0x540(0x08)
	UBoscoProjectileAbillity* CryoGrenadeAbillity; // 0x548(0x08)
	FGuid SavegameID; // 0x550(0x10)
	UItemID* ItemID; // 0x560(0x08)
	UUpgradableBoscoComponent* Upgradable; // 0x568(0x08)
	UAnimSequenceBase* SaluteAnimation; // 0x570(0x08)
	UAnimSequenceBase* PickupGemAnimation; // 0x578(0x08)
	UAnimSequenceBase* DropGemAnimation; // 0x580(0x08)
	TArray<UAnimSequenceBase*> HitReaction; // 0x588(0x10)
	float SaluteDuration; // 0x598(0x04)
	UDroneSkinnableComponent* Skinnable; // 0x5a0(0x08)
	TArray<FBoscoLightSetting> LightSettings; // 0x5a8(0x10)
	int32_t TargetLightSetting; // 0x5b8(0x04)
	TArray<UBoscoAbillity*> CombatAbillities; // 0x5c0(0x10)
	AActor* RotateTarget; // 0x5d0(0x08)
	FVector LookAtLocation; // 0x5d8(0x0c)
	USoundCue* ShootSound; // 0x5e8(0x08)
	float ShootSoundFadeout; // 0x5f0(0x04)
	USoundCue* ShootSoundTail; // 0x5f8(0x08)
	UAudioComponent* ShootSoundInstance; // 0x600(0x08)
	UParticleSystem* MuzzleEffect; // 0x608(0x08)
	UParticleSystem* TracerEffect; // 0x610(0x08)
	float FireRate; // 0x618(0x04)
	int32_t MinShotsInBurst; // 0x61c(0x04)
	int32_t MaxShotsInBurst; // 0x620(0x04)
	float MaxRandomBurstCooldown; // 0x624(0x04)
	float MinRandomBurstCooldown; // 0x628(0x04)
	float MaxFiringAngle; // 0x62c(0x04)
	float MaxEngagementRange; // 0x630(0x04)
	float MinTracerDistance; // 0x634(0x04)
	float TracerSpeed; // 0x638(0x04)
	USoundBase* ReviveSirens; // 0x640(0x08)
	TWeakObjectPtr<UAudioComponent> ReviveSirensComponent; // 0x648(0x08)
	float DistanceToFacePlayer; // 0x650(0x04)
	float RotationSpeed; // 0x654(0x04)
	float PrepareToMineRange; // 0x658(0x04)
	float MiningRange; // 0x65c(0x04)
	int32_t MaxRevives; // 0x694(0x04)
	bool IsFiring; // 0x6a8(0x01)
	bool IsInRangeToMine; // 0x6a9(0x01)
	bool IsPreparedToMine; // 0x6aa(0x01)
	bool IsMining; // 0x6ab(0x01)
	bool IsReviving; // 0x6ac(0x01)
	bool IsRotateMode; // 0x6ad(0x01)
	ABoscoController* DroneController; // 0x6b8(0x08)
	enum class EDroneAIState CurrentState; // 0x6c0(0x01)

	void UseABillity();
	void StopShootingSound();
	void StateChanged(enum class EDroneAIState aCurrentState);
	void StartSelfDestruct();
	void SetIsReviving(bool aIsReviving);
	void SetIsRepairing(bool isRepairing);
	void SelfDestruct();
	void ReviveCounterChanged(int32_t remainingCharges);
	void Respond();
	void PlaySalute();
	void OnWeaponFired(FVector Location);
	void OnRep_State(enum class EDroneAIState prevState);
	void OnReadyToShoot();
	void OnNotReadyToShoot();
	void OnHit(float amount, float BaseAmount, UPrimitiveComponent* Component, UFSDPhysicalMaterial* PhysMat, FName BoneName);
	void OnGrabbedGem();
	void MineEffects(UTerrainMaterial* aTerrainMaterial, FVector_NetQuantize aLocation, FRotator aRotation);
	UUpgradableBoscoComponent* GetUpgradeComponent();
	int32_t GetReviveCharges();
	UBoscoAbillityComponent* GetPlayerAbillity();
	enum class EDroneAIState GetCurrentState();
	bool GetCarryInterrupted();
	bool DoPickupGemAnimation();
	void All_OnSelfDestruct();
};

// Class FSD.BoscoAnimInstance
// Size: 0x2a0 (Inherited: 0x270)
struct UBoscoAnimInstance : UAnimInstance {
	FMulticastInlineDelegate OnWeaponsReady; // 0x268(0x10)
	FMulticastInlineDelegate OnWeaponsNotReady; // 0x278(0x10)
	float DigAnimPlayRate; // 0x288(0x04)
	enum class EDroneAIState CurrentState; // 0x28c(0x01)
	bool IsReadyToMine; // 0x28d(0x01)
	bool IsMining; // 0x28e(0x01)
	bool IsFiring; // 0x28f(0x01)
	bool IsReviving; // 0x290(0x01)
	bool IsCarryingGem; // 0x291(0x01)
};

// Class FSD.BoscoWeaponsFoldedOutNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedOutNotify : UAnimNotify {
};

// Class FSD.BoscoWeaponsFoldedInNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedInNotify : UAnimNotify {
};

// Class FSD.BoscoAbillityComponent
// Size: 0x150 (Inherited: 0xb0)
struct UBoscoAbillityComponent : UActorComponent {
	FMulticastInlineDelegate OnAbillityChargeProgress; // 0xb0(0x10)
	FMulticastInlineDelegate OnAbillityChargeUsed; // 0xc0(0x10)
	TArray<UItemUpgrade*> Upgrades; // 0xd0(0x10)
	AProjectileBase* projectileClass; // 0xf0(0x08)
	UAnimSequenceBase* Animation; // 0xf8(0x08)
	USoundBase* VoiceOnUse; // 0x100(0x08)
	TWeakObjectPtr<AActor> Target; // 0x108(0x08)
	TWeakObjectPtr<ABosco> AbillityOwner; // 0x110(0x08)

	int32_t GetMaxCharges();
	int32_t GetCharges();
};

// Class FSD.FSDAIController
// Size: 0x358 (Inherited: 0x328)
struct AFSDAIController : AAIController {
	FMulticastInlineDelegate OnMessageBehaviorTreeEvent; // 0x328(0x10)
	FMulticastInlineDelegate OnAlertedEvent; // 0x338(0x10)
	enum class ECollisionChannel LOSTraceChannel; // 0x348(0x01)
	TWeakObjectPtr<APlayerCharacter> TargetedPlayer; // 0x34c(0x08)

	void SetAlerted(bool isAlerted);
	void ResumeLogic();
	void RegisterBlackboardChanges(FName Key);
	void Recieve_BlackboardValueChanged(FName KeyName);
	void PauseLogic();
	void OnAttackingChanged(bool attacking);
	bool GetIsAlerted();
};

// Class FSD.BoscoController
// Size: 0x5c0 (Inherited: 0x358)
struct ABoscoController : AFSDAIController {
	UBehaviorTree* BehaviourTree; // 0x358(0x08)
	float CheckOutOfTheWayInterval; // 0x360(0x04)
	float DistCountAsSameHit; // 0x36c(0x04)
	FMulticastInlineDelegate OnFollowTargetChangedDelegate; // 0x370(0x10)
	UTerrainMaterial* HearthstoneCrystalMaterial; // 0x438(0x08)
	float SearchForEnemiesInterval; // 0x440(0x04)
	float SaluteDelay; // 0x448(0x04)
	float SaluteCooldown; // 0x450(0x04)
	float CheckGraberInterval; // 0x458(0x04)
	float MaxThrowStrength; // 0x460(0x04)
	float MaxThrowRange; // 0x464(0x04)
	float RepairRange; // 0x468(0x04)
	float DistanceCountedAsClose; // 0x46c(0x04)
	FGameplayTagQuery TargetQuery; // 0x470(0x48)
	FGameplayTagQuery LaserPointerTargetQuery; // 0x4b8(0x48)
	FGameplayTagQuery FollowTargetTagQuery; // 0x500(0x48)
	float ReviveHealthPercentage; // 0x548(0x04)
	UDroneUseComponent* CurrentUse; // 0x550(0x08)
	AGem* TryingToPickGem; // 0x558(0x08)

	void ReviveTarget();
	void ResetToFollowState();
	void RegisterPlayer(APlayerCharacter* APlayerCharacter);
	void PickupGem();
	void OnUseDone(int32_t TimesUsed);
	void OnSecondaryLaserPointer(AActor* aTarget, FVector aLocation);
	void OnPlayerShout(APlayerCharacter* APlayerCharacter);
	void OnPlayerSalute(APlayerCharacter* aCharacater);
	void OnPlayerLeave(AFSDPlayerState* APlayerState);
	void OnLaserPointer(FLaserPointerTarget HitInfo);
	void OnJobFinished();
	void OnEscortTargetDied(UHealthComponentBase* Health);
	FVector GetPointNearPlayers();
	AActor* GetFollowTarget();
	void GenerateRelativeLocation(AActor* aTarget, float aRange, float aHeightRestriction, float aMinRange, bool aTryToStayOutOfTheWay, bool aStayBehind);
	void GemUsed(APlayerCharacter* usedBy);
	void ConfirmPickup();
};

// Class FSD.SimpleBossFight
// Size: 0x48 (Inherited: 0x28)
struct USimpleBossFight : UObject {
	FBossFight BossFight; // 0x30(0x18)
};

// Class FSD.BossFightInterface
// Size: 0x28 (Inherited: 0x28)
struct UBossFightInterface : UInterface {

	bool IsStillValid();
	UBossFightWidget* GetWidgetClass();
	AActor* GetBossActor();
};

// Class FSD.BossFightWidget
// Size: 0x240 (Inherited: 0x230)
struct UBossFightWidget : UUserWidget {
	TScriptInterface<IBossFightInterface> BossFight; // 0x230(0x10)
};

// Class FSD.BoxFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBoxFunctionLibrary : UBlueprintFunctionLibrary {

	FBox CreateBoxAt(FVector Location, FVector Size);
	FVector ClosestPointToBox(FVector Pos, FBox Box);
	float BoxSize(FBox Box);
	FVector BoxExtends(FBox Box);
	FVector BoxCenter(FBox Box);
};

// Class FSD.GenerationComponent
// Size: 0x3f0 (Inherited: 0x3f0)
struct UGenerationComponent : UPrimitiveComponent {
};

// Class FSD.BoxGenerationComponent
// Size: 0x410 (Inherited: 0x3f0)
struct UBoxGenerationComponent : UGenerationComponent {
	FVector Extends; // 0x3f0(0x0c)
	bool IsCarver; // 0x3fc(0x01)
	float NoiseRange; // 0x400(0x04)
	bool Visible; // 0x404(0x01)
	UFloodFillSettings* Noise; // 0x408(0x08)
};

// Class FSD.GenerationItem
// Size: 0x228 (Inherited: 0x220)
struct AGenerationItem : AActor {
	bool Visible; // 0x220(0x01)
	bool AddToLevel; // 0x221(0x01)
};

// Class FSD.BoxGenerationItem
// Size: 0x230 (Inherited: 0x228)
struct ABoxGenerationItem : AGenerationItem {
	UBoxGenerationComponent* BoxComponent; // 0x228(0x08)
};

// Class FSD.BTDecorator_AttackInRange
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_AttackInRange : UBTDecorator_BlackboardBase {
	FName AttackName; // 0x90(0x08)
};

// Class FSD.BTDecorator_CanSeeTarget
// Size: 0xa8 (Inherited: 0x68)
struct UBTDecorator_CanSeeTarget : UBTDecorator {
	bool UseAsync; // 0x68(0x01)
	float MaxRange; // 0x6c(0x04)
	FVector EyeLocationOffset; // 0x70(0x0c)
	FBlackboardKeySelector TargetKey; // 0x80(0x28)
};

// Class FSD.BTDecorator_CheckObstruction
// Size: 0xb0 (Inherited: 0x68)
struct UBTDecorator_CheckObstruction : UBTDecorator {
	float Range; // 0x68(0x04)
	bool UseOwnerCenterMass; // 0x6c(0x01)
	FVector EyeLocationOffset; // 0x70(0x0c)
	FName RangedSocket; // 0x7c(0x08)
	FBlackboardKeySelector TargetKey; // 0x88(0x28)
};

// Class FSD.BTDecorator_CheckPlayerCount
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_CheckPlayerCount : UBTDecorator {
	int32_t playerCount; // 0x68(0x04)
	bool AllowLessThanCount; // 0x6c(0x01)
};

// Class FSD.BTDecorator_ConditionalGuard
// Size: 0x90 (Inherited: 0x68)
struct UBTDecorator_ConditionalGuard : UBTDecorator {
	FBlackboardKeySelector GuardKey; // 0x68(0x28)
};

// Class FSD.BTDecorator_FormationGuard
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_FormationGuard : UBTDecorator {
};

// Class FSD.BTDecorator_InRange
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRange : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
};

// Class FSD.BTDecorator_InRangeBB
// Size: 0xe8 (Inherited: 0x90)
struct UBTDecorator_InRangeBB : UBTDecorator_BlackboardBase {
	FBlackboardKeySelector MinRangeKey; // 0x90(0x28)
	FBlackboardKeySelector MaxRangeKey; // 0xb8(0x28)
	enum class FAIDistanceType GeometricDistanceType; // 0xe0(0x01)
};

// Class FSD.BTDecorator_InRangeEx
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRangeEx : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
};

// Class FSD.BTDecorator_InRangeOfTarget
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_InRangeOfTarget : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
};

// Class FSD.BTDecorator_IsFacing
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_IsFacing : UBTDecorator_BlackboardBase {
	float MaxAngle; // 0x90(0x04)
};

// Class FSD.BTDecorator_LockRotation
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_LockRotation : UBTDecorator {
};

// Class FSD.BTDecorator_MessageAI
// Size: 0x78 (Inherited: 0x68)
struct UBTDecorator_MessageAI : UBTDecorator {
	FName ActivationMessage; // 0x68(0x08)
	FName DeactivationMessage; // 0x70(0x08)
};

// Class FSD.BTDecorator_ModifySpeed
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_ModifySpeed : UBTDecorator {
	float SpeedModifier; // 0x68(0x04)
};

// Class FSD.BTDecorator_RandomChance
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomChance : UBTDecorator {
	float Chance; // 0x68(0x04)
};

// Class FSD.BTDecorator_RandomCooldown
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomCooldown : UBTDecorator {
	FRandRange CoolDownTime; // 0x68(0x08)
};

// Class FSD.BTDecorator_SetTagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_SetTagRandomCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68(0x08)
	FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool TriggerOnActivation; // 0x79(0x01)
};

// Class FSD.BTDecorator_TagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_TagRandomCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68(0x08)
	FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool bActivatesCooldown; // 0x79(0x01)
};

// Class FSD.BTDecorator_RandomLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomLoop : UBTDecorator {
	float Chance; // 0x68(0x04)
};

// Class FSD.BTDecorator_VariableLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_VariableLoop : UBTDecorator {
	FIRandRange NumLoops; // 0x68(0x08)
};

// Class FSD.BTDecorator_SharedCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedCooldown : UBTDecorator {
	FRandRange CoolDownTime; // 0x68(0x08)
	FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTDecorator_SharedAttackCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedAttackCooldown : UBTDecorator {
	FRandRange CoolDownTime; // 0x68(0x08)
	FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTServer_ChaseTarget
// Size: 0x100 (Inherited: 0x70)
struct UBTServer_ChaseTarget : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	FGameplayTag SwitchTargetCooldownTag; // 0x9c(0x08)
	FGameplayTagQuery TargetingQuery; // 0xa8(0x48)
	bool IsFlying; // 0xf0(0x01)
	bool CanShoot; // 0xf1(0x01)
	float TargetingRange; // 0xf4(0x04)
	float SwitchTargetTime; // 0xf8(0x04)
	float SwitchTargetDeviation; // 0xfc(0x04)
};

// Class FSD.BTService_FindPlayer
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_FindPlayer : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	float TargetingRange; // 0xa0(0x04)
};

// Class FSD.BTService_FindAttackable
// Size: 0xf0 (Inherited: 0x70)
struct UBTService_FindAttackable : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	float TargetingRange; // 0xa0(0x04)
	FGameplayTagQuery TargetQuery; // 0xa8(0x48)
};

// Class FSD.BTService_SetStance
// Size: 0xa0 (Inherited: 0x70)
struct UBTService_SetStance : UBTService {
	FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	float Distance; // 0x98(0x04)
};

// Class FSD.BTService_CheckPathToTarget
// Size: 0xc0 (Inherited: 0x70)
struct UBTService_CheckPathToTarget : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	FBlackboardKeySelector ResultKey; // 0x98(0x28)
};

// Class FSD.BTService_UpdateMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateMoveToTarget : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
	float VerticalOffset; // 0xc4(0x04)
};

// Class FSD.BTService_UpdateFlyingMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateFlyingMoveToTarget : UBTService {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
};

// Class FSD.BTService_UpdateMoveInFormation
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_UpdateMoveInFormation : UBTService {
	float LookAheadTime; // 0x70(0x04)
	FBlackboardKeySelector TargetLocationKey; // 0x78(0x28)
	float AttackerRadius; // 0xa0(0x04)
};

// Class FSD.BTTask_Attack
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_Attack : UBTTaskNode {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
	FName AttackName; // 0x98(0x08)

	void OnAttackCompleted(UBehaviorTreeComponent* btComponent);
};

// Class FSD.BTTask_FakePhysicsMove
// Size: 0xc8 (Inherited: 0x98)
struct UBTTask_FakePhysicsMove : UBTTask_BlackboardBase {
	float MinTime; // 0x98(0x04)
	float EndMaxSpeed; // 0x9c(0x04)
	FVector InitialLocalVelocity; // 0xa0(0x0c)
	FVector InitialGlobalVelocity; // 0xac(0x0c)
	bool EndRequireSolidGround; // 0xb8(0x01)
	UFakeMoverSettings* MoveSettings; // 0xc0(0x08)
};

// Class FSD.BTTask_FindPointNearCeiling
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_FindPointNearCeiling : UBTTask_BlackboardBase {
	float CloseToCeilingBias; // 0x98(0x04)
	float LookForCeilingLength; // 0x9c(0x04)
	float SearchRadius; // 0xa0(0x04)
};

// Class FSD.BTTask_MoveToTarget
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_MoveToTarget : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	bool EnterAttackStanceOnMoveFinished; // 0x9c(0x01)
};

// Class FSD.BTTask_MoveToSlot
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_MoveToSlot : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	float LookAheadTime; // 0x9c(0x04)
	float VerticalOffset; // 0xa0(0x04)
	float UpdateRate; // 0xa4(0x04)
};

// Class FSD.BTTask_SetAttacking
// Size: 0x98 (Inherited: 0x70)
struct UBTTask_SetAttacking : UBTTaskNode {
	FBlackboardKeySelector TargetKey; // 0x70(0x28)
};

// Class FSD.BTTask_TriggerAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_TriggerAI : UBTTaskNode {
	FName TriggerName; // 0x70(0x08)
};

// Class FSD.BTTask_MessageAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_MessageAI : UBTTaskNode {
	FName MessageName; // 0x70(0x08)
};

// Class FSD.BTTask_SetCondition
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_SetCondition : UBTTaskNode {
	FBlackboardKeySelector ConditionalKey; // 0x70(0x28)
	bool Value; // 0x98(0x01)
};

// Class FSD.BuildRestriction
// Size: 0x38 (Inherited: 0x30)
struct UBuildRestriction : UDataAsset {
	int32_t BuildType; // 0x30(0x04)
	int32_t Platform; // 0x34(0x04)
};

// Class FSD.BurrowComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UBurrowComponent : UActorComponent {

	void Unburrow(UAnimMontage* customMontage);
	void Burrow(UAnimMontage* customMontage);
};

// Class FSD.CalldownItem
// Size: 0x3c8 (Inherited: 0x368)
struct ACalldownItem : AAnimatedItem {
	UItemPlacerAggregator* ItemPlacerClass; // 0x368(0x08)
	ARessuplyPod* SupplyPodClass; // 0x370(0x08)
	UResourceData* ResouceRequired; // 0x378(0x08)
	FText OrderDescription; // 0x380(0x18)
	FText LogText; // 0x398(0x18)
	AActor* ResupplyBeacon; // 0x3b0(0x08)
	UItemPlacerAggregator* ItemPlacerInstance; // 0x3b8(0x08)
	float Cooldown; // 0x3c0(0x04)
	float CooldownRemaining; // 0x3c4(0x04)

	void Server_Call_Resupply(FVector Location);
};

// Class FSD.CampaignManager
// Size: 0xb8 (Inherited: 0x28)
struct UCampaignManager : UObject {
	FMulticastInlineDelegate OnCampaignCompleted; // 0x28(0x10)
	FMulticastInlineDelegate OnCampaignChanged; // 0x38(0x10)
	UCampaign* MainCampaign; // 0x48(0x08)
	TArray<UCampaign*> WeeklyCampaigns; // 0x50(0x10)
	TArray<UCampaign*> MatrixCoreHuntCampaigns; // 0x60(0x10)
	TArray<UCampaign*> SideCampaigns; // 0x70(0x10)
	TArray<UCampaign*> EventCampaigns; // 0x80(0x10)
	UCampaign* ActiveCampaign; // 0x90(0x08)
	int32_t NumFailedRequests; // 0x98(0x04)
	bool WeeklyBackendDataValid; // 0x9c(0x01)
	int32_t WeeklyBackendSeed; // 0xa0(0x04)
	FDateTime WeeklyBackendExpirationTime; // 0xa8(0x08)
	FDateTime LastRequestTime; // 0xb0(0x08)

	void StartNewCampaign(UCampaign* campaignClass, UFSDSaveGame* SaveGame);
	void SkipMainCampaign(AFSDPlayerController* Player);
	void OnEventsRefreshed();
	bool IsWeeklyCampaignCompleted(UObject* WorldContext, enum class ECampaignType campaigntype);
	bool IsInCampaignMission(AFSDPlayerController* Player);
	bool IsCampaignRestrictionsMet(UObject* WorldContextObject, UGeneratedMission* mission, UDifficultySetting* optionalDifficulty);
	bool IsCampaignMission(UObject* WorldContextObject, UGeneratedMission* mission);
	bool IsActiveCampaign(UCampaign* Campaign);
	TArray<UCampaign*> GetUncompletedCampaigns(AFSDPlayerController* Player);
	UGeneratedMission* GetCampaingMissionFromSeeds(UObject* WorldContextObject, int32_t GlobalSeed, int32_t MissionSeed);
	UGeneratedMission* GetCampaingMission(TArray<UGeneratedMission*> missions, int32_t MissionSeed);
	void CampaignCompletedDelegate__DelegateSignature();
	void AbortActiveCampaign(UFSDSaveGame* SaveGame);
};

// Class FSD.Campaign
// Size: 0x160 (Inherited: 0x28)
struct UCampaign : UObject {
	TArray<UCampaignMission*> missions; // 0x28(0x10)
	TArray<UCampaignRequirement*> Requirements; // 0x38(0x10)
	TArray<UCampaignRequirement*> VisibilityRequirements; // 0x48(0x10)
	UPlayerCharacterID* RequiredCharacterID; // 0x58(0x08)
	TArray<UDifficultySetting*> RestrictedToDifficulties; // 0x60(0x10)
	int32_t Progress; // 0x70(0x04)
	FGuid SavegameID; // 0x74(0x10)
	bool CanAbort; // 0x84(0x01)
	bool CanSkip; // 0x85(0x01)
	enum class ECampaignMutators Mutators; // 0x88(0x04)
	FText TitlePrefix; // 0x90(0x18)
	FText Title; // 0xa8(0x18)
	FText DescriptionHeader; // 0xc0(0x18)
	FText Description; // 0xd8(0x18)
	FText RewardText; // 0xf0(0x18)
	FText RewardFlavorText; // 0x108(0x18)
	UTexture2D* Icon; // 0x120(0x08)
	TSoftObjectPtr<UTexture2D> Picture; // 0x128(0x28)
	enum class ECampaignType campaigntype; // 0x150(0x01)
	UMissionStat* CampaignCompletedMissionStat; // 0x158(0x08)

	bool IsComplete();
	bool IsCampaignComplete(UObject* WorldContext, UCampaign* Campaign);
	UCampaign* GetReference(UCampaign* Campaign);
	UCampaignMission* GetPreviousMission();
	UTexture2D* GetPicture();
	FText GetCampaignTitle(UCampaign* Campaign);
	UCampaignMission* GetActiveMission();
	bool CanStartCampaign(AFSDPlayerController* Player);
	bool CanSeeCampaign(APlayerController* PlayerController);
	bool AreRestrictionsMet(AFSDPlayerController* Player, UDifficultySetting* optionalDifficulty);
};

// Class FSD.CampaignMission
// Size: 0x68 (Inherited: 0x30)
struct UCampaignMission : UDataAsset {
	UPlanetZone* PlanetZone; // 0x30(0x08)
	FRequiredMissionItem mission; // 0x38(0x18)
	TArray<UReward*> Rewards; // 0x50(0x10)
	UDialogDataAsset* MissionCompleteShout; // 0x60(0x08)

	UMissionTemplate* GetMissionTemplate();
};

// Class FSD.CampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UCampaignRequirement : UObject {

	bool IsRequirementMet(AFSDPlayerController* Player, UCampaign* Campaign);
};

// Class FSD.ValidWeeklySeedCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UValidWeeklySeedCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CaracterLevelCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct UCaracterLevelCampaignRequirement : UCampaignRequirement {
	UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
};

// Class FSD.PlayerRankCampaignRequirement
// Size: 0x30 (Inherited: 0x28)
struct UPlayerRankCampaignRequirement : UCampaignRequirement {
	int32_t RankRequirement; // 0x28(0x04)
};

// Class FSD.RetirementCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct URetirementCampaignRequirement : UCampaignRequirement {
	UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
};

// Class FSD.WeeklyTimerCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UWeeklyTimerCampaignRequirement : UCampaignRequirement {

	FTimespan GetWeeklyTimeLeft(AFSDPlayerController* Player);
	FTimespan GetTimeUntillNewCampaign(AFSDPlayerController* Player);
	bool GetHasCompleted(UCampaign* Campaign, AFSDPlayerController* Player);
};

// Class FSD.AnyRetiredCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UAnyRetiredCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CamapaignCompletedRequirement
// Size: 0x30 (Inherited: 0x28)
struct UCamapaignCompletedRequirement : UCampaignRequirement {
	UCampaign* Campaign; // 0x28(0x08)
};

// Class FSD.CapacityBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UCapacityBasedItemAggregator : UItemAggregator {
	FMulticastInlineDelegate OnCurrentAmountChanged; // 0xc8(0x10)
	FMulticastInlineDelegate OnMaxAmountChanged; // 0xd8(0x10)
	FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool showClipCount; // 0x138(0x01)

	void ReloadStarted();
	void ReloadComplete();
	int32_t GetMaxAmount();
	int32_t GetCurrentAmount();
};

// Class FSD.CapacityHoldingItemAggregator
// Size: 0x160 (Inherited: 0x140)
struct UCapacityHoldingItemAggregator : UCapacityBasedItemAggregator {
	int32_t MaxAmmo; // 0x150(0x04)
	int32_t AmmoCount; // 0x154(0x04)
	bool UseRejoin; // 0x158(0x01)

	void UseAmmo(int32_t count);
	void SetMaxAmmo(int32_t InMaxAmmo, bool InChangeCurrentAmount);
	void Resupply(float percentage);
	void OnRep_MaxAmmo();
	void OnRep_AmmoCount();
	void AddAmmo(int32_t amount);
};

// Class FSD.CappedResource
// Size: 0x78 (Inherited: 0x28)
struct UCappedResource : UObject {
	FMulticastInlineDelegate OnChanged; // 0x28(0x10)
	FMulticastInlineDelegate OnIncreased; // 0x38(0x10)
	FMulticastInlineDelegate OnFull; // 0x48(0x10)
	UResourceData* Data; // 0x58(0x08)
	float currentAmount; // 0x60(0x04)
	float MaxAmount; // 0x64(0x04)
	float TotalCollected; // 0x68(0x04)
	int32_t FullFlag; // 0x6c(0x04)

	float TransferAll(UCappedResource* Receiver);
	float Transfer(float amount, UCappedResource* Receiver);
	void OnRep_FullFlag(int32_t OldValue);
	void OnRep_CurrentAmount(float OldAmount);
	bool IsObjectiveResource(UObject* WorldContext, bool IsCompleted);
	bool IsFull();
	bool IsEmpty();
	bool IsCraftingResource();
	FText GetTitle();
	FColor GetColor();
	float GetCapacityPct();
	float Deduct(float amount);
	float Add(float amount);
};

// Class FSD.UsableComponentBase
// Size: 0xd8 (Inherited: 0xb0)
struct UUsableComponentBase : UActorComponent {
	float UseCooldown; // 0xb0(0x04)
	bool MustBeGroundedToUse; // 0xb4(0x01)
	bool CanUseStrict; // 0xb5(0x01)
	UUseAnimationSetting* AnimationSettings; // 0xb8(0x08)
	int32_t Priority; // 0xc0(0x04)
	bool UseableByOwnerOnly; // 0xc4(0x01)
	USceneComponent* RestrictToCollider; // 0xc8(0x08)
	enum class EUseRestriction UseRestrictionAllowance; // 0xd0(0x01)
	bool IsRayTraceTriggered; // 0xd1(0x01)
	bool ResetUsingOnCompletion; // 0xd2(0x01)

	void SetRayTraceTriggered(bool rayTraceTriggered);
	FText GetUseText(APlayerCharacter* User);
	float GetUseProgressInPercent(APlayerCharacter* User);
	UTexture2D* GetUsableIcon();
	bool GetShowUsingUI();
	bool GetIsRayTraceTriggerd();
	bool GetHideProgressBar(APlayerCharacter* User);
	bool GetHideActionText(APlayerCharacter* User);
	void EndUse(APlayerCharacter* User);
	void BeginUse(APlayerCharacter* User);
};

// Class FSD.UsableComponent
// Size: 0x100 (Inherited: 0xd8)
struct UUsableComponent : UUsableComponentBase {
	UDialogDataAsset* ShoutBegin; // 0xd8(0x08)
	FText UseText; // 0xe0(0x18)
	bool ResetOnFail; // 0xf8(0x01)
	bool SwitchToUsingState; // 0xf9(0x01)

	void SetUseText(FText NewText);
	bool HasDuration();
};

// Class FSD.InstantUsable
// Size: 0x138 (Inherited: 0x100)
struct UInstantUsable : UUsableComponent {
	FMulticastInlineDelegate OnUsedBy; // 0x100(0x10)
	FMulticastInlineDelegate OnUsableChanged; // 0x110(0x10)
	bool bShowUsingUI; // 0x120(0x01)
	USoundCue* AudioCompletedUse; // 0x128(0x08)
	bool Usable; // 0x130(0x01)
	bool TurnOffAfterUse; // 0x131(0x01)

	void SetCanUse(bool canUse);
	void OnRep_Usable();
};

// Class FSD.CarriableInstantUsable
// Size: 0x138 (Inherited: 0x138)
struct UCarriableInstantUsable : UInstantUsable {
};

// Class FSD.CarriableComponent
// Size: 0x118 (Inherited: 0xb0)
struct UCarriableComponent : UActorComponent {
	FMulticastInlineDelegate OnPickedUp; // 0xb8(0x10)
	FMulticastInlineDelegate OnDropped; // 0xc8(0x10)
	APlayerCharacter* CarriedBy; // 0xd8(0x08)
	enum class EUseRestriction UseRestriction; // 0xe0(0x01)
	FVector Offset; // 0xe4(0x0c)

	bool PickupItem(APlayerCharacter* byCharacter);
	void OnRep_CarriedBy();
	void DropItem();
	void AttachChanged(bool Attached, FVector PrevScale);
};

// Class FSD.ResourceData
// Size: 0xf0 (Inherited: 0x30)
struct UResourceData : UDataAsset {
	FText Title; // 0x38(0x18)
	FText TitlePlural; // 0x50(0x18)
	FText Description; // 0x68(0x18)
	FColor Color; // 0x80(0x04)
	UTexture2D* Icon; // 0x88(0x08)
	int32_t BuyingPrice; // 0x90(0x04)
	int32_t SellingPrice; // 0x94(0x04)
	UMissionStat* MinedMissionStat; // 0x98(0x08)
	bool IsCraftingMaterial; // 0xa0(0x01)
	bool AffectedByMutators; // 0xa1(0x01)
	bool ScaleToMissionLength; // 0xa2(0x01)
	bool ScaleToHazardLevel; // 0xa3(0x01)
	bool ShowSeparatelyInEndScreen; // 0xa4(0x01)
	TSoftClassPtr<UObject> Spawnable; // 0xa8(0x28)
	bool IsWholeNumberResource; // 0xd0(0x01)
	int32_t CreditValue; // 0xd4(0x04)
	int32_t XPValue; // 0xd8(0x04)
	FGuid SavegameID; // 0xdc(0x10)

	float GetOwnedAmount(UObject* WorldContextObject);
};

// Class FSD.CarvedResourceData
// Size: 0x120 (Inherited: 0xf0)
struct UCarvedResourceData : UResourceData {
	TSoftObjectPtr<UCarvedResourceCreator> CarvedResourceCreator; // 0xf0(0x28)
	float UnitsPerCarver; // 0x118(0x04)

	UCarvedResourceCreator* LoadResourceCreator();
};

// Class FSD.CaveEntranceComponent
// Size: 0x400 (Inherited: 0x3f0)
struct UCaveEntranceComponent : UPrimitiveComponent {
	enum class ECaveEntranceType Direction; // 0x3f0(0x01)
};

// Class FSD.CaveEntrance
// Size: 0x238 (Inherited: 0x228)
struct ACaveEntrance : AGenerationItem {
	UCaveEntranceComponent* CaveEntranceComponent; // 0x228(0x08)
	enum class ECaveEntranceType EntranceType; // 0x230(0x01)
	bool HasBeenConverted; // 0x231(0x01)
};

// Class FSD.SpawnResourceGenerationItem
// Size: 0x240 (Inherited: 0x228)
struct ASpawnResourceGenerationItem : AGenerationItem {
	UResourceData* Resource; // 0x228(0x08)
	float BaseAmount; // 0x230(0x04)
	USphereComponent* Sphere; // 0x238(0x08)
};

// Class FSD.SpawnActorGenerationItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnActorGenerationItem : AGenerationItem {
	AActor* ActorToSpawn; // 0x228(0x08)
	UBoxComponent* Box; // 0x230(0x08)
};

// Class FSD.SpawnTriggerItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnTriggerItem : AGenerationItem {
	AActor* Trigger; // 0x228(0x08)
	FName Message; // 0x230(0x08)
};

// Class FSD.SubRoomItem
// Size: 0x238 (Inherited: 0x228)
struct ASubRoomItem : AGenerationItem {
	URoomGenerator* RoomGenerator; // 0x228(0x08)
	int32_t Layer; // 0x230(0x04)
};

// Class FSD.RandomSubRoomItem
// Size: 0x280 (Inherited: 0x228)
struct ARandomSubRoomItem : AGenerationItem {
	URoomGeneratorGroup* RoomGroup; // 0x228(0x08)
	FGameplayTagQuery tagQuery; // 0x230(0x48)
	int32_t Layer; // 0x278(0x04)
};

// Class FSD.DropPodCalldownLocationItem
// Size: 0x230 (Inherited: 0x228)
struct ADropPodCalldownLocationItem : AGenerationItem {
	AActor* CalldownClass; // 0x228(0x08)
};

// Class FSD.ProceduralSetup
// Size: 0x528 (Inherited: 0x220)
struct AProceduralSetup : AActor {
	bool ShowRoomEntrances; // 0x220(0x01)
	bool ShowPathObstacles; // 0x221(0x01)
	bool ShowItemNoisePattern; // 0x222(0x01)
	int32_t Seed; // 0x224(0x04)
	bool UseRandomSeed; // 0x228(0x01)
	FRandomStream RandomStream; // 0x230(0x08)
	FRandomStream RandomStreamServer; // 0x238(0x08)
	FRandomStream RandomStreamAsync; // 0x240(0x08)
	FRandomStream RandomStreamAsyncServer; // 0x248(0x08)
	FMulticastInlineDelegate OnEncounterSpawnedEvent; // 0x250(0x10)
	USpecialEvent* ForcedSpecialEvent; // 0x2c8(0x08)
	USpecialEvent* ForcedTreasure; // 0x2d0(0x08)
	bool UseMusicManager; // 0x300(0x01)
	ADeepCSGWorld* CSGWorld; // 0x308(0x08)
	UFloodFillSettings* PathfinderNoise; // 0x310(0x08)
	TArray<FVeinResource> VeinResources; // 0x318(0x10)
	TArray<FCarvedResource> CarvedResources; // 0x328(0x10)
	UMissionDNA* MissionDNA; // 0x338(0x08)
	TArray<FGemResourceAmount> GemResourcesToGenerate; // 0x340(0x10)
	TArray<FCollectableSpawnableItem> CollectablesToGenerate; // 0x358(0x10)
	enum class ESpawnSettings SpawnSettings; // 0x368(0x01)
	bool CanSpawnSpecialEvents; // 0x369(0x01)
	bool ShouldCarveTunnels; // 0x36a(0x01)
	bool CreateDirt; // 0x36b(0x01)
	UCaveInfluencer* DirtInfluencer; // 0x370(0x08)
	float DirtInfluencerRange; // 0x378(0x04)
	UTunnelParameters* TunnelParameters; // 0x388(0x08)
	float PathZPenalty; // 0x390(0x04)
	float PathDirectionPenalty; // 0x394(0x04)
	float PathEntranceAnglePenalty; // 0x398(0x04)
	TArray<FRoomNode> Rooms; // 0x3a8(0x10)
	TArray<FRoomNode> RoomsInitialState; // 0x3b8(0x10)
	TArray<FTunnelNode> Tunnels; // 0x3c8(0x10)
	FGeneratedInfluenceSets GeneratedInfluenceSets; // 0x3d8(0x18)
	FGeneratedInstantCarvers GeneratedInstantCarvers; // 0x3f8(0x10)
	FGeneratedDebris GeneratedDebris; // 0x408(0x58)
	UBiome* Biome; // 0x460(0x08)
	float missionLength; // 0x468(0x04)
	URoomDecorationObject* MiningpodCalldownLocationDecoration; // 0x470(0x08)
	TArray<FPathObstacle> PathObstacles; // 0x478(0x10)
	FInfluenceMap InfluenceMap; // 0x488(0x50)
	TArray<UResourceData*> SpawnedResources; // 0x4d8(0x10)
	float CaveDepth; // 0x4e8(0x04)
	AActor* PostProcessActor; // 0x4f0(0x08)
	USpecialEvent* SpecialEvent; // 0x4f8(0x08)
	bool IsInitialized; // 0x500(0x01)
	int32_t CurrentRoomPass; // 0x504(0x04)
	bool Pass1Completed; // 0x508(0x01)
	bool UsePerLevelCritterSpawning; // 0x509(0x01)

	void StartGenerationOnClient(AFSDPlayerController* client);
	void SpawnSpecialEvents();
	void SpawnObjectiveEncounter();
	void SpawnObjectiveCriticalItems();
	void SpawnItems_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo);
	void SpawnItems();
	void SpawnEncounters();
	void SpawnDebrisItems_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo, enum class EDebrisItemPass pass, int32_t Depth);
	void SpawnDebrisItems(enum class EDebrisItemPass pass);
	void SetSeed(int32_t Seed);
	void SetObjectivesCompleted();
	void ResetData();
	void RemoveBLockedEntrances();
	void OnPLSDataRecieved();
	void OnObjectivesCompleted();
	void OnCarverDataRecieved(enum class EDebrisItemPass pass);
	bool IsGeneratedDataReady();
	bool IsCarverDataReady(enum class EDebrisItemPass pass);
	void InitializeObjectives();
	UMissionDNA* GetMissionDNA();
	ADeepCSGWorld* GetCSGWorld();
	void GenerateRoomsFromGraph_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo, int32_t CarvePass);
	void GenerateRoomsFromGraph(int32_t CarvePass);
	void GenerateRoomGenerator();
	void GenerateResourceVeins_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo);
	void GenerateResourceVeins();
	void GeneratePostCarveRooms_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo);
	void GeneratePostCarveRooms();
	void GenerateLandscapeFromData(int32_t Seed, TArray<FRoomNode> Rooms, TArray<FPathObstacle> obstacles);
	void GenerateLandscape();
	void GenerateDebrisVeins_Async(AProceduralSetup* setup, enum class EDebrisCarvedType carverType, FLatentActionInfo LatentInfo);
	void GenerateDebrisVeins(enum class EDebrisCarvedType carverType);
	FVector FindLocationInDirection(FVector Origin, FVector Direction, float horizontalDeviation, float verticalDeviation, FRandRange Distance, float additionalDistance);
	void FindEntrancesForAllConnections();
	void FillTunnels_Async(AProceduralSetup* setup, FLatentActionInfo LatentInfo);
	void FillTunnels();
	void EndRoom(int32_t ID);
	void DoneCarving();
	bool DoAsyncThreadGeneration();
	void CreateTunnelPaths();
	int32_t CreateItemDepths();
	void CreateGeneratedInfluenceSet();
	void CreateAdditionalRooms();
	int32_t ConnectRooms(FRoomNode From, FRoomNode to, bool hasDirt, UTunnelParameters* tunnelParameterOverride);
	int32_t ConnectRoomIds(int32_t fromID, int32_t toID, bool hasDirt, UTunnelParameters* tunnelParameterOverride);
	void CommitCarving(bool finalCommit, bool generateMesh);
	void CarveWithGeneratedInstantCarvers();
	void CarveTunnels();
	int32_t BeginRoom(FVector Location, float Rotation, bool CanHaveEnemies, URoomGenerator* baseGenerator, FVector outCenter, FRoomNode outRoom, float resourceMultiplayer);
	void BeginLiveGeneration();
	void BeginGenerating();
	void AddToRoom(int32_t ID, FVector Location, float Rotation, URoomGenerator* additionalRoomGenerator);
	void AddRoomToInitialState(FRoomNode RoomNode);
	int32_t AddRoom(FVector Location, bool CanHaveEnemies, URoomGeneratorBase* RoomGenerator, bool canBeRotated, FVector outCenter, FRoomNode outRoom, float ResourceMultiplier);
	void AddInfluenceToTunnelEntrances(UCaveInfluencer* Influencer, float Range);
	void AddImportantLocation(FVector Location, float Radius);
	void AddEnemyDebris();
	void AddDebrisVariantsToRooms();
	int32_t AddDebrisCollider(FDebrisCapsule Capsule);
	void AddCaveInfluence(UCaveInfluencer* Influencer, FVector Location, float Range);
	int32_t AddAirParticlesCollider(FDebrisCapsule Capsule);
};

// Class FSD.CaveBurner
// Size: 0x560 (Inherited: 0x528)
struct ACaveBurner : AProceduralSetup {
	float RoomRadius; // 0x528(0x04)
	FGameplayTagContainer RoomTags; // 0x530(0x20)
	bool CanOnlyBeUsedOnce; // 0x550(0x01)
	URoomGenerator* RoomGenerator; // 0x558(0x08)
};

// Class FSD.RoomBurner
// Size: 0x2e0 (Inherited: 0x220)
struct ARoomBurner : AActor {
	bool LiveUpdateEditor; // 0x220(0x01)
	enum class ERoomMirror MirrorTest; // 0x221(0x01)
	URoomGenerator* RoomGenerator; // 0x228(0x08)
	float RoomRadius; // 0x230(0x04)
	enum class ERoomMirroringSupport MirrorSupport; // 0x234(0x01)
	bool ShowRoomCollider; // 0x235(0x01)
	FGameplayTagContainer RoomTags; // 0x238(0x20)
	int32_t Seed; // 0x258(0x04)
	UBiome* Biome; // 0x260(0x08)
	UDifficultySetting* Difficulty; // 0x268(0x08)
	int32_t ForcePlayerCount; // 0x270(0x04)
	bool GenerateDebris; // 0x274(0x01)
	bool GenerateItems; // 0x275(0x01)
	bool GenerateResources; // 0x276(0x01)
	bool SpawnEncounters; // 0x277(0x01)
	UEnemyDescriptor* TestEnemy; // 0x278(0x08)
	int32_t TestEnemyCount; // 0x280(0x04)
	UMissionMutator* TestMutator; // 0x288(0x08)
	TArray<UMissionWarning*> TestWarnings; // 0x290(0x10)
	USpecialEvent* TestSpecialEvent; // 0x2a0(0x08)
	USpecialEvent* TestTreasure; // 0x2a8(0x08)
	UMissionTemplate* MissionTemplate; // 0x2b0(0x08)
	UMissionTemplate* CustomMissionTemplate; // 0x2b8(0x08)
	ADeepCSGWorld* CSGWorld; // 0x2c0(0x08)
	AProceduralSetup* PLSLiveEditor; // 0x2c8(0x08)
	URoomGenerator* LiveEditRoomGenerator; // 0x2d8(0x08)

	void SpawnEncounter(AProceduralSetup* setup);
};

// Class FSD.RoomPieceBurner
// Size: 0x2f8 (Inherited: 0x2e0)
struct ARoomPieceBurner : ARoomBurner {
	URoomPiece* RoomPiece; // 0x2e0(0x08)
	TArray<enum class ERoomPieceSide> ConnectedSides; // 0x2e8(0x10)
};

// Class FSD.InfluenceTester
// Size: 0x230 (Inherited: 0x220)
struct AInfluenceTester : AActor {
	UCaveInfluencer* Influencer; // 0x220(0x08)
	USphereComponent* Sphere; // 0x228(0x08)
};

// Class FSD.EnemyPawn
// Size: 0x338 (Inherited: 0x2e8)
struct AEnemyPawn : AFSDPawn {
	UEnemyHealthComponent* Health; // 0x2f0(0x08)
	UPawnStatsComponent* Stats; // 0x2f8(0x08)
	UEnemyPawnAfflictionComponent* affliction; // 0x300(0x08)
	UEnemyComponent* enemy; // 0x308(0x08)
	FName CenterMassSocketName; // 0x310(0x08)
	FQueuedMontage QueuedMontage; // 0x318(0x10)
	TArray<UMaterialInterface*> CachedMaterials; // 0x328(0x10)

	UMeshComponent* Receive_GetMeshComponent();
	void OnRep_QueuedMontage();
	USkeletalMeshComponent* GetMesh();
};

// Class FSD.CaveLeech
// Size: 0x3f0 (Inherited: 0x338)
struct ACaveLeech : AEnemyPawn {
	USkeletalMeshComponent* SkeletalMesh; // 0x340(0x08)
	UGrabberComponent* GrabberComponent; // 0x348(0x08)
	float BiteDamage; // 0x350(0x04)
	float BitesPerSecond; // 0x354(0x04)
	float MaxDistanceXY; // 0x358(0x04)
	float GrapDistance; // 0x35c(0x04)
	float GrapDelay; // 0x360(0x04)
	float TentacleSpeed; // 0x364(0x04)
	float TentacleRetractSpeed; // 0x368(0x04)
	float RetractDuration; // 0x36c(0x04)
	float TentaclePullSpeed; // 0x370(0x04)
	float TentacleDropPlayerSpeed; // 0x374(0x04)
	float TentacleDropGroundDistance; // 0x378(0x04)
	float MaxDropPlayerDuration; // 0x37c(0x04)
	float HeadInterpSpeed; // 0x380(0x04)
	float TentacleAttachOffset; // 0x384(0x04)
	float BiteDistance; // 0x388(0x04)
	float RevivedGracePeriod; // 0x38c(0x04)
	UPawnAffliction* CaveLeechSenseAffliction; // 0x390(0x08)
	float StateTime; // 0x3a0(0x04)
	enum class ECaveLeechState State; // 0x3a4(0x01)
	FVector_NetQuantize TentacleLocation; // 0x3a8(0x0c)
	FVector_NetQuantize TentacleVelocity; // 0x3b4(0x0c)
	TWeakObjectPtr<AActor> Target; // 0x3c0(0x08)
	UHealthComponent* HealthTarget; // 0x3c8(0x08)
	USceneComponent* TentacleHead; // 0x3d0(0x08)

	void OnRep_State();
	FVector GetTentacleTargetLocation();
	FVector GetMouthLocation();
	AActor* GetCurrentTarget();
	void Died(UHealthComponentBase* HealthComponent);
	void Damaged(float amount);
	void BP_OnTentacleLocationChanged(FVector Location);
	void BP_OnStateChanged(enum class ECaveLeechState NewState);
	void BP_OnBite(UHealthComponent* TargetHealth);
};

// Class FSD.CaveLeechAnimInstance
// Size: 0x2b0 (Inherited: 0x270)
struct UCaveLeechAnimInstance : UAnimInstance {
	float HeadOffset; // 0x268(0x04)
	ACaveLeech* CaveLeech; // 0x270(0x08)
	USceneComponent* CaveLeechHead; // 0x278(0x08)
	FRotator BaseRotation; // 0x280(0x0c)
	FVector HeadLocation; // 0x28c(0x0c)
	FRotator HeadRotation; // 0x298(0x0c)
	bool bIdle; // 0x2a4(0x01)
	bool bTracking; // 0x2a5(0x01)
	bool bPulling; // 0x2a6(0x01)
	bool bRetracting; // 0x2a7(0x01)
	bool bDying; // 0x2a8(0x01)
	bool bDead; // 0x2a9(0x01)
	bool bFrozen; // 0x2aa(0x01)
	bool bBiting; // 0x2ab(0x01)
};

// Class FSD.CaveObject
// Size: 0x228 (Inherited: 0x220)
struct ACaveObject : AActor {
	bool CanCharacterStandOn; // 0x220(0x01)

	void TriggerNetworkUpdate();
	void ResumeNetworkUpdates();
	void Recieve_OnGameStarted();
	void PauseNetworkUpdates();
};

// Class FSD.CaveScriptComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UCaveScriptComponent : UActorComponent {
};

// Class FSD.CaveVine
// Size: 0x288 (Inherited: 0x220)
struct ACaveVine : AActor {
	enum class ECollisionChannel GroundCollisionChannel; // 0x220(0x01)
	float IdleSwingSpeed; // 0x224(0x04)
	float ChaseSpeed; // 0x228(0x04)
	float MaxReach; // 0x22c(0x04)
	float GroundOffset; // 0x230(0x04)
	float NoiseRadius; // 0x234(0x04)
	float NoiseSpeed; // 0x238(0x04)
	USplineMeshComponent* SplineMeshComponent; // 0x240(0x08)
	USceneComponent* VineHead; // 0x248(0x08)
	FVector VineVelocity; // 0x250(0x0c)
	FVector VineLocation; // 0x25c(0x0c)
	FVector VineStartLocation; // 0x268(0x0c)
	TWeakObjectPtr<UHealthComponent> Target; // 0x274(0x08)

	void BP_OnTargetChanged(UHealthComponent* NewTarget);
	void BP_OnInitialized();
};

// Class FSD.CaveWorm
// Size: 0x398 (Inherited: 0x378)
struct ACaveWorm : ADeepPathfinderCharacter {
	USimpleHealthComponent* Health; // 0x388(0x08)
	float SearchChunksRadius; // 0x390(0x04)
	float SearchChunksInterval; // 0x394(0x04)

	AResourceChunk* SpawnResource(UObject* WorldContext, UResourceData* Data, float Size, FTransform Transform, FVector Impulse, FVector DropOffset);
	void Search();
	void IncrementKillCount(UHealthComponentBase* HealthComponent);
	void DropResource(UResourceData* Data, float Size, FVector Impulse, FVector DropOffset);
};

// Class FSD.Maggot
// Size: 0x380 (Inherited: 0x378)
struct AMaggot : ADeepPathfinderCharacter {
	USimpleHealthComponent* HealthComponent; // 0x378(0x08)
};

// Class FSD.CellIdFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCellIdFunctionLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.Test
// Size: 0x270 (Inherited: 0x270)
struct UTest : UAnimInstance {
};

// Class FSD.CharacterCameraController
// Size: 0xd0 (Inherited: 0xb0)
struct UCharacterCameraController : UActorComponent {
	float StartFOV; // 0xb0(0x04)
	float targetFov; // 0xb4(0x04)
	float TargetFOVSpeed; // 0xb8(0x04)
	APlayerCharacter* Character; // 0xc0(0x08)
	UCameraComponent* Camera; // 0xc8(0x08)

	void ResetFOV(float FadeSpeed);
	void FOVChanged(float NewFOV);
	void FadeToFOVRelative(float targetFov, float FadeSpeed);
	void FadeToFOV(float targetFov, float FadeSpeed);
};

// Class FSD.CharacterIntoxicationComponent
// Size: 0x100 (Inherited: 0xb0)
struct UCharacterIntoxicationComponent : UActorComponent {
	FMulticastInlineDelegate OnIntoxicationChanged; // 0xb0(0x10)
	FMulticastInlineDelegate OnPassOutDrunk; // 0xc0(0x10)
	APlayerCharacter* Character; // 0xd0(0x08)
	enum class EIntoxicationState CurrentState; // 0xd8(0x01)
	FLerpingPercent IntoxicationPercent; // 0xdc(0x08)
	float IntoxicationLerpSpeed; // 0xe4(0x04)
	float TimeDrunk; // 0xe8(0x04)
	FCountDownFloat SoberingUpCoolDown; // 0xec(0x0c)
	char SoberingPercent; // 0xf8(0x01)

	void ReceiveStateChange(enum class EIntoxicationState NewState);
	void ReceivePassOutDrunk();
	void ReceiveDrunkTick(float DeltaTime, float DrunkTime);
	void ReceiveDrunkEnd();
	void ReceiveDrunkBegin();
	void PassOutDrunkSignature__DelegateSignature(APlayerCharacter* Player);
	bool IsPassOutDrunk();
	bool IsOnSpaceRig();
	bool IsLocallyControlled();
	bool IsDrunk();
	void IntoxicationProgressSignature__DelegateSignature(APlayerCharacter* Player, float Progress);
	bool HasAuthority();
	float GetSoberingUpCoolDown();
	float GetIntoxicationProgressMapped(UCurveFloat* Curve);
	float GetIntoxicationProgress();
	int32_t GetAlcoholPct(enum class EDrinkableAlcoholStrength Strength);
	void Consume(UDrinkableDataAsset* Drinkable);
	void ClearIntoxication();
};

// Class FSD.CharacterRecoilComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UCharacterRecoilComponent : UActorComponent {
	FVector Recoil; // 0xb0(0x0c)
	FVector RecoilVelocity; // 0xbc(0x0c)
	FVector PrevError; // 0xc8(0x0c)
};

// Class FSD.CharacterSettings
// Size: 0x180 (Inherited: 0x30)
struct UCharacterSettings : UDataAsset {
	TArray<TSoftClassPtr<UObject>> RankedHeroClasses; // 0x30(0x10)
	TArray<APlayerCharacter*> LoadedClasses; // 0x40(0x10)
	TArray<FText> PlayerRankNames; // 0x50(0x10)
	TArray<int32_t> CharacterXPLevels; // 0x60(0x10)
	TMap<FGuid, UPlayerCharacterID*> PlayerCharacterIDMap; // 0x70(0x50)
	TArray<UPlayerCharacterID*> PlayerCharacterIDs; // 0xc0(0x10)
	UPlayerCharacterID* BoscoID; // 0xd0(0x08)
	USkeletalMesh* NoHead; // 0xd8(0x08)
	USkeletalMesh* DefaultHead; // 0xe0(0x08)
	USkeletalMesh* ThickNeck; // 0xe8(0x08)
	USkeletalMesh* ThinNeck; // 0xf0(0x08)
	TSoftClassPtr<UObject> CarriableBagClass; // 0xf8(0x28)
	UUseAnimationSetting* ThrowItemAnimSettings; // 0x120(0x08)
	TMap<UPlayerCharacterID*, UCharacterVanityItems*> CharacterVanityItems; // 0x128(0x50)
	UDialogDataAsset* AutoReloadShout; // 0x178(0x08)

	void PreloadAllInventories(UAsyncManager* AsyncManager);
	UPlayerCharacterID* GetPlayerCharacterID(FGuid ID);
};

// Class FSD.CharacterSightComponent
// Size: 0x158 (Inherited: 0xb0)
struct UCharacterSightComponent : UActorComponent {
	FMulticastInlineDelegate OnTargetChanged; // 0xb0(0x10)
	float TargetMaxDistance; // 0xc0(0x04)
	enum class ECollisionChannel TraceChannel; // 0xc4(0x01)
	TArray<TWeakObjectPtr<AActor>> IgnoredActors; // 0xc8(0x10)
	APlayerCharacter* Character; // 0xd8(0x08)
	TWeakObjectPtr<AActor> TargetActor; // 0xe0(0x08)
	TWeakObjectPtr<UPrimitiveComponent> TargetPrimitive; // 0xe8(0x08)
	TWeakObjectPtr<USimpleObjectInfoComponent> TargetInfo; // 0xf0(0x08)
	TWeakObjectPtr<UTemperatureComponent> TargetTemperature; // 0xf8(0x08)
	TWeakObjectPtr<UPawnAfflictionComponent> TargetAfflictions; // 0x100(0x08)
	TScriptInterface<IHealth> TargetHealth; // 0x108(0x10)
	TScriptInterface<ITargetable> TargetTargetable; // 0x118(0x10)
	float TargetTime; // 0x128(0x04)
	FReplicatedCharacterData ReplicatedData; // 0x12c(0x18)

	void TargetChangedSignature__DelegateSignature(AActor* NewTarget, UPrimitiveComponent* NewPrimitive);
	void Server_UpdateTarget(AActor* NewActor, UPrimitiveComponent* NewPrimitive);
	void RemoveIgnoreActor(AActor* InActor);
	void ReceiveTargetInSightTick(float DeltaTime);
	void ReceiveTargetChanged();
	void GetSightStartAndEnd(float InMaxDistance, FVector OutStartLocation, FVector OutEndLocation);
	void AddIgnoreActor(AActor* InActor);
};

// Class FSD.CharacterStateComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UCharacterStateComponent : UActorComponent {
	char StateId; // 0xb0(0x01)
	APlayerCharacter* Character; // 0xb8(0x08)
	UDialogDataAsset* EnterStateShout; // 0xc0(0x08)
	UDialogDataAsset* ExitStateShout; // 0xc8(0x08)
	UDialogDataAsset* AttentionShout; // 0xd0(0x08)
	UPlayerMovementComponent* PlayerMovement; // 0xd8(0x08)

	void ReceiveStateTick(float DeltaTime);
	void ReceiveStateExit();
	void ReceiveStateEnter();
	bool IsLocallyControlled();
	bool HasAuthority();
	float GetStateTime();
	char GetStateID();
	bool GetStateActive();
	UPlayerMovementComponent* GetCharacterMovement();
};

// Class FSD.CharacterUseComponent
// Size: 0x1f8 (Inherited: 0xb0)
struct UCharacterUseComponent : UActorComponent {
	FMulticastInlineDelegate OnDepositingBegin; // 0xb0(0x10)
	FMulticastInlineDelegate OnDepositingEnd; // 0xc0(0x10)
	FMulticastInlineDelegate OnBeginHoveringEvent; // 0xd0(0x10)
	FMulticastInlineDelegate OnEndHoveringEvent; // 0xe0(0x10)
	FMulticastInlineDelegate OnBeginUsingEvent; // 0xf0(0x10)
	FMulticastInlineDelegate OnEndUsingEvent; // 0x100(0x10)
	FMulticastInlineDelegate OnBeginUseNoUsable; // 0x110(0x10)
	FMulticastInlineDelegate OnEndUseNoUsable; // 0x120(0x10)
	UUsableComponentBase* ActiveUsablee; // 0x130(0x08)
	UUsableComponentBase* HoveringUsable; // 0x138(0x08)
	USceneComponent* HoveringUsableCollider; // 0x140(0x08)
	USceneComponent* ActiveUsableCollider; // 0x148(0x08)
	USphereComponent* UseCollider; // 0x150(0x08)
	USoundBase* AudioBeginDepositing; // 0x158(0x08)
	USoundBase* AudioEndDepositing; // 0x160(0x08)
	float UseDistance; // 0x168(0x04)
	enum class EUseRestriction UseRestriction; // 0x16d(0x01)
	APlayerCharacter* Character; // 0x170(0x08)
	TMap<UUsableComponentBase*, float> UseCooldownTracker; // 0x1a8(0x50)

	void Server_SetCanUse(enum class EUseRestriction UseRestriction);
	void Server_EndUse();
	void Server_BeginUse(UUsableComponentBase* Usable, USceneComponent* UsableCollider);
	void OnRep_ActiveUsablee(UUsableComponentBase* lastUsable);
	void OnCharacterStateChanged(enum class ECharacterState NewState);
	bool IsLookingAtUsable();
	bool IsLookingAtDepositable();
	float GetUseProgress();
	AActor* GetLookingAtActor();
	bool GetIsUsing();
	bool GetIsDepositing();
	void All_PlaySingleUse(UUsableComponentBase* Usable);
	void AddCustomUsableComponent(UUsableComponentBase* Usable, enum class ECustomUsableType eType);
};

// Class FSD.CharacterVanityComponent
// Size: 0x1d0 (Inherited: 0xb0)
struct UCharacterVanityComponent : UActorComponent {
	UCharacterVanityItems* AvailableVanityItems; // 0xb8(0x08)
	UBeardColorVanityItem* ShownBeardColor; // 0xc0(0x08)
	UMaterialInterface* ArmorMaterial; // 0xc8(0x08)
	UMaterialInstanceDynamic* DynamicSkinMaterial; // 0xd0(0x08)
	enum class EHeadVanityType HeadVanityType; // 0xd8(0x01)
	TArray<UVanityItem*> EquippedVanity; // 0xe0(0x10)
	UMaterialInterface* SkinMaterial; // 0xf0(0x08)
	TArray<FTattooArmorItem> Tattoos; // 0xf8(0x10)
	TArray<UMaterialInterface*> CachedMaterials; // 0x108(0x10)
	TMap<enum class EVanitySlot, USkeletalMeshComponent*> VanityMeshes; // 0x170(0x50)

	void UpdateMeshes();
	void UpdateEquippedVanity(bool applyItems);
	void SetEquippedVanityInViewer(TArray<UVanityItem*> Vanity);
	void Server_SetEquippedVanity(TArray<UVanityItem*> equippedItems);
	UVanityItem* Receive_GetEquippedVanityItem(UObject* WorldContextObject, UPlayerCharacterID* Character, enum class EVanitySlot Slot);
	void OnRep_EquippedVanity();
	UVanityItem* GetEquippedVanityItem(enum class EVanitySlot Slot);
	UCharacterVanityItems* GetAvailableVanityItems();
	void EnforceValidPaintjob();
	void CreateEquippedGear();
};

// Class FSD.CharacterVanityItems
// Size: 0x1a8 (Inherited: 0x30)
struct UCharacterVanityItems : UDataAsset {
	TArray<UHeadVanityItem*> HeadItems; // 0x30(0x10)
	UVanitySchematicBank* HeadSchematicBank; // 0x40(0x08)
	TArray<UBeardVanityItem*> BeardItems; // 0x48(0x10)
	UVanitySchematicBank* BeardSchematicBank; // 0x58(0x08)
	TArray<UArmorVanityItem*> ArmorItems; // 0x60(0x10)
	TArray<UArmorMaterialVanityItem*> ArmorMaterialItems; // 0x70(0x10)
	TArray<UArmorMaterialVanityItem*> ArmorMaterialItemsInTreassures; // 0x80(0x10)
	TArray<UEyeBrowsVanityItem*> EyebrowsItems; // 0x90(0x10)
	UVanitySchematicBank* EyebrowSchematicBank; // 0xa0(0x08)
	TArray<UMoustacheVanityItem*> MoustacheItems; // 0xa8(0x10)
	UVanitySchematicBank* MoustacheSchematicBank; // 0xb8(0x08)
	TArray<USideburnsVanityItem*> SideburnItems; // 0xc0(0x10)
	UVanitySchematicBank* SideburnSchematicBank; // 0xd0(0x08)
	TArray<UBeardColorVanityItem*> BeardMaterialItems; // 0xd8(0x10)
	UVanitySchematicBank* BeardMaterialSchematicBank; // 0xe8(0x08)
	TArray<USkinColorVanityItem*> SkinMaterialItems; // 0xf0(0x10)
	UVanitySchematicBank* SkinMaterialSchematicBank; // 0x100(0x08)
	TMap<FGuid, UVanityItem*> VanityMap; // 0x108(0x50)
	TMap<enum class EVanitySlot, UVanityItem*> DefaultItems; // 0x158(0x50)

	void SortVanityItems(UObject* WorldContextObject, UPlayerCharacterID* characterID, TArray<UVanityItem*> vanityItems);
	TArray<UVanityItem*> GetVanityItems(UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, UPlayerCharacterID* characterID);
	UVanityItem* GetVanityItem(FGuid VanityID);
	TArray<UVanityItem*> GetUnLockedVanityItems(UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, UPlayerCharacterID* characterID);
	TArray<UVanityItem*> GetLockedVanityItems(UObject* WorldContextObject, enum class EVanitySlot Slot, UPlayerCharacterID* characterID);
	TArray<UVanityItem*> GetItems(enum class EVanitySlot Slot, bool onlyStoreItems);
	UVanityItem* GetDefaultVanityItem(UObject* WorldContext, enum class EVanitySlot Slot, UPlayerCharacterID* characterID);
	void Clean();
};

// Class FSD.CharacterSelectionSwitcher
// Size: 0x220 (Inherited: 0x220)
struct ACharacterSelectionSwitcher : AActor {

	void OnVictoryPoseChanged(UVictoryPose* VictoryPose);
	void OnVanityItemEquipped(enum class EVanitySlot Slot);
	void Hide();
	AActor* GetViewerActor();
	APlayerCharacter* GetActiveCharacter();
};

// Class FSD.ChargedWeapon
// Size: 0x728 (Inherited: 0x690)
struct AChargedWeapon : AAmmoDrivenWeapon {
	FMulticastInlineDelegate OnChargeChanged; // 0x690(0x10)
	FMulticastInlineDelegate OnHeatChanged; // 0x6a0(0x10)
	UAnimMontage* FP_OverheatAnim; // 0x6b8(0x08)
	UAnimMontage* FP_ChargeupMontage; // 0x6c0(0x08)
	UParticleSystem* ChargeupParticles; // 0x6c8(0x08)
	UParticleSystemComponent* ChargeupParticleInstance; // 0x6d0(0x08)
	UFXSystemAsset* ChargeupFireMuzzleFlash; // 0x6d8(0x08)
	USoundCue* NormalFiresound; // 0x6e0(0x08)
	USoundCue* FullyChargedFireSound; // 0x6e8(0x08)
	float ChargeSpeed; // 0x6f0(0x04)
	bool Charging; // 0x6f4(0x01)
	float ChargeProgress; // 0x6f8(0x04)
	int32_t ShotCostAtBelowFullCharge; // 0x6fc(0x04)
	int32_t ShotCostAtFullCharge; // 0x700(0x04)
	bool ChargedShotsOnly; // 0x704(0x01)
	bool AutoFireWhenOverheated; // 0x705(0x01)
	float TotalHeat; // 0x708(0x04)
	float CoolingRate; // 0x710(0x04)
	float HeatPerSecondWhileCharging; // 0x714(0x04)
	float HeatPerSecondWhenCharged; // 0x718(0x04)
	float HeatPerNormalShot; // 0x71c(0x04)
	float HeatPerChargedShot; // 0x720(0x04)

	void SetOverheated(bool isOverheated);
	void Server_SetIsCharging(bool isChargingValue);
	void RecieveChargeProgressChanged(float NewChargeProgress);
	void ReceiveOverheatedChanged(bool isOverheated);
	bool GetIsCharging();
};

// Class FSD.ChargedWeaponAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UChargedWeaponAnimInstance : UAnimInstance {
	bool IsCharging; // 0x268(0x01)
	float ChargeupPlayRate; // 0x26c(0x04)
	float ChargeupPlayRateSpeedChange; // 0x270(0x04)
	float ChargedownPlayRateSpeedChange; // 0x274(0x04)
	float MaxChargeupPlayRate; // 0x278(0x04)
	AChargedWeapon* Weapon; // 0x280(0x08)
};

// Class FSD.ProjectileBase
// Size: 0x2a8 (Inherited: 0x220)
struct AProjectileBase : AActor {
	FProjectileImpact ProjectileImpact; // 0x220(0x30)
	bool Exploded; // 0x250(0x01)
	bool DoOnImpact; // 0x251(0x01)
	bool DoOnImpact2; // 0x252(0x01)
	bool DoOnImpact3; // 0x253(0x01)
	bool DoOnSpawnVar; // 0x254(0x01)
	bool IsDorment; // 0x268(0x01)
	USphereComponent* CollisionComponent; // 0x270(0x08)
	float LifeSpan; // 0x27c(0x04)
	float VelocityMultiplier; // 0x280(0x04)
	float GravityMultiplier; // 0x284(0x04)
	bool AffectedByDifficultySpeedModifier; // 0x288(0x01)
	enum class EOnProjectileImpactBehaviourEnum EOnImpactBehaviour; // 0x290(0x04)

	UTerrainMaterial* TryGetTerrainMaterial();
	void StopMovement();
	void OnRep_ProjectileImpact();
	void OnRep_IsDorment(bool wasDorment);
	void OnInitialized();
	void OnImpacted(bool PredictedImpact, FHitResult HitResult);
	void MakeBouncy();
	void InitState(FVector ShootDirection, FVector initialBonusVelocity);
	void InitComponents();
	void IgnoreCollision(UPrimitiveComponent* otherCollider);
	float GetGameTimeSinceActivation();
	int32_t GetBoneIndex();
	void DoOnSpawn();
	void DisableProjectileCollision(AProjectileBase* projectileA, AProjectileBase* projectileB);
	void DisableAndDestroy();
};

// Class FSD.Projectile
// Size: 0x2f0 (Inherited: 0x2a8)
struct AProjectile : AProjectileBase {
	FProjectileState State; // 0x2a8(0x28)
	bool UseArmorDamageBoneCheck; // 0x2d1(0x01)
	TArray<AActor*> IgnoreActorClasses; // 0x2d8(0x10)
	UProjectileMovementComponent* MovementComponent; // 0x2e8(0x08)

	AProjectileBase* SpawnProjectile(UObject* WorldContextObject, AProjectileBase* projectileClass, APawn* projectileOwner, FVector Origin, FRotator velocityDirection);
	AProjectileBase* SpawnBallisticProjectile(UObject* WorldContextObject, AProjectile* projectileClass, APawn* projectileOwner, FVector Origin, FVector Velocity);
	void SetHomingTargetComponent(USceneComponent* HomingTargetComponent, float Delay);
	void OnRep_State(FProjectileState oldState);
	void OnImpact(FHitResult HitResult);
	void OnBounce(FHitResult ImpactResult, FVector ImpactVelocity);
	UFSDPhysicalMaterial* FindBoneIndexFromArmor(FHitResult HitResult, int32_t outBoneIndex);
	void ClearMovementComponent();
};

// Class FSD.ChargedProjectile
// Size: 0x2f8 (Inherited: 0x2f0)
struct AChargedProjectile : AProjectile {
	bool ExplodesWhenDead; // 0x2f0(0x01)
	bool PersistentExplosion; // 0x2f1(0x01)
	bool AoEDamageInFlight; // 0x2f2(0x01)
	float DirectDamageReduction; // 0x2f4(0x04)

	void OnAoEDamageEnabled();
};

// Class FSD.ChromaComponent
// Size: 0x180 (Inherited: 0xb0)
struct UChromaComponent : UActorComponent {
	FLinearColor HealthBarColor; // 0xb0(0x10)
	FLinearColor DamageEffectColor; // 0xc0(0x10)
	FLinearColor DownedEffectColor; // 0xd0(0x10)
	FLinearColor ShieldBarColor; // 0xe0(0x10)
	FLinearColor ShieldEffectColor; // 0xf0(0x10)
	FLinearColor WeaponColor; // 0x100(0x10)
	FLinearColor WeaponEquipedColor; // 0x110(0x10)
	FLinearColor GrenadeColor; // 0x120(0x10)
	FLinearColor WASDColor; // 0x130(0x10)
	FLinearColor RessuplyColor; // 0x140(0x10)
	FLinearColor ReloadColor; // 0x150(0x10)
	enum class EFSDChromaEffect ActiveEffect; // 0x160(0x01)
	float EffectDuration; // 0x164(0x04)
	uint32_t EffectSeed; // 0x168(0x04)

	void TriggerEffect(enum class EFSDChromaEffect effect);
};

// Class FSD.ClaimableRewardEntryWidget
// Size: 0x298 (Inherited: 0x230)
struct UClaimableRewardEntryWidget : UUserWidget {
	FMulticastInlineDelegate OnRewardClaimed; // 0x230(0x10)
	FClaimableRewardEntry Data; // 0x240(0x58)

	void WidgetDelegate__DelegateSignature(UClaimableRewardEntryWidget* EntryWidget);
	void SignalRewardClaimed();
	void SetData(FClaimableRewardEntry InData);
	void ReceiveDataChanged();
};

// Class FSD.ClaimableRewardViewWidget
// Size: 0x2a0 (Inherited: 0x230)
struct UClaimableRewardViewWidget : UUserWidget {
	FClaimableRewardView Data; // 0x230(0x70)

	void ReceiveEndFlow();
	void ReceiveDataChanged();
	void ReceiveBeginFlow();
	void EndRewardFlow();
	void BeginRewardFlow(FClaimableRewardView InViewData);
};

// Class FSD.ExampleActor
// Size: 0x240 (Inherited: 0x220)
struct AExampleActor : AActor {
	FMulticastInlineDelegate OnExampleUpdatedEvent; // 0x220(0x10)
	float Field; // 0x230(0x04)

	void Server_ExampleFunction();
	void Client_ExampleFunction();
	void All_ExampleFunction();
};

// Class FSD.CollectableResourceData
// Size: 0x138 (Inherited: 0xf0)
struct UCollectableResourceData : UResourceData {
	UDebrisPositioning* Positioning; // 0xf0(0x08)
	float Rarity; // 0xf8(0x04)
	float InfluenceRadius; // 0xfc(0x04)
	TArray<UDebrisBase*> Debris; // 0x100(0x10)
	bool UseTerrainPlacement; // 0x110(0x01)
	TArray<TSoftClassPtr<UObject>> CollectableClasses; // 0x118(0x10)
	TArray<AActor*> CollectableClassesLoaded; // 0x128(0x10)
};

// Class FSD.CharacterShoutsData
// Size: 0xe0 (Inherited: 0x30)
struct UCharacterShoutsData : UDataAsset {
	FCharacterShouts Shouts; // 0x30(0xb0)
};

// Class FSD.ShoutWidget
// Size: 0x258 (Inherited: 0x230)
struct UShoutWidget : UUserWidget {
	TWeakObjectPtr<APlayerCharacter> Sender; // 0x230(0x08)
	FText Text; // 0x238(0x18)
	float Duration; // 0x250(0x04)
	bool IsSubtitle; // 0x254(0x01)

	void OnShout();
	FString GetTimeString(int32_t Seconds);
	void GetSplitTimeString(int32_t Seconds, FString MinutesString, FString SecondsString);
	FString GetCountDownString(int32_t Seconds);
};

// Class FSD.CommunicationComponent
// Size: 0x288 (Inherited: 0xb0)
struct UCommunicationComponent : UActorComponent {
	FMulticastInlineDelegate OnMissionShout; // 0xb0(0x10)
	FMulticastInlineDelegate OnMissionShoutEnd; // 0xc0(0x10)
	FMulticastInlineDelegate OnMixerAnnouncement; // 0xd0(0x10)
	FMulticastInlineDelegate OnPlayerShouted; // 0xe0(0x10)
	FMulticastInlineDelegate OnMissionControlFinished; // 0xf0(0x10)
	bool ShoutingEnabled; // 0x100(0x01)
	UShoutWidget* ShoutWidgetType; // 0x108(0x08)
	UCharacterShoutsData* CharacterShouts; // 0x110(0x08)
	float PitchMultiplier; // 0x118(0x04)
	float MinShoutDelay; // 0x11c(0x04)
	float CloseRangeShoutDistance; // 0x120(0x04)
	TMap<UDialogDataAsset*, float> DelayedShouts; // 0x128(0x50)
	FGameplayTagContainer KillShoutAllowedTags; // 0x178(0x20)
	bool bMissionControlPaused; // 0x198(0x01)
	UAudioComponent* MissionControlAudioComponent; // 0x1a0(0x08)
	TMap<APlayerCharacter*, UShoutWidget*> ActiveShouts; // 0x1a8(0x50)
	TArray<FActiveOutline> ActiveOutlines; // 0x1f8(0x10)
	APlayerCharacter* Character; // 0x208(0x08)
	UDialogDataAsset* LastShout; // 0x210(0x08)
	UAudioComponent* ShoutAudioComponent; // 0x218(0x08)
	TMap<UDialogDataAsset*, float> ShoutHistory; // 0x220(0x50)
	TArray<FMissionShoutQueueItem> MissionShoutQueue; // 0x278(0x10)

	void ShoutCustomOrDefault(UDialogDataAsset* CustomShout, enum class EShoutType DefaultShout);
	void ShoutCustomLocalOnly(UDialogDataAsset* Shout);
	void ShoutCustomClosestDwarf(UObject* WorldContext, UDialogDataAsset* Shout, FVector TargetLocation);
	void ShoutCustom(UDialogDataAsset* Shout);
	void Shout(enum class EShoutType Shout);
	void SetMissionControlPaused(bool IsPaused);
	void ServerShout(UDialogDataAsset* Shout);
	void ServerMixerAnnouncement(FMixerAnnouncement Announcement);
	void ServerMissionShout(UDialogDataAsset* Shout, bool bPriority);
	UAudioComponent* PlayPitchedByClass(UObject* WorldContextObject, APlayerCharacter* CharacterClass, USoundBase* Sound, UDialogDataAsset* Shout, enum class EShoutType ShoutType, UAudioComponent* AudioComponent);
	void PlayPitchedAsync(UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, UAudioComponent* AudioComponent, UObject* WorldContextObject, float shoutVolumeMultiplier);
	UAudioComponent* PlayPitched(USoundBase* Sound, UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, UAudioComponent* AudioComponent, UObject* WorldContextObject);
	void MixerAnnouncementLocalOnly(UObject* WorldContext, FMixerAnnouncement Announcement);
	void MixerAnnouncement(UObject* WorldContext, FMixerAnnouncement Announcement);
	int32_t MissionShoutLocally(UObject* WorldContext, UDialogDataAsset* Shout);
	void MissionShout(UObject* WorldContext, UDialogDataAsset* Shout, bool bPriority);
	bool IsMissionControlSpeaking();
	void ClientShout(APlayerCharacter* Sender, UDialogDataAsset* Shout, int32_t Index);
	void ClientMixerAnnouncement(FMixerAnnouncement Announcement);
	void ClientMissionShout(UDialogDataAsset* Shout, int32_t Index, bool bPriority);
};

// Class FSD.CommnuityRewardBundle
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardBundle : UDataAsset {
	TArray<FCommunityReward> Rewards; // 0x30(0x10)

	void AwardRewards(UObject* WorldContext);
};

// Class FSD.CommnuityRewardSetup
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardSetup : UDataAsset {
	TArray<UCommnuityRewardBundle*> TierRewards; // 0x30(0x10)

	TMap<UResourceData*, int32_t> GetResourcesTierOnlyReward(int32_t Tier);
	TMap<UResourceData*, int32_t> GetResourcesReward(int32_t Tier);
	void AwardTierRewards(UObject* WorldContext, int32_t Tier);
};

// Class FSD.CommunityGoalCategory
// Size: 0x48 (Inherited: 0x30)
struct UCommunityGoalCategory : UDataAsset {
	FText Title; // 0x30(0x18)
};

// Class FSD.CommunityGoalFaction
// Size: 0xe8 (Inherited: 0x30)
struct UCommunityGoalFaction : UDataAsset {
	FText Title; // 0x30(0x18)
	FText Description; // 0x48(0x18)
	FText ShortDescription; // 0x60(0x18)
	FText JoinHeader; // 0x78(0x18)
	FText JoinBody; // 0x90(0x18)
	UTexture2D* Icon; // 0xa8(0x08)
	UTexture2D* Frame; // 0xb0(0x08)
	FSlateColor Color; // 0xb8(0x28)
	enum class EFSDFaction FactionID; // 0xe0(0x01)
};

// Class FSD.CommunityGoal
// Size: 0x98 (Inherited: 0x30)
struct UCommunityGoal : UDataAsset {
	bool TierValuesAreInitialized; // 0x30(0x01)
	FGuid SavegameID; // 0x34(0x10)
	bool Active; // 0x44(0x01)
	FText Title; // 0x48(0x18)
	FText MetaDescription; // 0x60(0x18)
	UCommunityGoalCategory* Category; // 0x78(0x08)
	enum class ECommunityGoalType CommunityGoalType; // 0x80(0x01)
	float GoalPerMemberTier1; // 0x84(0x04)
	float GoalPerMemberTier2; // 0x88(0x04)
	float GoalPerMemberTier3; // 0x8c(0x04)
	UCommnuityRewardSetup* RewardSetup; // 0x90(0x08)

	float TotalTierProgress(float Value, int32_t Members);
	float TierValue(enum class ECommunityGoalTier Tier, float Value, int32_t Members);
	float TierProgress(enum class ECommunityGoalTier Tier, float Value, int32_t Members);
	float TierGoal(enum class ECommunityGoalTier Tier, int32_t Members);
	int32_t RewardTier(float Value, int32_t Members);
	void IncrementGoal(UObject* WorldContext, float Value);
	FText GoalToText(enum class ECommunityGoalType StatType, float Value);
	FText GetCategoryTitle();
	bool AreTiersInitialized();
};

// Class FSD.CommunityGoalWrapper
// Size: 0x140 (Inherited: 0x28)
struct UCommunityGoalWrapper : UObject {
	bool HasCGS; // 0x28(0x01)
	FCommunityGoalStateData CGSData; // 0x2c(0x10)
	int32_t LastCollectedRewardID; // 0x3c(0x04)
	FCommunityFactionData FactionData; // 0x48(0x38)
	bool FreeBeerRewardActive; // 0x80(0x01)
	FMulticastInlineDelegate OnFreeBeerRewardChanged; // 0x88(0x10)
	FString SteamTicket; // 0xb8(0x10)
	FString SteamBranch; // 0xc8(0x10)
	FMulticastInlineDelegate OnFactionsDataReceived; // 0xd8(0x10)
	FMulticastInlineDelegate OnDiscordCGSDataEvent; // 0xe8(0x10)
	FMulticastInlineDelegate UICheck; // 0xf8(0x10)
	FMulticastInlineDelegate OnGoalsInitializedDelegate; // 0x108(0x10)
	bool AreAllGoalsInitialized; // 0x138(0x01)

	void UpdateAllGoalsInitialized();
	bool RewardReceived();
	void RequestGoalStateData();
	void RequestFactionsData();
	void NextPeriod();
	void InitializeGoalTierTargetValues(UCommunityGoal* goalToInitialize);
	UCommunityGoalFaction* GetPlayerCurrentFaction(UObject* WorldContext);
	void ClaimRewardMessage(UObject* WorldContext, FCommunityRewardNotification rewardNotification);
	void ClaimReward();
	void CheckUI();
};

// Class FSD.ControllerIconSettings
// Size: 0xb8 (Inherited: 0x38)
struct UControllerIconSettings : UDeveloperSettings {
	FInputTranslationTable InputTranslationTable; // 0x38(0x50)
	TArray<FActionIconMapping> Xbox_KeyIcons; // 0x88(0x10)
	TArray<FActionIconMapping> Playstation_KeyIcons; // 0x98(0x10)
	TArray<FActionIconMapping> MouseKeyboard_KeyIcons; // 0xa8(0x10)

	bool FindMouseKeyboardKeyIcon(FKey Key, FActionIconMapping KeyIcon);
	bool FindKeyIcon(FKey Key, FActionIconMapping KeyIcon);
	bool FindControllerKeyIcon(FKey Key, FActionIconMapping KeyIcon);
};

// Class FSD.EnemyDeepPathfinderCharacter
// Size: 0x398 (Inherited: 0x378)
struct AEnemyDeepPathfinderCharacter : ADeepPathfinderCharacter {
	UEnemyHealthComponent* HealthComponent; // 0x380(0x08)
	FQueuedMontage QueuedMontage; // 0x388(0x10)

	void OnRep_QueuedMontage();
};

// Class FSD.ConvertedRobot
// Size: 0x6b8 (Inherited: 0x398)
struct AConvertedRobot : AEnemyDeepPathfinderCharacter {
	UEnemyComponent* EnemyComponent; // 0x3a0(0x08)
	UPawnStatsComponent* PawnStats; // 0x3a8(0x08)
	UOutlineComponent* outline; // 0x3b0(0x08)
	UHitscanComponent* HitScan; // 0x3b8(0x08)
	USingleUsableComponent* Usable; // 0x3c0(0x08)
	USceneComponent* TurretRoot; // 0x3c8(0x08)
	USkeletalMeshComponent* TurretMesh; // 0x3d0(0x08)
	UPointLightComponent* MuzzleFlash; // 0x3d8(0x08)
	USpotLightComponent* SpotLight; // 0x3e0(0x08)
	UStaticMeshComponent* LightCone; // 0x3e8(0x08)
	UStaticMeshComponent* LaserBeam; // 0x3f0(0x08)
	USceneComponent* ShieldRoot; // 0x3f8(0x08)
	UStaticMeshComponent* InnerShield; // 0x400(0x08)
	UStaticMeshComponent* OuterShield; // 0x408(0x08)
	UAudioComponent* PulsatingSoundComp; // 0x410(0x08)
	UAudioComponent* LaserWarningSound; // 0x418(0x08)
	UDamageComponent* Damage; // 0x420(0x08)
	FMulticastInlineDelegate OnStateChanged; // 0x428(0x10)
	FMulticastInlineDelegate OnShieldChanged; // 0x438(0x10)
	FMulticastInlineDelegate OnIntroductionStart; // 0x448(0x10)
	bool ForceSit; // 0x468(0x01)
	USoundBase* LaserSound; // 0x470(0x08)
	USoundBase* LastPowerDownSound; // 0x478(0x08)
	USoundBase* PowerUpSound; // 0x480(0x08)
	TWeakObjectPtr<UAudioComponent> LaserSoundComp; // 0x488(0x08)
	float IntroductionTime; // 0x4a8(0x04)
	bool IsIntroducing; // 0x4ac(0x01)
	bool IntroductionDone; // 0x4ad(0x01)
	bool IsGrowingShield; // 0x4ae(0x01)
	float AimDownwardsOffset; // 0x4b0(0x04)
	float BigShieldScale; // 0x4b4(0x04)
	float SmallShieldScale; // 0x4b8(0x04)
	float ShieldGrowthRate; // 0x4bc(0x04)
	float LerpExp; // 0x4c0(0x04)
	float MinimumShieldSize; // 0x4c4(0x04)
	float TargetShieldSize; // 0x4c8(0x04)
	float IdleRotationSpeed; // 0x4cc(0x04)
	float LaserScaleRate; // 0x4d0(0x04)
	float MaxSearchAngle; // 0x4d8(0x04)
	bool DoSpecialWhenEnemy; // 0x4f8(0x01)
	bool DoSpecialWhenFriendly; // 0x4f9(0x01)
	bool PerfectTrackingWhenEnemy; // 0x4fa(0x01)
	bool PerfectTrackingWhenFriendly; // 0x4fb(0x01)
	bool ReplaceBurstAttack; // 0x4fe(0x01)
	USoundBase* GrenadeFireSound; // 0x500(0x08)
	UParticleSystem* GrenadeFireParticle; // 0x508(0x08)
	bool IsFiring; // 0x510(0x01)
	float TurretSpinSpeed; // 0x514(0x04)
	TArray<AActor*> Parasites; // 0x518(0x10)
	int32_t SpawnParasiteNumer; // 0x528(0x04)
	int32_t MaxParasiteSlots; // 0x52c(0x04)
	float ChanceToSpawnParasite; // 0x530(0x04)
	AParasiteEnemy* ParasiteClass; // 0x538(0x08)
	bool SpinTurret; // 0x546(0x01)
	AProjectile* SpecialAttackProjectile; // 0x558(0x08)
	AProjectile* FriendlyProjectile; // 0x560(0x08)
	bool HasLockedOn; // 0x574(0x01)
	USoundBase* TargetingSound; // 0x578(0x08)
	UAnimSequenceBase* GrenadeShotAnimation; // 0x580(0x08)
	float LockonTime; // 0x588(0x04)
	USoundCue* ShootSound; // 0x590(0x08)
	float ShootSoundFadeout; // 0x598(0x04)
	UAudioComponent* ShootSoundInstance; // 0x5a0(0x08)
	USoundCue* ShootSoundTail; // 0x5a8(0x08)
	UParticleSystem* MuzzleEffect; // 0x5b0(0x08)
	UParticleSystem* TracerEffect; // 0x5b8(0x08)
	FRuntimeFloatCurve MuzzleLightCurve; // 0x5c0(0x88)
	float GunRange; // 0x650(0x04)
	float FireRate; // 0x654(0x04)
	float GrenadeFireRate; // 0x658(0x04)
	float BurstCooldown; // 0x660(0x04)
	int32_t MinBurst; // 0x668(0x04)
	int32_t MaxBurst; // 0x66c(0x04)
	float TurretLerpSpeed; // 0x670(0x04)
	float DamageWhenFriendly; // 0x674(0x04)
	float FriendlyFriendlyFireMultiplier; // 0x678(0x04)
	bool StartedSpecialAttack; // 0x680(0x01)
	enum class ERobotState TeamState; // 0x681(0x01)
	bool IsWalking; // 0x690(0x01)
	bool IsDoingSpecialAttack; // 0x691(0x01)
	UStaticMeshComponent* TurretRotation; // 0x698(0x08)
	AActor* CurrentTarget; // 0x6a8(0x08)

	void UpdateGunsInsideTerrain();
	void StartBossFight();
	void ParasiteDamaged(float aDamage);
	void OnWeaponsFired(FVector aHitResult);
	void OnUsed(APlayerCharacter* aUser);
	void OnSeePawn(APawn* APawn);
	void OnRep_TeamState();
	void OnRep_Target();
	void OnRep_SpinTurret();
	void OnRep_IsIntroducting();
	void OnRep_IsFiring();
	void OnRep_IsDoingSpecialAttack();
	void OnParasiteDeath(AActor* AParasiteEnemy);
	enum class ERobotState GetTeamState();
	FVector GetPlayerMediumPoint();
	TArray<AActor*> GetParasites();
	bool GetHasPoweredDown();
	void DestroyAttatchPoint(USceneComponent* aComponent);
	void CannonEffects();
	void BP_OnStateChanged(enum class ERobotState TeamState);
	void BP_OnShieldChanged(bool isGrowing);
	void BP_OnInstroduce();
};

// Class FSD.ConvertedRobotAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UConvertedRobotAnimInstance : UAnimInstance {
	bool HasIntroduced; // 0x26c(0x01)
	bool IsWalking; // 0x26d(0x01)
	bool IsIntroducing; // 0x26e(0x01)
	bool ShouldSit; // 0x26f(0x01)
	bool StopSit; // 0x270(0x01)
	bool ShouldCollapse; // 0x271(0x01)
	bool IsPoweredDown; // 0x272(0x01)
	float WalkingRate; // 0x274(0x04)
	float NormalWalkSpeed; // 0x278(0x04)
};

// Class FSD.ConvertedRobotTurretAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UConvertedRobotTurretAnimInstance : UAnimInstance {
	bool ReplaceBurstAttack; // 0x268(0x01)
	bool IsFiringGrenades; // 0x269(0x01)
	bool IsDoingSpecialAttack; // 0x26a(0x01)
	bool ShouldFireBullets; // 0x26b(0x01)
	bool StopFiringBullets; // 0x26c(0x01)
	bool ShouldCannonDeploy; // 0x26d(0x01)
};

// Class FSD.EnemyAIController
// Size: 0x358 (Inherited: 0x358)
struct AEnemyAIController : AFSDAIController {
};

// Class FSD.ConvertedRobotController
// Size: 0x428 (Inherited: 0x358)
struct AConvertedRobotController : AEnemyAIController {
	float CheckRangeInterval; // 0x358(0x04)
	float MaxTimeInRange; // 0x35c(0x04)
	float PersonalSpaceRange; // 0x364(0x04)
	FGameplayTagQuery FriendlyTargetingQuery; // 0x378(0x48)
	float SpecialAttackRange; // 0x3c0(0x04)
	float SpecialAttackFireRate; // 0x3c4(0x04)
	float WaitBeforeSpecial; // 0x3e8(0x04)
	float WaitAfterSpecial; // 0x3f0(0x04)
	float MinSpecialAttackCooldown; // 0x3fc(0x04)
	float MaxSpecialAttackCooldown; // 0x400(0x04)
	UBehaviorTree* BehaviourTree; // 0x408(0x08)
	float UpdateTargetInterval; // 0x410(0x04)
	float PowerDownAfterSeconds; // 0x418(0x04)

	void ResetCloseTimer();
};

// Class FSD.CoolDownItemAggregator
// Size: 0xe8 (Inherited: 0xc8)
struct UCoolDownItemAggregator : UItemAggregator {
	float CooldownDuration; // 0xc8(0x04)
	USoundBase* AudioCoolDownFinished; // 0xd0(0x08)
	float CooldownRemaining; // 0xd8(0x04)
	bool CoolDownIsPaused; // 0xdc(0x01)
	AItem* Item; // 0xe0(0x08)

	void SetPaused(bool IsPaused);
	bool IsCoolingDown();
	float GetCoolDownProgress();
	void ActivateCoolDown(bool startPaused);
};

// Class FSD.CoolDownProgressWidget
// Size: 0x280 (Inherited: 0x230)
struct UCoolDownProgressWidget : UUserWidget {
	FCoolDownProgressStyle Style; // 0x230(0x40)
	TWeakObjectPtr<UObject> CoolDownObject; // 0x270(0x08)
	bool bIsFinished; // 0x278(0x01)

	void UpdateProgress(float Progress);
	void ReceiveUpdateProgress(float InProgress);
	void ReceiveInitWidget();
	void Init(UObject* InCoolDownObject, FCoolDownProgressStyle InStyle);
};

// Class FSD.PricingTier
// Size: 0x40 (Inherited: 0x30)
struct UPricingTier : UDataAsset {
	FString PriceKey; // 0x30(0x10)
};

// Class FSD.SchematicPricingTier
// Size: 0x40 (Inherited: 0x40)
struct USchematicPricingTier : UPricingTier {
};

// Class FSD.CreditsResourceData
// Size: 0xf0 (Inherited: 0xf0)
struct UCreditsResourceData : UResourceData {
};

// Class FSD.CritterManager
// Size: 0xf8 (Inherited: 0xb0)
struct UCritterManager : UActorComponent {
	bool DisableCritters; // 0xb0(0x01)
	float ActivationRange; // 0xb4(0x04)
};

// Class FSD.CrosshairWidget
// Size: 0x230 (Inherited: 0x230)
struct UCrosshairWidget : UUserWidget {

	void SetData(AItem* Item);
};

// Class FSD.CrosshairAggregator
// Size: 0xe8 (Inherited: 0xc8)
struct UCrosshairAggregator : UItemAggregator {
	FMulticastInlineDelegate OnCrosshairCreated; // 0xc8(0x10)
	UUserWidget* CrosshairWidget; // 0xd8(0x08)
	UUserWidget* CrossHairType; // 0xe0(0x08)

	void SetCrosshair(UUserWidget* Widget);
	UUserWidget* GetOrCreateCrosshair();
};

// Class FSD.CryosprayItem
// Size: 0x818 (Inherited: 0x690)
struct ACryosprayItem : AAmmoDrivenWeapon {
	UProjectileLauncherComponent* ProjectileLauncher; // 0x690(0x08)
	UDamageComponent* DamageComponent; // 0x698(0x08)
	UStickyFlameSpawner* StickyFlames; // 0x6a0(0x08)
	UDamageComponent* AoEColdDamageComponent; // 0x6a8(0x08)
	UMotionAudioController* VelocityAudio; // 0x6b0(0x08)
	UParticleSystemComponent* FlameParticleComponent; // 0x6b8(0x08)
	bool PressurizedProjectileEnabled; // 0x6c0(0x01)
	float PressurizedProjectileDelay; // 0x6c4(0x04)
	int32_t PressurizeProjectileFullCost; // 0x6c8(0x04)
	UParticleSystem* ChargeupParticles; // 0x6d8(0x08)
	UParticleSystemComponent* ChargeupParticleInstance; // 0x6e0(0x08)
	FDecalData ImpactDecal; // 0x6e8(0x18)
	float DecalDelay; // 0x700(0x04)
	UParticleSystem* ImpactParticles; // 0x708(0x08)
	UParticleSystemComponent* ImpactParticleInstance; // 0x710(0x08)
	TArray<FName> FlameParameterNames; // 0x718(0x10)
	float DamageSphereRadius; // 0x728(0x04)
	float MaxFlameDistance; // 0x72c(0x04)
	float FlameGrowthPerSecond; // 0x730(0x04)
	float friendlyFireModifier; // 0x734(0x04)
	float ChargeupTime; // 0x738(0x04)
	float ChargeDownTime; // 0x73c(0x04)
	bool IsCharging; // 0x741(0x01)
	float ChargeProgress; // 0x744(0x04)
	bool bRepressurerising; // 0x748(0x01)
	float RepressurerisingDoneAtPct; // 0x74c(0x04)
	float ChargeUpFadeOutTime; // 0x750(0x04)
	UAudioComponent* ChargeUpAudioComponent; // 0x758(0x08)
	float PressureTime; // 0x760(0x04)
	float PressureDropMultiplier; // 0x764(0x04)
	float PressureGainMultiplier; // 0x768(0x04)
	float CurrentPressure; // 0x76c(0x04)
	float RePressureDuration; // 0x770(0x04)
	float RePressureProgress; // 0x774(0x04)
	TArray<UItemUpgrade*> Upgrades; // 0x778(0x10)
	bool LongReachEnabled; // 0x788(0x01)
	bool AoEColdEnabled; // 0x798(0x01)

	void ServerDoDamage(FVector_NetQuantize Start, FVector_NetQuantize End, char power);
	void Server_TriggerAoECold();
	void Server_PreLaunchProjectile();
	void ReceiveRepressurisingChanged(bool Value);
	void OnTargetDamaged(UHealthComponentBase* Health, float amount, UFSDPhysicalMaterial* PhysicalMaterial);
	void OnRep_IsCharging(bool OldValue);
	void OnProjectileSpawned(AProjectileBase* Projectile);
	void OnProjectileLaunched(FVector Location);
	void OnPressurizedPartileShoot();
	void OnPreProjectileLaunch();
	void All_PreLaunchProjectile();
};

// Class FSD.CryoSprayAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UCryoSprayAnimInstance : UAnimInstance {
	ACryosprayItem* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ChargeProgress; // 0x274(0x04)
	FRotator ChargeRotation; // 0x278(0x0c)
	float ChargeBlend; // 0x284(0x04)
	float Pressure; // 0x288(0x04)
};

// Class FSD.CustomKeyBindingLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCustomKeyBindingLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.KeyBindingSettings
// Size: 0x50 (Inherited: 0x30)
struct UKeyBindingSettings : UDataAsset {
	TArray<FCustomKeySetting> KeyboardMouseButtons; // 0x30(0x10)
	TArray<FCustomKeySetting> ControllerButtons; // 0x40(0x10)
};

// Class FSD.CustomRichTextDecorator
// Size: 0x30 (Inherited: 0x28)
struct UCustomRichTextDecorator : URichTextBlockDecorator {
	URichTextBlock* RichTextBlock; // 0x28(0x08)
};

// Class FSD.DailyDealSettings
// Size: 0x40 (Inherited: 0x30)
struct UDailyDealSettings : UDataAsset {
	TArray<FDailyDealSetup> DailyDeals; // 0x30(0x10)

	bool IsDailyDealBought(UObject* WorldContextObject);
	int32_t GetDailyDealSeed();
	void GetDailyDeal(FDailyDeal outDeal);
	bool CanAffordDailyDeal(UObject* WorldContextObject);
	bool BuyDailyDeal(UObject* WorldContextObject);
};

// Class FSD.DamageAttackComponent
// Size: 0xf8 (Inherited: 0xf0)
struct UDamageAttackComponent : UAttackBaseComponent {
	UDamageComponent* Damage; // 0xf0(0x08)
};

// Class FSD.DamageBonusBase
// Size: 0x30 (Inherited: 0x30)
struct UDamageBonusBase : UDataAsset {

	UDamageBonusBase* AddDamageBonusToComponent(UDamageBonusBase* damageBonusClass, UDamageComponent* DamageComponent);
};

// Class FSD.FlatDamageBonus
// Size: 0x40 (Inherited: 0x30)
struct UFlatDamageBonus : UDamageBonusBase {
	float Damage; // 0x30(0x04)
	UDamageClass* DamageClass; // 0x38(0x08)
};

// Class FSD.TargetSpecificDamageBonus
// Size: 0x88 (Inherited: 0x30)
struct UTargetSpecificDamageBonus : UDamageBonusBase {
	float Bonus; // 0x30(0x04)
	FGameplayTagQuery tagQuery; // 0x38(0x48)
	FName Key; // 0x80(0x08)
};

// Class FSD.DamageConversionBonus
// Size: 0x40 (Inherited: 0x30)
struct UDamageConversionBonus : UDamageBonusBase {
	UDamageClass* DamageClass; // 0x30(0x08)
	float ConversionPercentage; // 0x38(0x04)
	bool DamageIsAdded; // 0x3c(0x01)
};

// Class FSD.TargetStateDamageBonus
// Size: 0x40 (Inherited: 0x30)
struct UTargetStateDamageBonus : UDamageBonusBase {
	enum class ETargetStateDamageBonusType TargetState; // 0x30(0x01)
	float Bonus; // 0x34(0x04)
	UDamageClass* DamageClass; // 0x38(0x08)
};

// Class FSD.StatusDamageBonus
// Size: 0x50 (Inherited: 0x30)
struct UStatusDamageBonus : UDamageBonusBase {
	TArray<UStatusEffect*> StatusEffects; // 0x30(0x10)
	float Bonus; // 0x40(0x04)
	UDamageClass* DamageClass; // 0x48(0x08)
};

// Class FSD.StatusAndStateDamageBonus
// Size: 0x60 (Inherited: 0x30)
struct UStatusAndStateDamageBonus : UDamageBonusBase {
	TArray<UStatusEffect*> StatusEffects; // 0x30(0x10)
	TArray<enum class ETargetStateDamageBonusType> TargetStates; // 0x40(0x10)
	float Bonus; // 0x50(0x04)
	UDamageClass* DamageClass; // 0x58(0x08)
};

// Class FSD.PushStatusEffectDamageBonus
// Size: 0x50 (Inherited: 0x30)
struct UPushStatusEffectDamageBonus : UDamageBonusBase {
	UStatusEffect* StatusEffect; // 0x40(0x08)
	float Chance; // 0x48(0x04)
};

// Class FSD.FearAoEBonus
// Size: 0x38 (Inherited: 0x30)
struct UFearAoEBonus : UDamageBonusBase {
	float FearFactor; // 0x30(0x04)
	float Range; // 0x34(0x04)
};

// Class FSD.AmmoLeftDamageBonus
// Size: 0x50 (Inherited: 0x40)
struct UAmmoLeftDamageBonus : UFlatDamageBonus {
	UCurveFloat* AmmoDamageCurve; // 0x40(0x08)
};

// Class FSD.AmmoUsedDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UAmmoUsedDamageBonus : UDamageBonusBase {
	float DamageBonusPerRoundFired; // 0x30(0x04)
};

// Class FSD.RandomDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct URandomDamageBonus : UDamageBonusBase {
	FRandRange RandomDamageRange; // 0x30(0x08)
};

// Class FSD.PercentDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UPercentDamageBonus : UDamageBonusBase {
	float DamageMultiplier; // 0x30(0x04)
};

// Class FSD.GatlingHotShellsBonus
// Size: 0x40 (Inherited: 0x40)
struct UGatlingHotShellsBonus : UDamageConversionBonus {
};

// Class FSD.BreakIceBonus
// Size: 0x38 (Inherited: 0x30)
struct UBreakIceBonus : UDamageBonusBase {
	float DeFrostAmount; // 0x30(0x04)
};

// Class FSD.KnockbackDamageBonus
// Size: 0x38 (Inherited: 0x30)
struct UKnockbackDamageBonus : UDamageBonusBase {
	float KnockBackHorizontalForce; // 0x30(0x04)
	float KnockBackVerticalForce; // 0x34(0x04)
};

// Class FSD.DamageClass
// Size: 0x50 (Inherited: 0x30)
struct UDamageClass : UDataAsset {
	UPawnStat* ResistanceStat; // 0x30(0x08)
	float RagdollScale; // 0x38(0x04)
	bool BypassesShield; // 0x3c(0x01)
	bool AffectedByFriendlyFire; // 0x3d(0x01)
	UTexture2D* IndicatorImage; // 0x40(0x08)
	UDialogDataAsset* DamageShout; // 0x48(0x08)
};

// Class FSD.DamageComponent
// Size: 0x160 (Inherited: 0xb0)
struct UDamageComponent : UActorComponent {
	FMulticastInlineDelegate OnTargetKilledEvent; // 0xb0(0x10)
	FMulticastInlineDelegate OnTargetDamagedEvent; // 0xc0(0x10)
	FMulticastInlineDelegate OnNoTargetHitEvent; // 0xd0(0x10)
	enum class EDamageComponentType DamageComponentType; // 0xe4(0x01)
	float Damage; // 0xe8(0x04)
	float ArmorDamageMultiplier; // 0xec(0x04)
	UDamageClass* DamageClass; // 0xf0(0x08)
	float WeakpointDamageMultiplier; // 0xf8(0x04)
	float FrozenDamageBonusScale; // 0xfc(0x04)
	float friendlyFireModifier; // 0x100(0x04)
	FGameplayTag FriendlyFireTag; // 0x104(0x08)
	bool StaggerOnlyOnWeakpointHit; // 0x10c(0x01)
	float StaggerChance; // 0x110(0x04)
	float StaggerDuration; // 0x114(0x04)
	float FearFactor; // 0x118(0x04)
	TArray<UDamageBonusBase*> DamageBonuses; // 0x120(0x10)
	bool UseAreaOfEffect; // 0x130(0x01)
	float RadialDamage; // 0x134(0x04)
	UDamageClass* RadialDamageClass; // 0x138(0x08)
	float MinDamagePct; // 0x140(0x04)
	float DamageRadius; // 0x144(0x04)
	float MaxDamageRadius; // 0x148(0x04)

	UDamageComponent* GetDamageComponentCDO(UDamageComponent* DamageComponent);
	float GetDamage();
	void DamageTarget(AActor* Target, FVector Location, UPrimitiveComponent* HitComponent, UFSDPhysicalMaterial* PhysMat);
	void DamageArmor_Server(AActor* Target, int32_t BoneIndex, FVector impactLocation);
	void DamageArmor_All(AActor* Target, int32_t BoneIndex);
};

// Class FSD.DamageSettings
// Size: 0x100 (Inherited: 0x30)
struct UDamageSettings : UDataAsset {
	float TemperatureChangePerColdDamagePoint; // 0x30(0x04)
	float TemperatureChangePerIceDamagePoint; // 0x34(0x04)
	float TemperatureChangePerHeatDamagePoint; // 0x38(0x04)
	float TemperatureChangePerFireDamagePoint; // 0x3c(0x04)
	float TemperatureShockActivationWindow; // 0x40(0x04)
	float FrozenDamageBonus; // 0x44(0x04)
	UStatusEffect* EnemyOnFireStatusEffect; // 0x48(0x08)
	UStatusEffect* PlayerOnFireStatusEffect; // 0x50(0x08)
	UStatusEffect* TemperatureShockFromFrozenStatusEffect; // 0x58(0x08)
	UStatusEffect* TemperatureShockFromBurningStatusEffect; // 0x60(0x08)
	TArray<FDecalData> ImpactDecals; // 0x68(0x10)
	FRuntimeFloatCurve ArmorToArmorDamageBreakingCurve; // 0x78(0x88)
};

// Class FSD.DamageSubsystem
// Size: 0x40 (Inherited: 0x30)
struct UDamageSubsystem : UGameInstanceSubsystem {
	TArray<FDamageSubsystemItem> Items; // 0x30(0x10)
};

// Class FSD.DanceSettings
// Size: 0x40 (Inherited: 0x30)
struct UDanceSettings : UDataAsset {
	TArray<FDanceItem> DanceMoves; // 0x30(0x10)
};

// Class FSD.DashPoints
// Size: 0x1d0 (Inherited: 0xb0)
struct UDashPoints : UActorComponent {
	FMulticastInlineDelegate OnStartDashEvent; // 0xb0(0x10)
	FMulticastInlineDelegate OnStopDashEvent; // 0xc0(0x10)
	FVector_NetQuantize DashLocation; // 0xdc(0x0c)
	FRuntimeFloatCurve DashSpeedCurve; // 0xf8(0x88)
	float PointOffset; // 0x198(0x04)
	float MaxRangeFromPlayer; // 0x19c(0x04)
	float MinRangeFromPlayer; // 0x1a0(0x04)
	float MinHeightAboveTarget; // 0x1a4(0x04)
	float MaxHeightAboveTarget; // 0x1a8(0x04)
	float safeReduction; // 0x1ac(0x04)
	float AcceptedDashradius; // 0x1b0(0x04)
	float DashSpeed; // 0x1b4(0x04)
	float SlowdownRadius; // 0x1b8(0x04)
	int32_t IgnoreTheClosestPoints; // 0x1c8(0x04)
	enum class EDashPointsGenerationMode GenerationMode; // 0x1cc(0x01)
	bool IsDashing; // 0x1cd(0x01)
	bool IgnoreRules; // 0x1ce(0x01)

	void UpdateDashPointData();
	void StopDashing();
	void StartDashing();
	void OnRep_Dashing();
	void OnParentDeath(UHealthComponentBase* Health);
	FVector GetDashPoint(AActor* fromTarget, bool success);
};

// Class FSD.DeadStateComponent
// Size: 0x100 (Inherited: 0xf8)
struct UDeadStateComponent : UCharacterStateComponent {
	float RespawnDelay; // 0xf8(0x04)
};

// Class FSD.DealWidget
// Size: 0x230 (Inherited: 0x230)
struct UDealWidget : UUserWidget {

	void UpdateDealText();
};

// Class FSD.FSDDebrisSettings
// Size: 0x68 (Inherited: 0x38)
struct UFSDDebrisSettings : UDeveloperSettings {
	FSoftObjectPath DefaultInfluencerDensityCurve; // 0x38(0x18)
	FSoftObjectPath DefaultInfluencerSizeCurve; // 0x50(0x18)
};

// Class FSD.CSGTriangleMapper
// Size: 0xd0 (Inherited: 0x30)
struct UCSGTriangleMapper : UDataAsset {
	bool Enabled; // 0x30(0x01)
	UTerrainMaterial* AttachToMaterial; // 0x38(0x08)
	TArray<UTerrainType*> AttachToTypes; // 0x40(0x10)
	int32_t CellCategories; // 0x50(0x04)
	float DensityInM2; // 0x54(0x04)
	float MinVerticalAngle; // 0x58(0x04)
	float MaxVerticalAngle; // 0x5c(0x04)
	FVector ScaleMin; // 0x60(0x0c)
	FVector ScaleMax; // 0x6c(0x0c)
	float ScaleBias; // 0x78(0x04)
	bool IndependentScaleAxes; // 0x7c(0x01)
	FVector BaseNormal; // 0x80(0x0c)
	float SurfaceNormalFactor; // 0x8c(0x04)
	FVector SurfaceNormalLimiter; // 0x90(0x0c)
	float RandomNormalFactor; // 0x9c(0x04)
	float RotationMinAngle; // 0xa0(0x04)
	float RotationMaxAngle; // 0xa4(0x04)
	float PosOffset; // 0xa8(0x04)
	float PosOffsetSurface; // 0xac(0x04)
	TArray<FCellNoise> NoiseLayers; // 0xb0(0x10)
	FDebrisCellNoiseParameters CellNoiseParameters; // 0xc0(0x10)
};

// Class FSD.DebrisBase
// Size: 0x1f8 (Inherited: 0xd0)
struct UDebrisBase : UCSGTriangleMapper {
	UObject* CaveInfluencer; // 0xd0(0x08)
	FRuntimeFloatCurve InfluencerDensityCurve; // 0xd8(0x88)
	FRuntimeFloatCurve InfluencerSizeCurve; // 0x160(0x88)
	UCurveFloat* CaveInfluenceCurve; // 0x1e8(0x08)
	UCurveFloat* CaveInflunceSizeCurve; // 0x1f0(0x08)
};

// Class FSD.DebrisCarved
// Size: 0x250 (Inherited: 0x1f8)
struct UDebrisCarved : UDebrisBase {
	enum class EDebrisCarvedType carverType; // 0x1f8(0x01)
	TArray<FUDebrisCarveMesh> Meshes; // 0x200(0x10)
	UTerrainMaterial* TerrainMaterial; // 0x210(0x08)
	FDebrisInfluence CaveInfluenceToAdd; // 0x218(0x10)
	enum class ECarveFilterType Filter; // 0x228(0x01)
	float ExpensiveNoise; // 0x22c(0x04)
	enum class CarveOptionsCellSize CarveCellSize; // 0x230(0x01)
	int32_t MinNumCarves; // 0x234(0x04)
	int32_t MaxNumCarves; // 0x238(0x04)
	float CarveOffsetRadius; // 0x23c(0x04)
	AActor* SpawnAttachClass; // 0x240(0x08)
	float AttachSpawnOffsetDistance; // 0x248(0x04)
};

// Class FSD.DebrisActorComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDebrisActorComponent : USceneComponent {
	bool Enabled; // 0x1f4(0x01)
};

// Class FSD.DebrisItemComponent
// Size: 0x230 (Inherited: 0x200)
struct UDebrisItemComponent : UDebrisActorComponent {
	UDebrisPositioning* Debris; // 0x1f8(0x08)
	TArray<FDebrisItemActorItem> Actors; // 0x200(0x10)
	enum class EDebrisItemPass ItemPass; // 0x210(0x01)
	float InfluenceRange; // 0x214(0x04)
	float MinDistanceToImportantLocations; // 0x218(0x04)
	bool UseAmount; // 0x21c(0x01)
	FIRandRange amount; // 0x220(0x08)
	int32_t AmountSearchMultiplier; // 0x228(0x04)
};

// Class FSD.DebrisDataComponent
// Size: 0x200 (Inherited: 0x200)
struct UDebrisDataComponent : UDebrisActorComponent {
	UDebrisBase* Debris; // 0x1f8(0x08)
};

// Class FSD.DebrisVeinComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisVeinComponent : UDebrisActorComponent {
	UTerrainMaterial* Material; // 0x1f8(0x08)
	enum class EDebrisCarvedType carverType; // 0x200(0x01)
	UVeinResourceCreator* VeinCreator; // 0x208(0x08)
};

// Class FSD.DebrisPatchComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisPatchComponent : UDebrisActorComponent {
	UTerrainMaterial* Material; // 0x1f8(0x08)
	UPatchResourceCreator* PatchCreator; // 0x200(0x08)
};

// Class FSD.InfluencerComponent
// Size: 0x310 (Inherited: 0x200)
struct UInfluencerComponent : UDebrisActorComponent {
	FRuntimeFloatCurve ProbabilityCurve; // 0x1f8(0x88)
	FRuntimeFloatCurve ScaleCurve; // 0x280(0x88)
};

// Class FSD.DebrisProbabilityComponent
// Size: 0x210 (Inherited: 0x200)
struct UDebrisProbabilityComponent : UDebrisActorComponent {
	FRandRange ProbabilityRange; // 0x1f8(0x08)
	bool IsProbabilityShared; // 0x200(0x01)
};

// Class FSD.DebrisDataActor
// Size: 0x238 (Inherited: 0x220)
struct ADebrisDataActor : AActor {
};

// Class FSD.DebrisInstances
// Size: 0x6e0 (Inherited: 0x620)
struct UDebrisInstances : UHierarchicalInstancedStaticMeshComponent {
	UDebrisBase* DebrisBase; // 0x618(0x08)
	int32_t DebrisIndex; // 0x624(0x04)
};

// Class FSD.DebrisMesh
// Size: 0x250 (Inherited: 0x1f8)
struct UDebrisMesh : UDebrisBase {
	TArray<FDebrisStaticMesh> Meshes; // 0x1f8(0x10)
	UMaterialInterface* CommonMaterial; // 0x208(0x08)
	FText InGameName; // 0x210(0x18)
	FName GemTrackerName; // 0x228(0x08)
	FText InGameDescription; // 0x230(0x18)
	float StartCullDistance; // 0x248(0x04)
	float EndCullDistance; // 0x24c(0x04)
};

// Class FSD.DebrisCellNoise
// Size: 0x58 (Inherited: 0x30)
struct UDebrisCellNoise : UDataAsset {
	int32_t Seed; // 0x30(0x04)
	FVector CellSize; // 0x34(0x0c)
	int32_t NumValues; // 0x40(0x04)
	FVector InvCellSize; // 0x44(0x0c)
	bool Initialized; // 0x50(0x01)
};

// Class FSD.DebrisPositioning
// Size: 0x1f8 (Inherited: 0x1f8)
struct UDebrisPositioning : UDebrisBase {
};

// Class FSD.DebrisSet
// Size: 0x40 (Inherited: 0x30)
struct UDebrisSet : UDataAsset {
	TArray<TSoftObjectPtr<UDebrisBase>> Debris; // 0x30(0x10)
};

// Class FSD.DebrisStaticCarved
// Size: 0x240 (Inherited: 0x1f8)
struct UDebrisStaticCarved : UDebrisBase {
	enum class EDebrisCarvedType carverType; // 0x1f8(0x01)
	TArray<FUDebrisStaticCarveMesh> Meshes; // 0x200(0x10)
	UTerrainMaterial* TerrainMaterial; // 0x210(0x08)
	FDebrisInfluence CaveInfluenceToAdd; // 0x218(0x10)
	enum class ECarveFilterType Filter; // 0x228(0x01)
	float CarveOffsetRadius; // 0x22c(0x04)
	AActor* SpawnAttachClass; // 0x230(0x08)
	float AttachSpawnOffsetDistance; // 0x238(0x04)
};

// Class FSD.CustomItemPlacementHandling
// Size: 0x28 (Inherited: 0x28)
struct UCustomItemPlacementHandling : UInterface {
};

// Class FSD.InfluencerSpawnComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UInfluencerSpawnComponent : USceneComponent {
	UCaveInfluencer* Influencer; // 0x1f0(0x08)
	float Range; // 0x1f8(0x04)
};

// Class FSD.DecalManager
// Size: 0xb0 (Inherited: 0xb0)
struct UDecalManager : UActorComponent {

	void SpawnDecal(FVector Location, FVector Normal, UFSDPhysicalMaterial* PhysMat);
};

// Class FSD.DeepCSGWorld
// Size: 0x810 (Inherited: 0x220)
struct ADeepCSGWorld : AActor {
	UTerrainMaterial* DebugCarveInsideTerrainMaterial; // 0x228(0x08)
	UTerrainMaterial* DebugCarveOutsizeTerrainMaterial; // 0x230(0x08)
	UTerrainMaterial* DebugCarveEdgeTerrainMaterial; // 0x238(0x08)
	UTerrainMaterial* GoldTerrainMaterial; // 0x240(0x08)
	UTerrainMaterial* MOMTerrrainMaterial; // 0x248(0x08)
	UTerrainMaterial* NitraTerrrainMaterial; // 0x250(0x08)
	UTerrainMaterial* EmptyTerrainMaterial; // 0x258(0x08)
	UTerrainMaterial* DefaultBurntTerrainMaterial; // 0x260(0x08)
	UTerrainMaterial* DefaultHardRockMaterial; // 0x268(0x08)
	UTerrainMaterial* DefaultBedRockMaterial; // 0x270(0x08)
	UTerrainType* GoldTerrainType; // 0x278(0x08)
	UTerrainType* MOMTerrainType; // 0x280(0x08)
	UTerrainType* RockTerrainType; // 0x288(0x08)
	UTerrainType* CrystalTerrainType; // 0x290(0x08)
	UTerrainType* EmptyTerrainType; // 0x298(0x08)
	UTerrainType* DirtTerrainType; // 0x2a0(0x08)
	UTerrainType* DefaultBurntTerrainType; // 0x2a8(0x08)
	UTerrainMaterialsCollection* TerrainMaterials; // 0x2b0(0x08)
	TArray<UDebrisSet*> StandardDebrisSets; // 0x2b8(0x10)
	TArray<UDebrisBase*> AddedDebris; // 0x2c8(0x10)
	TArray<UDebrisBase*> DebrisLevelGenerationCarved; // 0x2d8(0x10)
	TArray<UDebrisBase*> DebrisLargeCarved; // 0x2e8(0x10)
	TArray<UDebrisBase*> DebrisSmallCarved; // 0x2f8(0x10)
	TArray<UDebrisBase*> DebrisMeshes; // 0x308(0x10)
	UMaterialInterface* DefaultScannerMaterial; // 0x318(0x08)
	ADebrisDataActor* DebrisActorInstance; // 0x320(0x08)
	int32_t DebrisActorIndex; // 0x328(0x04)
	AProceduralSetup* ProceduralSetup; // 0x330(0x08)
	TArray<UObject*> TerrainMaterialAssets; // 0x338(0x10)
	UAsyncPathRequests* AsyncPathRequests; // 0x380(0x08)
	FMulticastInlineDelegate OnBaseLayerCommitDone; // 0x388(0x10)
	FMulticastInlineDelegate OnBaseLayerFinalCommitDone; // 0x398(0x10)
	TArray<AActor*> TerrainAttachedActors; // 0x3a8(0x10)
	TArray<TWeakObjectPtr<UObject>> TerrainListeners; // 0x3b8(0x10)
	TArray<UDebrisBase*> RegisteredDebrisList; // 0x3c8(0x10)
	TArray<FDebrisWhenCarving> DebrisWhenCarvingList; // 0x3d8(0x10)
	TArray<UDebrisInstances*> DebrisInstanceList; // 0x3e8(0x10)
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowAlwaysScannerComponents; // 0x3f8(0x10)
	TArray<TWeakObjectPtr<UPrimitiveComponent>> FogOfWarScannerComponents; // 0x408(0x10)
	TArray<UDebrisBase*> DebrisHandles; // 0x418(0x10)
	FTerrainLateJoinData LateJoinData; // 0x6e8(0xa8)
	TArray<FEncodedChunkId> visibleChunks; // 0x790(0x10)

	void UnRegisterScannerComponent(UPrimitiveComponent* Component);
	void TerrainOp_RemoveFloating(FRemoveFloatingIslandOperationData Data);
	void TerrainOp_PickAxe(FPickaxeDigOperationData Data);
	void TerrainOp_Melt(FMeltOperationData Data);
	void TerrainOp_Explode(FGrenadeExplodeOperationData Data);
	void TerrainOp_Drill(FDrillOperationData Data);
	void TerrainOp_CarveSTLMesh(FCarveWithSTLMeshOperationData Data);
	void TerrainOp_CarveSplineSegment(FSplineSegmentCarveOperationData Data);
	void TerrainOp_CarveCollider(FCarveWithColliderOperationData Data);
	void TerrainMaterialDataLoaded();
	void SetVisibleToScanner(FVector Center, FVector Range);
	void SelectDebrisSettings();
	void ResetEntireWorld();
	void RemoveDebrisInstance_TerrainOp2(int32_t instance, int32_t Component);
	void RemoveDebrisInSphere(FVector Position, float Radius, bool onlyFragile, bool alsoDurable);
	void RegisterScannerComponent(UPrimitiveComponent* Component, bool useFogOfWar);
	bool Raycast(FVector Start, FVector Direction, float MaxDistance, FCSGRaycastHitInfo HitInfo, enum class ELandscapeCellFilter Filter);
	bool Linecast(FVector Start, FVector End, FCSGRaycastHitInfo HitInfo, enum class ELandscapeCellFilter Filter);
	bool IsPositionVisibleToScanner(FVector Pos);
	bool IsPointInsideTerrain(FVector Pos);
	bool IsComponentRegisteredWithScanner(UPrimitiveComponent* Component);
	int32_t GetTerrainHash();
	int32_t GetShadowQuality();
	ADebrisDataActor* GetDebrisDataActor();
	void GetAllTerrainActorsAroundPoint(FVector Center, FVector Range, TArray<AActor*> TerrainActors);
	void GenerateAllMeshes();
	void FinishGeneration_Blocking();
	float FindTotalVolumeOfMaterialInWorld(UTerrainMaterial* Material);
	void CarveWithSTLMeshUsingTransform_Wait(ADeepCSGWorld* CSGWorld, USTLMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, enum class EPreciousMaterialOptions Precious, FLatentActionInfo LatentInfo);
	void CarveWithSTLMeshUsingTransform(USTLMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, enum class EPreciousMaterialOptions Precious);
	void CarveWithSTLMesh_Wait(ADeepCSGWorld* CSGWorld, USTLMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FVector Pos, FQuat Orientation, FVector Scale, enum class EPreciousMaterialOptions Precious, FLatentActionInfo LatentInfo);
	void CarveWithSTLMesh(USTLMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FVector Pos, FQuat Orientation, FVector Scale, enum class EPreciousMaterialOptions Precious);
	void CarveWithStaticMeshUsingTransform_Wait(ADeepCSGWorld* CSGWorld, UStaticMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, enum class EPreciousMaterialOptions Precious, FLatentActionInfo LatentInfo);
	void CarveWithStaticMeshUsingTransform(UStaticMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, enum class EPreciousMaterialOptions Precious);
	void CarveWithStaticMesh(UStaticMeshCarver* MeshCarver, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FVector Pos, FQuat Orientation, FVector Scale, enum class EPreciousMaterialOptions Precious);
	void CarveWithSplineSegments(TArray<FCarveSplineSegment> Segments, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, enum class EPreciousMaterialOptions Precious);
	void CarveWithSplineSegment(FVector SplineStart, FVector SplineStartTangent, FVector SplineEnd, FVector SplineEndTangent, float Radius, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, enum class EPreciousMaterialOptions Precious);
	void CarveWithMeshUsingTransform_Wait(ADeepCSGWorld* CSGWorld, UStaticMesh* StaticMesh, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, float ExpensiveNoise, enum class EPreciousMaterialOptions Precious, FLatentActionInfo LatentInfo);
	void CarveWithMeshUsingTransform(UStaticMesh* StaticMesh, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FTransform Transform, float ExpensiveNoise, enum class EPreciousMaterialOptions Precious, enum class CarveOptionsCellSize CarverSize);
	void CarveWithMesh_Wait(ADeepCSGWorld* CSGWorld, UStaticMesh* StaticMesh, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FVector Pos, FQuat Orientation, FVector Scale, FLatentActionInfo LatentInfo);
	void CarveWithMesh(UStaticMesh* StaticMesh, UTerrainMaterial* Material, enum class ECarveFilterType CarveFilter, FVector Pos, FQuat Orientation, FVector Scale, enum class EPreciousMaterialOptions Precious);
	float CalcApproximateTerrainDensity(FVector Pos, float Radius);
	void BaseLayerCommitFinal(bool blocking);
	void BaseLayerCommit(bool blocking, bool scheduleTesselation);
	void AttachActorToTerrain(AActor* Actor, FVector Pos);
	void ApplyDebrisCarvers();
	void ApplyBaseDebrisCarvers(TArray<UDebrisBase*> Carvers);
};

// Class FSD.SavableDataAsset
// Size: 0x58 (Inherited: 0x30)
struct USavableDataAsset : UDataAsset {
	bool EnableDangerousSaveGameIDEditing; // 0x38(0x01)
	FGuid SavegameID; // 0x3c(0x10)
	UBuildRestriction* BuildRestriction; // 0x50(0x08)

	FGuid GetSavegameID();
};

// Class FSD.DeepDiveTemplate
// Size: 0xc0 (Inherited: 0x58)
struct UDeepDiveTemplate : USavableDataAsset {
	TArray<UDifficultySetting*> Difficulties; // 0x58(0x10)
	TArray<FDeepDiveTemplateItem> missions; // 0x68(0x10)
	TArray<enum class ESchematicType> Rewards; // 0x78(0x10)
	int32_t CreditsPerPrimaryObjective; // 0x88(0x04)
	int32_t CreditsPerSecondaryObjective; // 0x8c(0x04)
	int32_t XPPerPrimaryObjective; // 0x90(0x04)
	int32_t XPPerSecondaryObjective; // 0x94(0x04)
	float HazardBonus; // 0x98(0x04)
	FRandInterval MutatorCount; // 0xa0(0x10)
	FRandInterval WarningCount; // 0xb0(0x10)

	enum class ESchematicType GetStageRewardType(int32_t StageIndex);
};

// Class FSD.DeepDiveSettings
// Size: 0x98 (Inherited: 0x30)
struct UDeepDiveSettings : UDataAsset {
	UDeepDiveTemplate* NormalTemplate; // 0x30(0x08)
	UDeepDiveTemplate* HardTemplate; // 0x38(0x08)
	TArray<UMutator*> BaseMutators; // 0x40(0x10)
	TArray<UMissionMutator*> Mutators; // 0x50(0x10)
	TArray<UMissionWarning*> Warnings; // 0x60(0x10)
	TArray<UDialogDataAsset*> DeepDiveMissionCompleteShouts; // 0x70(0x10)
	TArray<FDeepDiveLoaderSequence> LoaderSequnces; // 0x80(0x10)
	UMissionNameBank* DeepDiveNameBank; // 0x90(0x08)
};

// Class FSD.DeepDiveFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UDeepDiveFunctionLibrary : UBlueprintFunctionLibrary {

	bool IsDeepDiveElite(UObject* WorldContextObject, UDeepDive* DeepDive);
	bool GetHasEverCompletedDeepDive(UObject* WorldContextObject, UDeepDiveTemplate* DeepDive);
};

// Class FSD.DeepDiveManager
// Size: 0xd8 (Inherited: 0x28)
struct UDeepDiveManager : UObject {
	FMulticastInlineDelegate OnDeepDivesRefresh; // 0x28(0x10)
	UDeepDive* ActiveNormalDeepDive; // 0x38(0x08)
	UDeepDive* ActiveHardDeepDive; // 0x40(0x08)
	UDeepDive* ActiveDeepDive; // 0x48(0x08)
	UGeneratedMission* CurrentMission; // 0x50(0x08)
	float currentDepth; // 0x5c(0x04)
	TMap<int32_t, FDeepDiveBank> DeepDiveBank; // 0x60(0x50)
	int32_t NumFailedRequests; // 0xb0(0x04)
	int32_t BackendDataValid; // 0xb4(0x04)
	int32_t BackendSeed; // 0xb8(0x04)
	bool LockSeed; // 0xbc(0x01)
	FDateTime BackendExpirationTime; // 0xc0(0x08)
	FDateTime LastRequestTime; // 0xc8(0x08)

	void StartDeepDive(UDeepDive* DeepDive);
	void ReInitialize();
	void MarkGivenRewards();
	bool IsEliteDeepDive(UGeneratedMission* mission);
	UDeepDive* GetDeepDiveFromMission(UGeneratedMission* mission);
	UGeneratedMission* GetCurrentSingleMission();
	int32_t GetCurrentDeepDiveStage();
	UDeepDive* GetActiveNormalDeepDive();
	UDeepDive* GetActiveHardDeepDive();
	UDeepDive* GetActiveDeepDive();
	void DeepDiveRefreshDelegate__DelegateSignature();
	bool CompleteCurrentSingleMission();
	bool AreAllSelectedClassesQualified();
};

// Class FSD.DeepDive
// Size: 0x98 (Inherited: 0x28)
struct UDeepDive : UObject {
	TArray<UGeneratedMission*> missions; // 0x28(0x10)
	UBiome* Biome; // 0x38(0x08)
	TArray<FDeepDiveRewardItem> GivenRewards; // 0x40(0x10)
	int32_t MissionsCompleted; // 0x50(0x04)
	TArray<int32_t> StagesCompleted; // 0x58(0x10)
	int32_t CurrentMissionIndex; // 0x68(0x04)
	UDeepDiveTemplate* Template; // 0x70(0x08)
	FText DeepDiveName; // 0x78(0x18)
	int32_t BestTime; // 0x90(0x04)

	bool IsCompleted();
	bool HasCompletedStage(int32_t StageIndex);
	FDeepDiveRewardItem GetGivenRewardAtStage(int32_t StageIndex);
};

// Class FSD.AsyncPathRequestsInterface
// Size: 0x28 (Inherited: 0x28)
struct UAsyncPathRequestsInterface : UInterface {
};

// Class FSD.AsyncPathRequests
// Size: 0xc8 (Inherited: 0xb0)
struct UAsyncPathRequests : UActorComponent {
	TArray<TWeakObjectPtr<UObject>> RequestListeners; // 0xb0(0x10)
};

// Class FSD.DeepPathfinderSceneComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDeepPathfinderSceneComponent : USceneComponent {
};

// Class FSD.DeepPathfinderMovement
// Size: 0x428 (Inherited: 0x138)
struct UDeepPathfinderMovement : UPawnMovementComponent {
	bool UseDormancy; // 0x140(0x01)
	float MaxPawnSpeed; // 0x144(0x04)
	float StrafeSpeed; // 0x148(0x04)
	float MinSlowdownAngle; // 0x14c(0x04)
	float MaxSlowdownAngle; // 0x150(0x04)
	float MaxStrafeDistance; // 0x154(0x04)
	float AlignDirectionSpeed; // 0x158(0x04)
	float FleeSpeedBoostMultiplier; // 0x15c(0x04)
	float MaxAcceleration; // 0x160(0x04)
	float MaxBrakingDeceleration; // 0x164(0x04)
	float AngleSpeedFilterFactor; // 0x168(0x04)
	uint32_t AIAvoidanceWeight; // 0x16c(0x04)
	enum class DeepPathFinderType PathfinderType; // 0x170(0x01)
	enum class DeepPathFinderSize PathfinderSize; // 0x171(0x01)
	enum class ETeleportType MovementPhysicsType; // 0x172(0x01)
	enum class DeepPathFinderPreference PathfinderPreference; // 0x173(0x01)
	bool AlignTowardsTargetIfStationary; // 0x174(0x01)
	float AlignToTargetMinRequiredAngle; // 0x178(0x04)
	bool AllowSlowTickRateWhenNotVisible; // 0x17c(0x01)
	bool ForceAPathIfNoneFound; // 0x17d(0x01)
	bool DrawServerPath; // 0x17e(0x01)
	FMulticastInlineDelegate OnPathBegin; // 0x180(0x10)
	FMulticastInlineDelegate OnPauseMovementElapsed; // 0x190(0x10)
	FMulticastInlineDelegate OnPathFinished; // 0x1a0(0x10)
	FMulticastInlineDelegate OnRefreshDestination; // 0x1b0(0x10)
	FMulticastInlineDelegate OnStateChanged; // 0x1c0(0x10)
	ADeepCSGWorld* CSGWorld; // 0x1f8(0x08)
	uint32_t PathMovedDist; // 0x200(0x04)
	uint32_t LocalPathMovedDist; // 0x204(0x04)
	FDeepRepPath Path; // 0x208(0xd0)
	UFakeMoverSettings* MoveSettings; // 0x2d8(0x08)
	AActor* TargetActor; // 0x2e0(0x08)
	int32_t CurrentPathIndex; // 0x2e8(0x04)
	float CurrentPathFraction; // 0x2ec(0x04)
	FVector Destination; // 0x2f0(0x0c)
	AActor* DestinationActor; // 0x300(0x08)
	float AcceptanceRadius; // 0x308(0x04)
	bool OnlyPartPath; // 0x30c(0x01)
	float PauseMovementTime; // 0x310(0x04)
	enum class EDeepMovementMode MoveMode; // 0x314(0x01)
	UPawnStatsComponent* PawnStats; // 0x318(0x08)
	FVector LastForwardDir; // 0x32c(0x0c)
	float VerticalAngleSpeed; // 0x338(0x04)
	float HorizontalAngleSpeed; // 0x33c(0x04)
	bool IsStrafing; // 0x340(0x01)
	bool HasOustandingPathRequest; // 0x341(0x01)
	bool LastPathReachedPreciseDestination; // 0x342(0x01)
	float PostponedTickTime; // 0x368(0x04)
	bool LastMoveSuccessful; // 0x36c(0x01)
	bool HandleRotation; // 0x36d(0x01)
	FHandleRotationOptions HandleRotationOptions; // 0x36e(0x01)
	FVector UnfilteredPosition; // 0x388(0x0c)
	FVector LastDestPosUsed; // 0x394(0x0c)
	float DampOmega; // 0x3a0(0x04)
	bool UseMovementSpring; // 0x3a4(0x01)
	bool SnapToPathfinderOnFirstMove; // 0x3a5(0x01)
	FFakeMoverState FakePhysicsMove; // 0x3a8(0x60)
	float FakeSyncTime; // 0x408(0x04)

	void UpdateTargetActor(AActor* NewTarget);
	void UpdateDestination(FVector Dest);
	void UnPauseMovement();
	void TeleportTo(FVector destLoc, FRotator destRot);
	void StopMove();
	void StopAttackStance();
	bool StartMoveToActor(AActor* Dest, float AcceptanceRadius);
	bool StartMoveTo(FVector Dest, float AcceptanceRadius);
	bool StartFleeFrom(FVector dangerPos, float Distance);
	void StartFakePhysicsMoveSet(UFakeMoverSettings* MoveSettings);
	void StartFakePhysics(FVector Vel);
	void StartAttackStance(FVector stancePos);
	void SnapToPathfinder();
	void SetSlowDownAngles(float Min, float Max);
	void SetMaxSpeed(float Speed);
	void SetHandleRotation(bool flag);
	void SetFreezeAlignment(bool Freeze);
	void SetControlledExternally(bool controlled);
	void PauseMovement(float Time);
	bool PathExistTo(FVector Dest);
	bool PathExistsBetween(FVector From, FVector to);
	void OnRep_PathMovedDist(uint32_t lastPathMovedDist);
	void OnRep_Path(FDeepRepPath oldPath);
	void OnRep_MoveSettings(UFakeMoverSettings* MoveSettings);
	bool IsFreezeAlignmentSet();
	float GetVerticalAngleSpeed();
	void GetRandomSpawnPointAtApproximateDistance_Async(FVector Origin, float Distance, bool success, FVector outPos, FLatentActionInfo LatentInfo);
	void GetRandomReachablePointAtApproximateDistance_Async(FVector Origin, float Distance, bool success, FVector outPos, FLatentActionInfo LatentInfo);
	bool GetRandomReachablePointAtApproximateDistance(FVector Origin, float Distance, FVector outPos);
	FVector GetPathForwardDirection();
	enum class DeepPathFinderType GetPathfinderType();
	enum class DeepPathFinderSize GetPathfinderSize();
	enum class EDeepMovementState GetMovementState();
	bool GetIsStrafing();
	float GetHorizontalAngleSpeed();
	UFakeMoverSettings* GetCurrentFakePhysicsMoveSet();
	bool FlyToConnectedPosition(FVector destPos);
	bool FindPointKeepingDistance(FVector Origin, float MinDistance, float MaxDistance, FVector Target, float idealTargetDistance, FVector outPos);
	FVector FindPathfinderPointAbove(FVector Pos, float HeightOffset);
	FVector FindPathfinderOffsetPoint(FVector Pos, enum class EOffsetFrom offsetFrom, float HeightOffset);
	FVector FindNearestPathfinderPointOverrideType(FVector Pos, enum class DeepPathFinderType overrideType, float MaxDistance);
	void FindNearestPathfinderPoint_Async(FVector Pos, float MaxDistance, bool success, FVector outPos, FLatentActionInfo LatentInfo);
	FVector FindNearestPathfinderPoint(FVector Pos, float MaxDistance);
	FVector FindNearestConnectedPathfinderPoint(FVector Pos, float MaxDistance);
	FQuat CalcPathfinderOrientation(FVector Pos, FVector forwardDir);
	bool BackOffFrom(FVector dangerPos, float Distance);
	void AddFakeMoverImpulse(FVector Impulse);
};

// Class FSD.DefenseEvent
// Size: 0x370 (Inherited: 0x358)
struct ADefenseEvent : AGameEvent {
	float DefendDuration; // 0x358(0x04)
	UWidget* DefendWidget; // 0x360(0x08)
	float Progress; // 0x368(0x04)

	void OnRep_Progress(float OldValue);
};

// Class FSD.DefensePointActor
// Size: 0x260 (Inherited: 0x220)
struct ADefensePointActor : AActor {
	AGameEvent* DefenseEvent; // 0x240(0x08)
	AGameEvent* ActiveDefenceEvent; // 0x248(0x08)
	enum class EDefendPointState DefendState; // 0x250(0x01)
	USingleUsableComponent* DefendPointUsable; // 0x258(0x08)

	void SetState(enum class EDefendPointState State);
	void OnRep_DefendState();
	void OnDefensePointActivated(APlayerCharacter* Player);
	void DefenseStart();
	void DefenseFail();
	void DefenseComplete();
};

// Class FSD.DefenseObjective
// Size: 0x180 (Inherited: 0x150)
struct UDefenseObjective : UObjective {
	int32_t DefensePoints; // 0x150(0x04)
	int32_t PointsDefended; // 0x154(0x04)
	TArray<TSoftClassPtr<UObject>> ObjectiveDefenseClasses; // 0x158(0x10)
	TArray<ADefensePointActor*> ActiveObjectiveDefenseActors; // 0x168(0x10)
	UDebrisPositioning* DebrisPositioning; // 0x178(0x08)

	void PointDefended();
	void OnRep_PointsRepaired();
	void OnDefensePointsSpawned();
};

// Class FSD.DetPack
// Size: 0x288 (Inherited: 0x220)
struct ADetPack : AActor {
	float UpgradedStaggerChance; // 0x240(0x04)
	float UpgradedStaggerDuration; // 0x244(0x04)
	float UpgradedFearFactor; // 0x248(0x04)
	float VisualDamageRadius; // 0x24c(0x04)
	float IncreasedFearRadius; // 0x250(0x04)
	float IncreasedStaggerRadius; // 0x254(0x04)
	UProjectileMovementComponent* Movement; // 0x258(0x08)
	UExplosionComponent* Explosion; // 0x260(0x08)
	USingleUsableComponent* UseComp; // 0x268(0x08)
	USimpleHealthComponent* SimpleHealth; // 0x270(0x08)
	ADetPackItem* Detonator; // 0x278(0x08)
	bool HasExploded; // 0x280(0x01)
	bool IsMoving; // 0x281(0x01)
	bool ExplodesOnDeath; // 0x282(0x01)
	bool HasExtraStaggerRadius; // 0x283(0x01)
	bool HasExtraFearRadius; // 0x284(0x01)

	void UseFearStaggerUpgrades();
	void RecieveHitObject();
	void OnRep_IsMoving();
	void OnRep_HasExploded();
	void OnExploded();
	void OnDetPackPickedUp(APlayerCharacter* User);
	void OnDetPackDeath(UHealthComponentBase* HealthComponent);
};

// Class FSD.DetPackItem
// Size: 0x440 (Inherited: 0x368)
struct ADetPackItem : AAnimatedItem {
	ADetPack* DetPackClass; // 0x378(0x08)
	AItem* LoadoutProxy; // 0x380(0x08)
	UAnimMontage* FPThrowMontage; // 0x388(0x08)
	UAnimMontage* TPThrowMontage; // 0x390(0x08)
	UAnimMontage* FP_DetonateAnim; // 0x398(0x08)
	UAnimMontage* WPN_DetonateAnim; // 0x3a0(0x08)
	UAnimMontage* FP_EquipDetonatorAnimation; // 0x3a8(0x08)
	UAnimMontage* WPN_EquipDetonatorAnimation; // 0x3b0(0x08)
	USkeletalMeshComponent* DetonatorFPMesh; // 0x3b8(0x08)
	USkeletalMeshComponent* DetonatorTPMesh; // 0x3c0(0x08)
	UForceFeedbackEffect* DetonatorTriggerForceFeedback; // 0x3c8(0x08)
	UCapacityHoldingItemAggregator* Capacity; // 0x3d0(0x08)
	float SupplyStatusWeight; // 0x3d8(0x04)
	float ThrowVelocity; // 0x3dc(0x04)
	float EnheiritOwnerVelocityScale; // 0x3e0(0x04)
	float ThrowAngle; // 0x3e4(0x04)
	float CooldownAfterThrow; // 0x3e8(0x04)
	float CooldownAfterDetonation; // 0x3ec(0x04)
	float ThrowDelay; // 0x3f0(0x04)
	float ThrowZOffset; // 0x3f4(0x04)
	UDialogDataAsset* ShoutDetPackPlaced; // 0x3f8(0x08)
	UDialogDataAsset* ShoutOutOfAmmo; // 0x400(0x08)
	float CooldownLeft; // 0x40c(0x04)
	TArray<ADetPack*> ThrownPacks; // 0x410(0x10)
	TArray<UItemUpgrade*> DetPackUpgrades; // 0x420(0x10)
	bool IsDetonatorOut; // 0x43a(0x01)
	bool HasThrownPack; // 0x43b(0x01)

	void Simulate_ThrowGrenade();
	void Server_ThrowGrenade();
	void Server_Detonate();
	void Server_CycleItem();
	void Receive_OnRep_IsDetonatorOut();
	void OnRep_IsDetonatorOut();
	void OnDetonatingFinished();
	int32_t GetCurrentGrenades();
};

// Class FSD.DialogDataAsset
// Size: 0x60 (Inherited: 0x30)
struct UDialogDataAsset : UDataAsset {
	bool Enabled; // 0x30(0x01)
	bool AudioOnly; // 0x31(0x01)
	float ShoutDelay; // 0x34(0x04)
	float ShoutCoolDown; // 0x38(0x04)
	float ShoutChance; // 0x3c(0x04)
	TArray<FDialogStruct> Entries; // 0x40(0x10)
	TArray<int32_t> ShuffledIndices; // 0x50(0x10)

	int32_t SelectIndex(UObject* WorldContext);
	bool SelectEntry(UObject* WorldContext, FDialogStruct Dialog);
	FDialogStruct GetShout(int32_t Index);
};

// Class FSD.DifficultyManager
// Size: 0xe0 (Inherited: 0xb0)
struct UDifficultyManager : UActorComponent {
	int32_t ForcedPlayerCount; // 0xc8(0x04)
	AFSDGameMode* GameMode; // 0xd0(0x08)
	AFSDGameState* GameState; // 0xd8(0x08)

	UDifficultySetting* SelectDifficulty(int32_t Index);
	float GetSmallEnemyDamageResistance();
	float GetPointExtractionScaler();
	float GetExtraLargeEnemyDamageResistanceD();
	float GetExtraLargeEnemyDamageResistanceC();
	float GetExtraLargeEnemyDamageResistanceB();
	float GetExtraLargeEnemyDamageResistance();
	float GetEnemyDamageResistance();
	float GetEnemyDamageModifier();
	float GetEnemyCountModifier();
	UDifficultySetting* GetCurrentDifficulty();
	float GetBossDifficultyScaler();
};

// Class FSD.DifficultySetting
// Size: 0x230 (Inherited: 0x58)
struct UDifficultySetting : USavableDataAsset {
	FText DifficultyName; // 0x58(0x18)
	FText ShortDifficultyName; // 0x70(0x18)
	FText UnlockRequirementDescription; // 0x88(0x18)
	UCampaign* CampaignRequirement; // 0xa0(0x08)
	float EnvironmentalDamageModifier; // 0xa8(0x04)
	TArray<float> ExtraLargeEnemyDamageResistance; // 0xb0(0x10)
	TArray<float> ExtraLargeEnemyDamageResistanceB; // 0xc0(0x10)
	TArray<float> ExtraLargeEnemyDamageResistanceC; // 0xd0(0x10)
	TArray<float> ExtraLargeEnemyDamageResistanceD; // 0xe0(0x10)
	TArray<float> EnemyDamageResistance; // 0xf0(0x10)
	TArray<float> SmallEnemyDamageResistance; // 0x100(0x10)
	TArray<float> EnemyDamageModifier; // 0x110(0x10)
	TArray<float> EnemyCountModifier; // 0x120(0x10)
	float BossDifficultyScaler; // 0x130(0x04)
	float PointExtractionScaler; // 0x134(0x04)
	FRandInterval EncounterDifficulty; // 0x138(0x10)
	FRandInterval StationaryDifficulty; // 0x148(0x10)
	float SpecialEncounterModifier; // 0x158(0x04)
	float HazardBonus; // 0x15c(0x04)
	float friendlyFireModifier; // 0x160(0x04)
	FRandInterval EnemyWaveInterval; // 0x168(0x10)
	FRandInterval EnemyNormalWaveInterval; // 0x178(0x10)
	FRandInterval EnemyNormalWaveDifficulty; // 0x188(0x10)
	float WaveStartDelayScale; // 0x198(0x04)
	FRandInterval EnemyDiversity; // 0x1a0(0x10)
	FRandInterval StationaryEnemyDiversity; // 0x1b0(0x10)
	FIRandRange DisruptiveEnemyPoolCount; // 0x1c0(0x08)
	int32_t MinPoolSize; // 0x1c8(0x04)
	FVeteranComposition Veterans; // 0x1d0(0x20)
	float SpeedModifier; // 0x1f0(0x04)
	float AttackCooldownModifier; // 0x1f4(0x04)
	float ProjectileSpeedModifier; // 0x1f8(0x04)
	int32_t DifficultyGroup; // 0x1fc(0x04)
	int32_t DifficultyGroupIndex; // 0x200(0x04)
	TArray<UMissionStat*> MissionCompletedStats; // 0x208(0x10)
	bool UseSharedHealthPool; // 0x218(0x01)
	float HeathRegenerationMax; // 0x21c(0x04)
	float ReviveHealthRatio; // 0x220(0x04)
	float EliteChanceModifier; // 0x224(0x04)
	float EliteCooldown; // 0x228(0x04)
	int32_t MaxActiveElites; // 0x22c(0x04)

	bool IsUnlocked(UObject* WorldContext);
	float AddHazardBonus(float BaseValue);
};

// Class FSD.DiscordWrapper
// Size: 0x1f0 (Inherited: 0x28)
struct UDiscordWrapper : UObject {
	FDiscordServerInviteData ServerInfo; // 0x38(0x78)
	FMulticastInlineDelegate OnResponseSuccessChanged; // 0xb0(0x10)
	bool LastResponseSuccessful; // 0xc0(0x01)
	FMulticastInlineDelegate OnDiscordEoMDataEvent; // 0xc8(0x10)
	bool UserIn; // 0x108(0x01)
	FDiscordRewardNotification rewardNotification; // 0x110(0x40)
	int32_t UserInStatus; // 0x150(0x04)
	bool HasEoM; // 0x154(0x01)
	FDiscordEoMData EoMData; // 0x158(0x20)
	bool IsConnected; // 0x178(0x01)
	bool ServerInfoLoaded; // 0x17a(0x01)
	FMulticastInlineDelegate OnDiscordServerInfoLoaded; // 0x180(0x10)
	FMulticastInlineDelegate OnDiscordServerCountLoaded; // 0x190(0x10)
	FMulticastInlineDelegate OnDiscordUserInServer; // 0x1a0(0x10)

	void RequestUserInServer();
	void RequestFactionAdjustment(int32_t Faction, bool force);
	void RequestEoMData();
	void RequestDiscordServerInfo();
	void RejectInviteSignature();
	void IgnoreInviteSignature();
	FString GetAvatarURL();
	void AdjustFaction();
	void AcceptInviteSignature();
};

// Class FSD.MULE
// Size: 0x390 (Inherited: 0x378)
struct AMULE : ADeepPathfinderCharacter {
	UHealthComponent* HealthComponent; // 0x378(0x08)
	USimpleObjectInfoComponent* ObjectInfo; // 0x380(0x08)
	bool IsDown; // 0x388(0x01)

	void SetIsDown(bool IsDown);
	void SetControlledByDropShip(bool Control);
	void OnRep_IsDown();
};

// Class FSD.DonkeyCharacter
// Size: 0x3b0 (Inherited: 0x390)
struct ADonkeyCharacter : AMULE {
	UResourceBank* ResourceBank; // 0x390(0x08)
	UOutlineComponent* OutlineComponent; // 0x398(0x08)
	FMulticastInlineDelegate OnReachedDropShip; // 0x3a0(0x10)

	void SetOpenForDeposit(bool Open);
	void SetGotoDropShip(FVector Location);
	void EnableButton();
};

// Class FSD.RepairableComponent
// Size: 0xf0 (Inherited: 0xb0)
struct URepairableComponent : UActorComponent {
	FMulticastInlineDelegate OnFullyRepairedEvent; // 0xb0(0x10)
	FMulticastInlineDelegate OnAllResourcesAquiredEvent; // 0xc0(0x10)
	FMulticastInlineDelegate OnRepairedEvent; // 0xd0(0x10)
	UGemResourceData* RequiresCarriedResource; // 0xe0(0x08)
	int32_t ResourcesRequired; // 0xe8(0x04)
	bool IsFullyRepaired; // 0xec(0x01)

	bool TryRepair(APlayerCharacter* User);
	void OnRep_ResourcesRequired();
	int32_t GetResourcesRequired();
	void Cheat_Repair();
};

// Class FSD.MiniMule
// Size: 0x3a0 (Inherited: 0x390)
struct AMiniMule : AMULE {
	TArray<AGem*> LostLegs; // 0x390(0x10)

	void SetLegsVisibleOnScanner();
	void OnLegsSetVisible();
	TArray<AGem*> FindLegsInLevelSortedByDistance();
};

// Class FSD.DoubleDrillAggregator
// Size: 0x148 (Inherited: 0x140)
struct UDoubleDrillAggregator : UCapacityBasedItemAggregator {
};

// Class FSD.DualAnimatedItem
// Size: 0x370 (Inherited: 0x318)
struct ADualAnimatedItem : AItem {
	UAnimInstance* FPAnimInstance; // 0x318(0x08)
	UPlayerAnimInstance* TPAnimInstance; // 0x320(0x08)
	USkeletalMeshComponent* FPRMesh; // 0x328(0x08)
	USkeletalMeshComponent* FPLMesh; // 0x330(0x08)
	USkeletalMeshComponent* TPRMesh; // 0x338(0x08)
	USkeletalMeshComponent* TPLMesh; // 0x340(0x08)
	UAnimMontage* FP_EquipAnimation; // 0x348(0x08)
	UAnimMontage* TP_EquipAnimation; // 0x350(0x08)
	float EquipDuration; // 0x358(0x04)
	UItemCharacterAnimationSet* CharacterAnimationSet; // 0x360(0x08)

	USkeletalMeshComponent* GetRItemMesh();
	USkeletalMeshComponent* GetLItemMesh();
};

// Class FSD.DoubleDrillItem
// Size: 0x4a8 (Inherited: 0x370)
struct ADoubleDrillItem : ADualAnimatedItem {
	UFirstPersonParticleSystemComponent* FP_Left_DrillParticles; // 0x388(0x08)
	UFirstPersonParticleSystemComponent* FP_Right_DrillParticles; // 0x390(0x08)
	UDamageComponent* DamageComponent; // 0x398(0x08)
	UAudioComponent* AudioComponent; // 0x3a0(0x08)
	UDoubleDrillAggregator* Aggregator; // 0x3a8(0x08)
	UAnimMontage* FPMineMontage; // 0x3b0(0x08)
	UAnimMontage* TPMineMontage; // 0x3b8(0x08)
	UAnimMontage* FPOverheat; // 0x3c0(0x08)
	UAnimMontage* TPOverheat; // 0x3c8(0x08)
	UAnimMontage* FPGunsling; // 0x3d0(0x08)
	UAnimMontage* TPGunsling; // 0x3d8(0x08)
	FName MiningSpeedAudioParamterName; // 0x3e0(0x08)
	UParticleSystem* DrillParticles; // 0x3e8(0x08)
	UForceFeedbackEffect* DrillRumble; // 0x3f0(0x08)
	float BlockParticlesScaleFP; // 0x3f8(0x04)
	float BlockParticlesScaleTP; // 0x3fc(0x04)
	enum class EDoubleDrillState State; // 0x400(0x01)
	float MovementPenalty; // 0x404(0x04)
	float MiningRate; // 0x408(0x04)
	float HeatReductionPerKill; // 0x40c(0x04)
	FVector CarveSize; // 0x410(0x0c)
	float CarveNoise; // 0x41c(0x04)
	float CarverRayCastLength; // 0x420(0x04)
	float CarveTerrainDistanceCheck; // 0x424(0x04)
	float TimeToNextMine; // 0x428(0x04)
	float CurrentDrillSpeed; // 0x42c(0x04)
	float DamageDistance; // 0x430(0x04)
	float DamageRadius; // 0x434(0x04)
	float FriendlyDamageRadius; // 0x438(0x04)
	float DamageRate; // 0x43c(0x04)
	float Damage; // 0x440(0x04)
	float ArmorDamageMultiplier; // 0x444(0x04)
	UDamageClass* DamageClass; // 0x448(0x08)
	float friendlyFireModifier; // 0x450(0x04)
	float MaxFuel; // 0x454(0x04)
	float Fuel; // 0x458(0x04)
	float FuelUsePerDig; // 0x45c(0x04)
	float FuelUsePerMelee; // 0x460(0x04)
	float SupplyStatusWeight; // 0x464(0x04)
	UDialogDataAsset* ShoutOutOfFuel; // 0x468(0x08)
	TArray<FHitResult> HitCache; // 0x470(0x10)
	TArray<FDoubleDrillDamageItem> DamageCache; // 0x480(0x10)
	float DrillParticlesDuration; // 0x4a0(0x04)
	bool IsMining; // 0x4a4(0x01)
	bool IsGunslinging; // 0x4a5(0x01)

	void Server_StopMining();
	void Server_StartMining();
	void Server_DoDamage(TArray<FDoubleDrillDamageItem> Targets);
	void Server_DigBlock(FVector_NetQuantize Start, FVector_NetQuantize End);
	void OnTargetKilled(AActor* Target, UFSDPhysicalMaterial* PhysMat);
	void OnStopDrilling();
	void OnStartDrilling();
	void OnRep_SimulatingMining();
	void OnRep_IsGunslinging();
	void OnDrillParticlesTimerElapsed();
	void Client_Resupply(float percentage);
	void BP_OnDrillDamage();
	void All_SimulateDigDebris(FVector_NetQuantize Position, int32_t DebrisIndex);
	void All_SimulateDigBlock(FVector_NetQuantize Position, bool spawnParticles, int32_t Material);
	void All_SimulateDamage(TArray<FDoubleDrillDamageItem> Targets);
};

// Class FSD.DoubleDrillAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UDoubleDrillAnimInstance : UAnimInstance {
	float DrillSpeed; // 0x268(0x04)
	bool IsMining; // 0x26c(0x01)
	bool IsGunslinging; // 0x26d(0x01)
	ADoubleDrillItem* Item; // 0x270(0x08)
};

// Class FSD.DownedStateComponent
// Size: 0x140 (Inherited: 0xf8)
struct UDownedStateComponent : UCharacterStateComponent {
	FDeathIntroSettings Intro; // 0xf8(0x24)
	float DownedHealthLossPerSecond; // 0x11c(0x04)
	float TerrainRemovedFallThreshold; // 0x120(0x04)
	bool DownedBombActive; // 0x124(0x01)
	UDamageComponent* DownedBombDamage; // 0x128(0x08)
	FMulticastInlineDelegate OnEnableDownedBombUIEvent; // 0x130(0x10)

	void TriggerDownedBombDamage();
	void Server_TriggerDownedBomb();
	void Receive_TriggerDownedBomb();
	UDamageComponent* CreateDownedBombDamage(UDamageComponent* DamageClass);
};

// Class FSD.DrinkableActor
// Size: 0x228 (Inherited: 0x220)
struct ADrinkableActor : AActor {
	UDrinkableDataAsset* DrinkableData; // 0x220(0x08)

	void Pickup(APlayerCharacter* byCharacter);
	void OnRep_DrinkableData();
	void Fill();
};

// Class FSD.DrinkableDataAsset
// Size: 0x218 (Inherited: 0x58)
struct UDrinkableDataAsset : USavableDataAsset {
	FText DrinkableName; // 0x58(0x18)
	FText DrinkableDescription; // 0x70(0x18)
	int32_t DrinkablePrice; // 0x88(0x04)
	TSoftObjectPtr<UTexture2D> DrinkableIcon; // 0x90(0x28)
	int32_t RequiredPlayerRank; // 0xb8(0x04)
	bool ParticipatesInFreeBeerEvent; // 0xbc(0x01)
	enum class EDrinkableAlcoholStrength AlcoholStrength; // 0xbd(0x01)
	UDrinkableDataAsset* SupporterEdition; // 0xc0(0x08)
	bool bPlayFireworks; // 0xc8(0x01)
	UMissionStat* StatConsumed; // 0xd0(0x08)
	UMissionStat* StatRoundOrdered; // 0xd8(0x08)
	TSoftClassPtr<UObject> DrinkableActorClass; // 0xe0(0x28)
	TSoftClassPtr<UObject> DrinkableItemClass; // 0x108(0x28)
	UDialogDataAsset* OrderShout; // 0x130(0x08)
	UDialogDataAsset* OrderCheeringShout; // 0x138(0x08)
	UDialogDataAsset* DrinkSaluteShout; // 0x140(0x08)
	UTemporaryBuff* buff; // 0x148(0x08)
	TSoftClassPtr<UObject> DrinkEffect; // 0x150(0x28)
	TMap<UResourceData*, int32_t> UnlockCost; // 0x178(0x50)
	TMap<UResourceData*, int32_t> PurchaseCost; // 0x1c8(0x50)

	bool TryUnlockSpecialDrinks(UObject* WorldContext);
	bool TryUnlockDrink(UObject* WorldContext);
	bool TryPurchaseDrink(UObject* WorldContext);
	void OnRoundOrdered(APlayerCharacter* Character);
	bool MustBeUnlocked();
	bool IsUnlocked(UObject* WorldContext);
	bool IsDrinkFree(UObject* WorldContext);
	bool HasSupporterEdition();
	UTexture2D* GetDrinkableIcon();
	UDrinkableDataAsset* GetDrinkableEdition(UObject* WorldContext, APlayerController* Player);
	bool AreSpecialDrinksUnlocked(UObject* WorldContext);
};

// Class FSD.DrinkEffectComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UDrinkEffectComponent : UActorComponent {
	float BeerEffectDurationSeconds; // 0xb8(0x04)
	bool AutoDestroy; // 0xbc(0x01)
	bool EffectIsActive; // 0xbd(0x01)

	void StopEffect();
	void OnStopEffect();
	void OnStartEffect(APlayerCharacter* Character);
	void OnChangedCharacter(APlayerCharacter* changedToCharacter, UObject* DrinkEffectClass);
};

// Class FSD.DrinkableItem
// Size: 0x370 (Inherited: 0x368)
struct ADrinkableItem : AAnimatedItem {
	UDrinkableDataAsset* DrinkableData; // 0x368(0x08)

	void OnRep_DrinkableData();
	void Consume();
	void ClientConsumed();
	bool CheckCanSalute();
};

// Class FSD.DrinkSettings
// Size: 0xb0 (Inherited: 0x30)
struct UDrinkSettings : UDataAsset {
	TArray<FBarleySpawnItem> BarleySpawns; // 0x30(0x10)
	FRandInterval BarleyAmount; // 0x40(0x10)
	TMap<UResourceData*, int32_t> SpecialBeerUnlockCost; // 0x50(0x50)
	TArray<UDrinkableDataAsset*> Drinkables; // 0xa0(0x10)

	TArray<UDrinkableDataAsset*> GetBarDrinkables(UObject* WorldContext, bool IncludeDailySpecial, bool includeNotUnlocked, bool includePlayerRankTooLow);
	UDrinkableDataAsset* GetBarDailySpecial(UObject* WorldContext);
};

// Class FSD.DroneAbillityStatsComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UDroneAbillityStatsComponent : UActorComponent {
	bool UseOwnArmorDamageMultiplier; // 0xb0(0x01)
};

// Class FSD.DroneCharacter
// Size: 0x390 (Inherited: 0x378)
struct ADroneCharacter : ADeepPathfinderCharacter {
	UHealthComponent* HealthComponent; // 0x378(0x08)
	UOutlineComponent* OutlineComponent; // 0x380(0x08)
	USimpleObjectInfoComponent* ObjectInfo; // 0x388(0x08)
};

// Class FSD.DroneDisplayActionComponent
// Size: 0x200 (Inherited: 0x1f0)
struct UDroneDisplayActionComponent : USceneComponent {
	UTextRenderComponent* DisplayText; // 0x1f0(0x08)

	void SetMode(enum class EDroneActions droneAction);
};

// Class FSD.DroneFlame
// Size: 0x268 (Inherited: 0x220)
struct ADroneFlame : AActor {
	UParticleSystemComponent* FlameParticles; // 0x220(0x08)
	UDamageComponent* Damage; // 0x228(0x08)
	TArray<FName> FlameParameterNames; // 0x238(0x10)
	UStatusEffect* OnFireStatusEffect; // 0x248(0x08)
	float DamageTickRate; // 0x250(0x04)
	float Duration; // 0x258(0x04)
	float FlameDiameter; // 0x25c(0x04)
	float Range; // 0x260(0x04)
};

// Class FSD.DroneMiningToolBase
// Size: 0xe8 (Inherited: 0xb0)
struct UDroneMiningToolBase : UActorComponent {
	FMulticastInlineDelegate HitSomething; // 0xb0(0x10)
	float Range; // 0xd0(0x04)
	float SameHitDistance; // 0xd4(0x04)
	float MineRadius; // 0xd8(0x04)
	int32_t MineStrength; // 0xdc(0x04)

	void StopMining();
	void StartMining();
	void SpawnEffects(UTerrainMaterial* aTerrainMaterial, bool aParialHit, FVector_NetQuantize aLocation, FVector_NetQuantize aImpactNormal);
};

// Class FSD.DroneUseComponent
// Size: 0x120 (Inherited: 0xb0)
struct UDroneUseComponent : UActorComponent {
	FMulticastInlineDelegate OnUsed; // 0xb0(0x10)
	FMulticastInlineDelegate OnBeginUse; // 0xc0(0x10)
	FMulticastInlineDelegate OnStopUse; // 0xd0(0x10)
	FMulticastInlineDelegate OnProgress; // 0xe0(0x10)
	UDialogDataAsset* BoscoLaserpointerShout; // 0xf0(0x08)
	TWeakObjectPtr<USingleUsableComponent> SyncToUsable; // 0x104(0x08)
	float Progress; // 0x10c(0x04)
	float useDuration; // 0x110(0x04)
	bool ResetOnFail; // 0x11c(0x01)
	bool canUse; // 0x11d(0x01)

	void SyncedUsableUserCountChangedResponse(int32_t userCount);
	void SyncedUsableUsedResponse(APlayerCharacter* User);
	void SyncedUsableBeginUseResponse(APlayerCharacter* User);
	void SetUseDuration(float useDuration);
	void SetCanUse(bool canUse);
	float GetProgress();
	void EndUse();
	void BeginUse();
};

// Class FSD.DropPod
// Size: 0x290 (Inherited: 0x220)
struct ADropPod : AActor {
	float DropHeight; // 0x220(0x04)
	FVector TargetLocation; // 0x224(0x0c)
	UAutoCarverComponent* AutoCarver; // 0x230(0x08)
	UCurveFloat* DepartCurve; // 0x238(0x08)
	float CarverRotationSpeed; // 0x240(0x04)
	FVector CarverScale; // 0x244(0x0c)
	float DepartureTime; // 0x250(0x04)
	FVector StartLocation; // 0x258(0x0c)
	enum class EDropPodState State; // 0x264(0x01)
	float DrillSpeed; // 0x26c(0x04)
	float FreeFallAcceleration; // 0x270(0x04)
	float FreeFallSpeed; // 0x274(0x04)

	void StartDrilling();
	void PrepForTakeOff();
	void OnRep_State();
	void OnPrepForTakeOff();
	void OnDroppodImpact();
	void OnDrillingStarted();
	void OnDeparting();
	ADropPod* DropToMission(UObject* WorldContextObject, ADropPod* podClass, FVector Location);
	void Depart();
};

// Class FSD.FSDMiningHead
// Size: 0x298 (Inherited: 0x290)
struct AFSDMiningHead : ADropPod {
	UResourceBank* ResourceBank; // 0x290(0x08)
};

// Class FSD.DropToTerrainComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UDropToTerrainComponent : UActorComponent {
	float FallVelocity; // 0xbc(0x04)
	float TerrainTraceMaxDistance; // 0xc0(0x04)
	FMulticastInlineDelegate OnFallToTerrainStateChanged; // 0xc8(0x10)
	FVector CurrentLocation; // 0xd8(0x0c)
	FVector DropTarget; // 0xe4(0x0c)
	bool IsDetecting; // 0xf0(0x01)

	void StopDropDetection(bool stopFalling);
	void SetParentPositionOnAll(FVector CurrentParentLocation);
	void OnTerrainRemoved();
	void BeginDropDetection();
};

// Class FSD.DualWieldWeapon
// Size: 0x6c8 (Inherited: 0x690)
struct ADualWieldWeapon : AAmmoDrivenWeapon {
	UFirstPersonSkeletalMeshComponent* FPMeshLeft; // 0x698(0x08)
	USkeletalMeshComponent* TPMeshLeft; // 0x6a0(0x08)
	UAnimMontage* WPN_Left_Reload; // 0x6a8(0x08)
	UAnimMontage* WPN_Left_TP_Reload; // 0x6b0(0x08)
	UFXSystemAsset* CasingParticlesLeft; // 0x6b8(0x08)
	FName MuzzleLeft; // 0x6c0(0x08)
};

// Class FSD.DualWieldAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UDualWieldAnimInstance : UAnimInstance {
};

// Class FSD.DualMachinePistols
// Size: 0x6d8 (Inherited: 0x6c8)
struct ADualMachinePistols : ADualWieldWeapon {
	UStatusEffect* EmptyClipStatusEffect; // 0x6c8(0x08)

	void Server_TriggerStatusEffect();
};

// Class FSD.DynamicReverbComponent
// Size: 0x100 (Inherited: 0xb0)
struct UDynamicReverbComponent : UActorComponent {
	float LargeCaveValue; // 0xb0(0x04)
	float MediumCaveValue; // 0xb4(0x04)
	float SmallCaveValue; // 0xb8(0x04)
	float FadeTime; // 0xbc(0x04)
	float Priority; // 0xc0(0x04)

	void TimerTriggered();
};

// Class FSD.ElectroBeam
// Size: 0x2b8 (Inherited: 0x220)
struct AElectroBeam : AActor {
	UCapsuleComponent* Collider; // 0x220(0x08)
	TArray<AActor*> ParentPlants; // 0x228(0x10)
	FVector LocationOffset; // 0x238(0x0c)
	FVector_NetQuantize SourceLocation; // 0x244(0x0c)
	FVector_NetQuantize TargetLocation; // 0x250(0x0c)
	USceneComponent* DelaySource; // 0x260(0x08)
	USceneComponent* DelayTarget; // 0x268(0x08)
	UParticleSystemComponent* BeamEffect; // 0x270(0x08)
	UAudioComponent* ZappSound; // 0x278(0x08)
	TArray<UStatusEffect*> StatusEffectsToApply; // 0x280(0x10)
	float MaxLitTime; // 0x290(0x04)
	float MinLitTime; // 0x294(0x04)
	float MaxUnlitTime; // 0x298(0x04)
	float MinUnlitTime; // 0x29c(0x04)
	bool ShouldFlicker; // 0x2a0(0x01)
	bool IsLit; // 0x2a1(0x01)

	void SetTarget(USceneComponent* TargetPoint);
	void SetSource(USceneComponent* SourcePoint);
	void SetParents(AActor* firstParent, AActor* secondParent);
	void RecalculateBeam();
	void OnRep_TargetLocation();
	void OnRep_SourceLocation();
	void OnRep_Flag();
	void OnParentTwoDeath(UHealthComponentBase* HealthComponent);
	void OnParentOneDeath(UHealthComponentBase* HealthComponent);
	UParticleSystemComponent* GetParticleEffect();
	UCapsuleComponent* GetCollider();
	UAudioComponent* GetAudio();
	void DelayedSetTarget(USceneComponent* TargetPoint);
	void DelayedSetSource(USceneComponent* SourcePoint);
	void DeactivateCollisionAndEffect();
};

// Class FSD.SentryElectroBeam
// Size: 0x2c8 (Inherited: 0x2b8)
struct ASentryElectroBeam : AElectroBeam {
	TArray<ARedeployableSentryGun*> Sentries; // 0x2b8(0x10)
};

// Class FSD.ElevatorPlant
// Size: 0x2f0 (Inherited: 0x220)
struct AElevatorPlant : AActor {
	FMulticastInlineDelegate OnStartTimelineEvent; // 0x220(0x10)
	FMulticastInlineDelegate COnStateChangedEvent; // 0x230(0x10)
	UAudioComponent* MovingSoundComponent; // 0x240(0x08)
	USoundCue* GrabSound; // 0x248(0x08)
	FVector RestPositionOffset; // 0x250(0x0c)
	FVector RelativeRestLocation; // 0x25c(0x0c)
	FVector RelativeDestinationLocation; // 0x268(0x0c)
	FVector BaseTangentDirectionOffset; // 0x274(0x0c)
	FVector LeafTangentDirectionOffset; // 0x280(0x0c)
	FVector LeafLocationNoise; // 0x28c(0x0c)
	FRotator LeafNoiseRotator; // 0x298(0x0c)
	float BaseTangentLength; // 0x2a4(0x04)
	USplineMeshComponent* CSplineMesh; // 0x2a8(0x08)
	USceneComponent* CVineBase; // 0x2b0(0x08)
	USceneComponent* CVineLeaf; // 0x2b8(0x08)
	float InitialBaseTangentLength; // 0x2d0(0x04)
	float LeafLocationNoiseSize; // 0x2d4(0x04)
	float VineMovementAlpha; // 0x2d8(0x04)
	bool IsMoving; // 0x2dc(0x01)
	bool IsOpen; // 0x2dd(0x01)
	bool Extend; // 0x2de(0x01)
	UCurveFloat* DipOffsetCurve; // 0x2e0(0x08)
	UCurveFloat* LocationLerpCurve; // 0x2e8(0x08)

	void SetLeafNoiseRotator(FRotator aRotator);
	void SetLeafLocationNoise(FVector aVector);
	void SetIsOpen(bool aValue);
	void SetIsExtended(bool aValue);
	void SetBaseTangentLength(float Value);
	void SetBaseTangentDirectionOffset(FVector aVector);
	void OnRep_RelavtiveDestinationLocation();
	void OnRep_Open();
	void OnMatchStarted();
	void MoreTick(FVector DipOffset, float aValue);
	float GetVineMovementAlpha();
	FVector GetRelativeRestLocation();
	FVector GetRelativeDestinationLocation();
	float GetLeafLocationNoiseSize();
	bool GetIsMoving();
	bool GetIsExtended();
	float GetInitialTangentLenth();
};

// Class FSD.EliminationObjective
// Size: 0x1f0 (Inherited: 0x150)
struct UEliminationObjective : UObjective {
	int32_t ObjectCount; // 0x150(0x04)
	UDebrisPositioning* Positioning; // 0x158(0x08)
	TArray<int32_t> ExcludeRoomIDs; // 0x160(0x10)
	TSoftClassPtr<UObject> ObjectToSpawn; // 0x170(0x28)
	UCaveInfluencer* CaveInfluencer; // 0x198(0x08)
	float DebrisRadius; // 0x1a0(0x04)
	TArray<UDebrisBase*> ObjectDebris; // 0x1a8(0x10)
	int32_t EnemiesKilled; // 0x1b8(0x04)
	int32_t EnemiesToKill; // 0x1bc(0x04)
	TArray<FEliminationDescriptors> TargetDescriptors; // 0x1c0(0x10)
	TArray<FEliminationDescriptors> TargetQueue; // 0x1d0(0x10)
	TArray<FEliminationTarget> ActiveEliminationTargets; // 0x1e0(0x10)

	void RegisterEliminationTargets(TArray<AFSDPawn*> Targets);
	void ReceiveTargetSpawned();
	void ReceiveTargetKilled();
	void OnTargetKilled(UHealthComponentBase* Health);
	void OnRep_EnemiesToKill(int32_t prevAmount);
	void OnRep_EnemiesKilled(int32_t prevAmount);
	TArray<UEnemyDescriptor*> GetNextTargetInQueue();
};

// Class FSD.EncounterActor
// Size: 0x220 (Inherited: 0x220)
struct AEncounterActor : AActor {

	void Receive_EncounterHasSpawned(APawn* spawnedPawn);
};

// Class FSD.EncounterManager
// Size: 0x110 (Inherited: 0xb0)
struct UEncounterManager : UActorComponent {
	float SpawnDistanceFromRoomBounds; // 0xb0(0x04)
	TArray<FEncounterManagerItem> Encounters; // 0xb8(0x10)
	AProceduralSetup* ProceduralSetup; // 0xc8(0x08)
	UEnemySpawnManager* SpawnManager; // 0xd0(0x08)
	TArray<UEnemyDescriptor*> EnemyPool; // 0xd8(0x10)
	TArray<UEnemyDescriptor*> EncounterPool; // 0xe8(0x10)
	TArray<UCritterDescriptor*> CritterPool; // 0xf8(0x10)

	void ShowSpawnLocations();
	TArray<UEnemyDescriptor*> GetEnemyPool();
	TArray<UEnemyDescriptor*> GetEncounterPool();
	TArray<UCritterDescriptor*> GetCritterPool();
};

// Class FSD.EncounterSettings
// Size: 0x160 (Inherited: 0x30)
struct UEncounterSettings : UDataAsset {
	FIRandRange StationaryEnemyCount; // 0x30(0x08)
	TArray<UEnemyDescriptor*> CommonEnemies; // 0x38(0x10)
	TArray<UEnemyDescriptor*> SpecialEnemies; // 0x48(0x10)
	TArray<UEnemyDescriptor*> DisruptiveEnemies; // 0x58(0x10)
	TArray<UEnemyDescriptor*> StationaryEnemies; // 0x68(0x10)
	TArray<UCritterDescriptor*> CommonCritters; // 0x78(0x10)
	TArray<FEncounterRareCritterItem> RareCritters; // 0x88(0x10)
	TArray<FEncounterSpecialItem> SpecialEncounters; // 0x98(0x10)
	float RequiredDifficultyPerDiversity; // 0xa8(0x04)
	float GlobalDifficultyScale; // 0xac(0x04)
	FRandInterval EncounterDifficulty; // 0xb0(0x10)
	FRandInterval StationaryDifficulty; // 0xc0(0x10)
	FRandRange CritterSpawnDifficulty; // 0xd0(0x08)
	FGameplayTag SmallRoomTag; // 0xd8(0x08)
	FGameplayTag MediumRoomTag; // 0xe0(0x08)
	FGameplayTag LargeRoomTag; // 0xe8(0x08)
	float SmallRoomDifficultyModifier; // 0xf0(0x04)
	float MediumRoomDifficultyModifier; // 0xf4(0x04)
	float LargeRoomDifficultyModifier; // 0xf8(0x04)
	TMap<UEnemyDescriptor*, FEliteEnemyEntry> HeroEnemies; // 0x100(0x50)
	FRandInterval HeroEnemySpawn; // 0x150(0x10)
};

// Class FSD.EnemyFamily
// Size: 0x50 (Inherited: 0x30)
struct UEnemyFamily : UDataAsset {
	UTexture2D* Icon; // 0x30(0x08)
	FText Name; // 0x38(0x18)
};

// Class FSD.ObjectInfoComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UObjectInfoComponent : UActorComponent {

	UDialogDataAsset* GetLookAtShout(UPrimitiveComponent* TargetComponent);
	bool GetIsPingableByLaserpointer(UPrimitiveComponent* TargetComponent);
	FText GetInGameName(UPrimitiveComponent* TargetComponent);
	UTexture2D* GetInGameIcon(UPrimitiveComponent* TargetComponent);
	FText GetInGameDescription(UPrimitiveComponent* TargetComponent);
	UActorContextWidget* GetContextWidget(APlayerController* InPlayerController);
};

// Class FSD.SimpleObjectInfoComponent
// Size: 0x158 (Inherited: 0xb0)
struct USimpleObjectInfoComponent : UObjectInfoComponent {
	FText InGameName; // 0xb0(0x18)
	FText InGameDescription; // 0xc8(0x18)
	UDialogDataAsset* LookAtShout; // 0xe0(0x08)
	UTexture2D* Icon; // 0xe8(0x08)
	bool bIsPingableByLaserpointer; // 0xf0(0x01)
	UActorContextWidget* ContextWidgetClass; // 0xf8(0x08)
	TMap<TWeakObjectPtr<USceneComponent>, FSimpleObjectInfoData> ComponentMap; // 0x100(0x50)
	UActorContextWidget* ContextWidget; // 0x150(0x08)

	void SetInGameName(FString GameName);
	void SetInGameDescription(FString GameDescription);
	void SetContextWidget(UActorContextWidget* InContextWidget);
	void AddComponentObjectInfo(USceneComponent* TargetComponent, FSimpleObjectInfoData Data);
};

// Class FSD.EnemyComponent
// Size: 0x190 (Inherited: 0x158)
struct UEnemyComponent : USimpleObjectInfoComponent {
	UEnemyFamily* Family; // 0x158(0x08)
	UDialogDataAsset* KillShout; // 0x160(0x08)
	UEnemyID* EnemyID; // 0x168(0x08)
	FString mixerName; // 0x170(0x10)
	FMulticastInlineDelegate OnMixerNameChange; // 0x180(0x10)

	UEnemyID* GetID();
	FText GetFamilyName();
	UTexture2D* GetFamilyIcon();
};

// Class FSD.TestAnimInstance
// Size: 0x990 (Inherited: 0x270)
struct UTestAnimInstance : UAnimInstance {
	FTestAnimInstanceProxy AnimInstanceProxy; // 0x270(0x700)
	float WalkCycleSpeed; // 0x970(0x04)
	float StartMovingSpeed; // 0x974(0x04)
	float StopMovingSpeed; // 0x978(0x04)
	float WalkCycleMinRate; // 0x97c(0x04)
	float MeshScale; // 0x980(0x04)
};

// Class FSD.JellyFishAnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UJellyFishAnimInstance : UEnemyAnimInstance {
	float HorizontalAngle; // 0x2b8(0x04)
	float VerticalSpeed; // 0x2bc(0x04)
};

// Class FSD.GliderBeastAnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct UGliderBeastAnimInstance : UEnemyAnimInstance {
	float SyncAnimLength; // 0x2b8(0x04)
	FGliderAnimSync AnimSync; // 0x2bc(0x20)
	bool IsFrozen; // 0x2dc(0x01)
};

// Class FSD.EnemyAttacker
// Size: 0x28 (Inherited: 0x28)
struct UEnemyAttacker : UInterface {

	float GetAttackDamageModifier();
};

// Class FSD.EnemyControlStateComponent
// Size: 0x270 (Inherited: 0xf8)
struct UEnemyControlStateComponent : UCharacterStateComponent {
	bool UseThirdPersonCam; // 0xf8(0x01)
	FControlEnemyState StateData; // 0x100(0x60)
	enum class EEnemyControlState ControlState; // 0x168(0x01)
	FQuat AngularVelocity; // 0x1a0(0x10)
	FQuat ControlRotation; // 0x1b0(0x10)

	void ServerExit();
	void OnRep_StateData(FControlEnemyState oldState);
	void OnRep_ControlState(enum class EEnemyControlState oldState);
	void OnEnemyCrashMontageEnded(UAnimMontage* Montage, bool interrupted);
	void OnControllingEnemyAttached();
	void OnControllingEnemy(bool IsControlling);
	void JumpPressed();
	UAIPlayerControlComponent* GetAiPlayerControlComponent();
};

// Class FSD.EnemyDescriptor
// Size: 0x218 (Inherited: 0x30)
struct UEnemyDescriptor : UDataAsset {
	UEnemyID* EnemyID; // 0x30(0x08)
	TSoftClassPtr<UObject> EnemyClass; // 0x38(0x28)
	enum class EVeteranScaling VeteranScaling; // 0x60(0x01)
	TArray<UEnemyDescriptor*> VeteranClasses; // 0x68(0x10)
	TMap<UBiome*, TSoftClassPtr<UObject>> BiomeEnemyClassOverrides; // 0x78(0x50)
	TSoftClassPtr<UObject> EliteEnemyClass; // 0xc8(0x28)
	TSet<UMissionTemplate*> BannedMissionTypes; // 0xf0(0x50)
	enum class EEnemySignificance EnemySignificance; // 0x140(0x01)
	FVector SpawnOffset; // 0x144(0x0c)
	bool UsesSpawnEffects; // 0x150(0x01)
	enum class ECreatureSize CreatureSize; // 0x154(0x04)
	UDebrisPositioning* Positioning; // 0x158(0x08)
	int32_t PlacementCategories; // 0x160(0x04)
	UCaveInfluencer* CaveInfluencer; // 0x168(0x08)
	TArray<FEnemyDebris> Debris; // 0x170(0x10)
	float InfluencerRange; // 0x180(0x04)
	AActor* PlacementCarver; // 0x188(0x08)
	enum class DeepPathFinderType PathfinderType; // 0x190(0x01)
	FGameplayTagQuery PlacementRoomQuery; // 0x198(0x48)
	float SpawnSpread; // 0x1e0(0x04)
	int32_t IdealSpawnSize; // 0x1e4(0x04)
	bool CanBeUsedForConstantPressure; // 0x1e8(0x01)
	bool CanBeUsedInEncounters; // 0x1e9(0x01)
	float DifficultyRating; // 0x1ec(0x04)
	int32_t MinSpawnCount; // 0x1f0(0x04)
	int32_t MaxSpawnCount; // 0x1f4(0x04)
	float Rarity; // 0x1f8(0x04)
	float SpawnAmountModifier; // 0x1fc(0x04)
	int32_t RequiredMainCampaignProgress; // 0x200(0x04)
	bool UsesSpawnRarityModifiers; // 0x204(0x01)
	TArray<FSpawnRarityItem> SpawnRarityModifiers; // 0x208(0x10)

	APawn* GetEnemyClass(UBiome* Biome, bool isElite);
};

// Class FSD.BaseCritterDescriptor
// Size: 0xb8 (Inherited: 0x30)
struct UBaseCritterDescriptor : UDataAsset {
	TSoftClassPtr<UObject> CritterClass; // 0x30(0x28)
	TMap<UBiome*, TSoftClassPtr<UObject>> BiomeClassOverrides; // 0x58(0x50)
	UDebrisPositioning* Positioning; // 0xa8(0x08)
	enum class DeepPathFinderType PathfinderType; // 0xb0(0x01)
};

// Class FSD.CritterDescriptor
// Size: 0xd0 (Inherited: 0xb8)
struct UCritterDescriptor : UBaseCritterDescriptor {
	FIRandRange SpawnAmountPerRoom; // 0xb8(0x08)
	float SpawnChancePerRoom; // 0xc0(0x04)
	FIRandRange SpawnAmountPerLevel; // 0xc4(0x08)
};

// Class FSD.RareCritterDescriptor
// Size: 0xc0 (Inherited: 0xb8)
struct URareCritterDescriptor : UBaseCritterDescriptor {
	float Rarity; // 0xb8(0x04)
};

// Class FSD.EnemyMinersManualData
// Size: 0x180 (Inherited: 0x30)
struct UEnemyMinersManualData : UDataAsset {
	UEnemyID* EnemyID; // 0x30(0x08)
	FText Name; // 0x38(0x18)
	FText RichDescription; // 0x50(0x18)
	TArray<FText> GameplayTips; // 0x68(0x10)
	enum class EEnemyFamily Family; // 0x78(0x01)
	enum class EEnemyType EnemyType; // 0x79(0x01)
	TArray<FEnemyAttackDescription> AttackType; // 0x80(0x10)
	TArray<FEnemyAttackDescription> SpecialAttacks; // 0x90(0x10)
	TArray<UAnimSequenceBase*> AttackAnimations; // 0xa0(0x10)
	enum class EArmorType ArmorType; // 0xb0(0x01)
	FText Armor; // 0xb8(0x18)
	FText Weakpoint; // 0xd0(0x18)
	FEnemyMinersManualStats EnemyStats; // 0xe8(0x0c)
	TArray<enum class EDamageType> Resistances; // 0xf8(0x10)
	TArray<enum class EDamageType> Weaknesses; // 0x108(0x10)
	TArray<FText> LoreInfo; // 0x118(0x10)
	bool AlwaysUnlocked; // 0x128(0x01)
	int32_t InfoUnlockSpeed; // 0x12c(0x04)
	TSoftObjectPtr<UTexture2D> EnemyIcon; // 0x130(0x28)
	TSoftClassPtr<UObject> PreviewActor; // 0x158(0x28)

	UTexture2D* GetEnemyIcon();
};

// Class FSD.EnemyDrone
// Size: 0x398 (Inherited: 0x398)
struct AEnemyDrone : AEnemyDeepPathfinderCharacter {
};

// Class FSD.HealthComponentBase
// Size: 0x148 (Inherited: 0xb0)
struct UHealthComponentBase : UActorComponent {
	FMulticastInlineDelegate OnHealthChanged; // 0xb8(0x10)
	FMulticastInlineDelegate OnDamageHealed; // 0xc8(0x10)
	FMulticastInlineDelegate OnDamageTaken; // 0xd8(0x10)
	FMulticastInlineDelegate OnHit; // 0xe8(0x10)
	FMulticastInlineDelegate OnBodypartHit; // 0xf8(0x10)
	FMulticastInlineDelegate OnDeath; // 0x108(0x10)
	FMulticastInlineDelegate OnRadialDamage; // 0x118(0x10)
	FMulticastInlineDelegate OnCanTakeDamageChanged; // 0x128(0x10)
	bool ShowLaserPointMarkerWhenDead; // 0x138(0x01)

	float TakeRadialDamage(float damageAmount, FVector BlastCenter, float BlastRadius, float MaxDamageRadius, float MinDamagePct, AController* EventInstigator, AActor* DamageCauser, UPrimitiveComponent* HitComponent, UDamageClass* DamageClass);
	void TakeDamageSimple(float damageAmount, AActor* DamageCauser, UDamageClass* DamageClass);
	void SetHealthDirectly(float newHealthValue);
	void SetCanTakeDamage(bool canTakeDamage);
	void Kill(AActor* DamageCauser);
	bool IsDead();
	bool IsAlive();
	float Heal(float amount);
	bool GetShowHealthBar();
	float GetHealthPct();
	TScriptInterface<IHealth> GetHealthComponentForCollider(UPrimitiveComponent* Primitive);
	FVector GetHealthBarWorldOffset();
	float GetHealth();
	UParticleSystem* GetGenericImpactParticles();
	bool GetCanTakeDamage();
	bool CanTakeDamageFrom(UDamageClass* DamageClass);
	void CanTakeDamageDelegate__DelegateSignature(bool OutCanTakeDamage);
};

// Class FSD.HealthComponent
// Size: 0x248 (Inherited: 0x148)
struct UHealthComponent : UHealthComponentBase {
	FMulticastInlineDelegate OnArmorChanged; // 0x148(0x10)
	FMulticastInlineDelegate OnArmorDamaged; // 0x158(0x10)
	FMulticastInlineDelegate OnArmorHealed; // 0x168(0x10)
	FMulticastInlineDelegate OnDeathDetailed; // 0x178(0x10)
	FMulticastInlineDelegate OnNewHealthSegment; // 0x188(0x10)
	float Damage; // 0x198(0x04)
	TArray<float> HealthSegmentSizes; // 0x1a0(0x10)
	bool CanDamageThroughSegments; // 0x1b0(0x01)
	bool SubHeathComponentsMustDieFirst; // 0x1bc(0x01)
	TArray<USubHealthComponent*> SubHealthComponents; // 0x1c0(0x10)
	bool InvulnerableToNonDefinedResistances; // 0x1d0(0x01)
	TMap<UPawnStat*, float> Resistances; // 0x1d8(0x50)
	bool AffectedByGlobalWeakpointDamageMultiplier; // 0x228(0x01)
	bool UseDormancy; // 0x229(0x01)
	UPawnStatsComponent* PawnStats; // 0x230(0x08)

	void ToggleCanTakeDamage();
	void Resupply(float percentage);
	void OnRep_Damage(float oldDamage);
	void HealArmor(float amount);
	bool HasArmor();
	float GetMaxArmor();
	enum class EHealthbarType GetHealthbarType();
	void GetCurrentHealthSegment(int32_t Segment, float segmentHealth, float segmentHealthPercent);
	float GetArmorPct();
	float GetArmor();
	void Client_ReceivedHit(float amount, UDamageClass* DamageClass, AActor* DamageCauser, bool anyHealthLost);
};

// Class FSD.EnemyHealthComponent
// Size: 0x288 (Inherited: 0x248)
struct UEnemyHealthComponent : UHealthComponent {
	FVector KillImpactNormal; // 0x248(0x0c)
	bool IsBulletSpongeEnemy; // 0x254(0x01)
	enum class EEnemyHealthScaling EnemyHealthScaling; // 0x255(0x01)
	float Courage; // 0x258(0x04)
	float MaxHealth; // 0x25c(0x04)
	bool bShowHealthBar; // 0x264(0x01)
	FVector HealthBarOffsetWorld; // 0x268(0x0c)
	bool bIsBossFight; // 0x274(0x01)
	int32_t BossFightHealthBarSegments; // 0x278(0x04)
	bool bRegisterEnemy; // 0x27c(0x01)
	float MixerBuff; // 0x280(0x04)

	void SetMaxHealth(float newMaxHealth);
	void OnSubArmorDamaged(float amount);
	void IncrementKillCount();
	float GetMaxHealth();
};

// Class FSD.EnemyMeleeAttackAnimNotify
// Size: 0x40 (Inherited: 0x38)
struct UEnemyMeleeAttackAnimNotify : UAnimNotify {
	FName AttackTag; // 0x38(0x08)
};

// Class FSD.EnemyRangedAttackAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UEnemyRangedAttackAnimNotify : UAnimNotify {
};

// Class FSD.StopLeadingNotify
// Size: 0x38 (Inherited: 0x38)
struct UStopLeadingNotify : UAnimNotify {
};

// Class FSD.EnemySettings
// Size: 0x148 (Inherited: 0x30)
struct UEnemySettings : UDataAsset {
	TArray<UEnemyDescriptor*> EnemiesAllowedInWaves; // 0x30(0x10)
	FRandRange EnemyWaveRange; // 0x40(0x08)
	TMap<UEnemyID*, UEnemyDescriptor*> EnemyDescriptor; // 0x48(0x50)
	FGameplayTagQuery EliteAllowQuery; // 0x98(0x48)
	TMap<UEnemyDescriptor*, FEliteEnemyEntry> HeroEnemies; // 0xe0(0x50)
	FRandFloatInterval HeroEnemySpawn; // 0x130(0x10)
	int32_t EliteRequiredCampaignProgress; // 0x140(0x04)
};

// Class FSD.SpawnSettings
// Size: 0x58 (Inherited: 0x30)
struct USpawnSettings : UDataAsset {
	TArray<UParticleSystem*> SpawnEffects; // 0x30(0x10)
	TArray<USoundCue*> SpawnSounds; // 0x40(0x10)
	FRandRange SpawnDuration; // 0x50(0x08)
};

// Class FSD.EnemySpawnManager
// Size: 0x268 (Inherited: 0xb0)
struct UEnemySpawnManager : UActorComponent {
	FMulticastInlineDelegate OnEnemyDestroyed; // 0xb0(0x10)
	FMulticastInlineDelegate OnEnemyDied; // 0xc0(0x10)
	FMulticastInlineDelegate OnEnemySpawned; // 0xd0(0x10)
	USpawnEffectsComponent* SpawnEffects; // 0xe0(0x08)
	TArray<APawn*> ActiveEnemies; // 0xf0(0x10)
	TArray<APawn*> ActiveSwarmerEnemies; // 0x100(0x10)
	TArray<UStatusEffect*> ActiveGlobalStatusEffects; // 0x110(0x10)
	TMap<UEnemyDescriptor*, FSpawnRarityModifierItem> SpawnRarityModifiers; // 0x120(0x50)
	TArray<APawn*> ActiveCritters; // 0x170(0x10)
	TArray<APawn*> CritcalEnemies; // 0x180(0x10)
	int32_t MaxActiveEnemies; // 0x190(0x04)
	int32_t MaxActiveSwarmers; // 0x194(0x04)
	int32_t MaxActiveCritters; // 0x198(0x04)
	float MaxDistanceBeforeCleanup; // 0x19c(0x04)
	FGameplayTag SwarmerTag; // 0x1a0(0x08)
	FGameplayTag RegularTag; // 0x1a8(0x08)
	FGameplayTag CritterTag; // 0x1b0(0x08)
	AProceduralSetup* ProceduralSetup; // 0x1b8(0x08)
	TArray<FSpawnQueueItem> SpawnQueue; // 0x1c0(0x10)
	bool bDestroyingAllEnemies; // 0x1d0(0x01)

	void SpawnerDestroyed(APawn* Actor);
	bool SpawnEnemy(UEnemyDescriptor* descriptor, FTransform Transform, FDelegate Callback, bool useSpawnFX, bool Alert);
	void SetSpawningEnabled(bool newSpawningEnabled);
	void RemoveGlobalStatusEffect(UStatusEffect* StatusEffect);
	void RegisterSpawner(APawn* Actor);
	void RegisterSpawnedEnemy(AActor* enemy);
	void PromoteToCritical(APawn* Pawn);
	void OnMatchStarted();
	void OnMatchEnded();
	bool GetSpawningEnabled();
	void EnemyDestroyed(AActor* Actor);
	void EnemyDeath(UHealthComponentBase* HealthComponent);
	void DestroyAllEnemies();
	bool CanSpawn(UEnemyDescriptor* EnemyDescriptor);
	void AddGlobalStatusEffect(UStatusEffect* StatusEffect);
};

// Class FSD.SpawnEffectsComponent
// Size: 0x1d8 (Inherited: 0xb0)
struct USpawnEffectsComponent : UActorComponent {
	FSpawnEffectsArray ActiveEffects; // 0xb0(0x120)
	UMaterialInstance* BiomeMaterialOverride; // 0x1d0(0x08)
};

// Class FSD.PheromoneSpawnerComponent
// Size: 0x118 (Inherited: 0xb0)
struct UPheromoneSpawnerComponent : UActorComponent {
	FRandRange SpawnInterval; // 0xb0(0x08)
	float AttackPositioningCostModifier; // 0xb8(0x04)
	UEnemyDescriptor* enemy; // 0xc0(0x08)
	TMap<AActor*, float> InfectedActors; // 0xc8(0x50)
};

// Class FSD.TemperatureComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UTemperatureComponent : UActorComponent {
	float FrozenDamageBonusScale; // 0xc0(0x04)

	bool TryPushHeatSource(AActor* Target, float Temperature, enum class ETemperatureIntensity Intensity);
	bool TryPopHeatSource(AActor* Target, float Temperature, enum class ETemperatureIntensity Intensity);
	float GetCurrentTemperature();
	void ChangeTemperature(float Degrees, AActor* Source);
};

// Class FSD.EnemyTemperatureComponent
// Size: 0x140 (Inherited: 0xc8)
struct UEnemyTemperatureComponent : UTemperatureComponent {
	float UpdateTime; // 0xc8(0x04)
	bool DieIfFrozen; // 0xcc(0x01)
	float TemperatureChangeScale; // 0xd0(0x04)
	float BurnTemperature; // 0xd4(0x04)
	float DouseFireTemperature; // 0xd8(0x04)
	float FreezeTemperature; // 0xdc(0x04)
	float UnFreezeTemperature; // 0xe0(0x04)
	int32_t WarmingRate; // 0xe4(0x04)
	int32_t CoolingRate; // 0xe8(0x04)
	bool IsHeatsourceWhenOnFire; // 0xec(0x01)
	float OnFireHeatRange; // 0xf0(0x04)
	float MaxColdSlowdown; // 0xf4(0x04)
	UPawnStatsComponent* PawnStats; // 0x100(0x08)
	int32_t WarmingCooldown; // 0x120(0x04)

	void TimerCallback();
	void OnDeath(UHealthComponentBase* HealthComponent);
	void DoTemperatureShock(UStatusEffectsComponent* Status);
};

// Class FSD.EnemyTemperatureReplicatorComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UEnemyTemperatureReplicatorComponent : UActorComponent {
	FMulticastInlineDelegate OnTemperatureEffectChanged; // 0xb0(0x10)
	FMulticastInlineDelegate OnIsFrozenChanged; // 0xc0(0x10)
	FMulticastInlineDelegate OnIsOnFireChanged; // 0xd0(0x10)
	TWeakObjectPtr<UEnemyTemperatureComponent> EnemyTemperatureComponent; // 0xe0(0x08)
	int32_t TemperatureEffect; // 0xe8(0x04)
	bool bIsFrozen; // 0xec(0x01)
	bool bIsOnFire; // 0xed(0x01)

	void OnRep_TemperatureEffect();
	void OnRep_IsOnFire();
	void OnRep_IsFrozen();
	bool IsOnFire();
	bool IsFrozen();
	float GetTemperatureEffect();
	void BoolDelegate__DelegateSignature(bool Value);
};

// Class FSD.EnemyWaveController
// Size: 0x30 (Inherited: 0x28)
struct UEnemyWaveController : UObject {
	bool IsComplete; // 0x28(0x01)
	bool IsSuitableForSolo; // 0x29(0x01)

	void StartWave();
	void ResumeWave();
	void PauseWave();
	void OnWaveCompleted();
};

// Class FSD.EnemyWaveManager
// Size: 0x138 (Inherited: 0xb0)
struct UEnemyWaveManager : UActorComponent {
	TArray<FWaveEntry> ScriptedWaves; // 0xb0(0x10)
	TArray<FWaveEntry> EndMissionWaves; // 0xc0(0x10)
	TArray<UEnemyWaveController*> ActiveScriptedWaves; // 0xd0(0x10)
	float StartDelay; // 0xe0(0x04)
	float spawnRadiusFromSpawnPoint; // 0xe4(0x04)
	bool ScriptedWavesEnabled; // 0xe8(0x01)
	bool NormalWavesEnabled; // 0xe9(0x01)
	bool OverrideDifficultyScriptedWaveInternal; // 0xea(0x01)
	FRandRange OverrideScriptedWaveInterval; // 0xec(0x08)
	AFSDGameMode* GameMode; // 0xf8(0x08)
	UEnemySpawnManager* SpawnManager; // 0x100(0x08)
	TArray<UObject*> NormalWavesBlockStack; // 0x118(0x10)
	TArray<UObject*> ScriptedWavesBlockStack; // 0x128(0x10)

	UEnemyWaveController* TriggerWave(UEnemyWaveController* waveClass);
	void TriggerEndWave(bool cancelAllWaves);
	void SpawnScriptedWave();
	void PushDisableScriptedWaves(UObject* Owner);
	void PushDisableNormalWaves(UObject* Owner);
	void PopDisableScriptedWaves(UObject* Owner);
	void PopDisableNormalWaves(UObject* Owner);
	void OnMatchEnded();
	void OnEnemySpawned(APawn* enemy);
	bool AreScriptedWavesBlocked();
	bool AreNormalWavesBlocked();
};

// Class FSD.EscortMuleAIController
// Size: 0x410 (Inherited: 0x358)
struct AEscortMuleAIController : AFSDAIController {
	TArray<FVector> CurrentPath; // 0x368(0x10)
	TArray<FVector> GaragePath; // 0x3c8(0x10)
	int32_t PathIndex; // 0x3d8(0x04)
	int32_t CurrentRoom; // 0x3dc(0x04)
	UEscortObjective* EscortObj; // 0x3e0(0x08)
	int32_t TunnelStartIndex; // 0x3e8(0x04)
	int32_t TunnelEndIndex; // 0x3ec(0x04)
	FRandomStream RandomStream; // 0x408(0x08)

	void SetDozerNextPathSegment();
	void OnPathComplete();
	TArray<FVector> GetPathForDebug(int32_t Segment);
	FVector GetPathEndTagent();
	void FindDozerPath(FVector StartPosition);
};

// Class FSD.EscortObjective
// Size: 0x310 (Inherited: 0x150)
struct UEscortObjective : UObjective {
	FMulticastInlineDelegate OnProgressUpdated; // 0x150(0x10)
	FMulticastInlineDelegate OnShellBreakPauseChange; // 0x160(0x10)
	FMulticastInlineDelegate OnMuleRefueled; // 0x170(0x10)
	bool DidRescueDorettaHead; // 0x180(0x01)
	int32_t AreasToScan; // 0x184(0x04)
	int32_t ScanCount; // 0x188(0x04)
	TArray<FVector> ScanLocations; // 0x190(0x10)
	UDebrisPositioning* Positioning; // 0x1a0(0x08)
	UDebrisPositioning* EscortMulePositioning; // 0x1a8(0x08)
	UCurveFloat* CostDistanceCurve; // 0x1b0(0x08)
	float DebrisRadius; // 0x1b8(0x04)
	TArray<UDebrisBase*> ObjectDebris; // 0x1c0(0x10)
	TSoftClassPtr<UObject> RefuelObjectClass; // 0x1d0(0x28)
	TSoftClassPtr<UObject> DestinationClass; // 0x1f8(0x28)
	int32_t AreasScanned; // 0x220(0x04)
	enum class EEscortMissionState State; // 0x224(0x01)
	bool FinalBattle; // 0x225(0x01)
	UCarvedResourceData* FuelResource; // 0x228(0x08)
	UResourceData* GemResource; // 0x230(0x08)
	FMulticastInlineDelegate OnCannisterRegistered; // 0x238(0x10)
	float ServerShellProgress; // 0x248(0x04)
	int32_t SecondsToDestroyHeartstone; // 0x268(0x04)
	int32_t FullCanistersRequired; // 0x26c(0x04)
	int32_t FullCanisters; // 0x270(0x04)
	int32_t FuelResourceAmount; // 0x274(0x04)
	TSoftClassPtr<UObject> GarageDropCarver; // 0x278(0x28)
	TSoftClassPtr<UObject> EscortMuleDropBeaconClass; // 0x2a0(0x28)
	TSoftClassPtr<UObject> GarageClass; // 0x2c8(0x28)
	FVector EscortMuleDropLocation; // 0x2f0(0x0c)
	AEscortMule* EscortMule; // 0x300(0x08)
	AEscortDestination* EscortDestination; // 0x308(0x08)

	void SyncProgressTimer();
	void StartShellBreak();
	void SpawnGarage();
	void SetState(enum class EEscortMissionState State);
	void SetShellBreakPaused(bool newPaused);
	void SetEscortMule(AEscortMule* MULE);
	void RegisterFuelCannister(AExtractorItem* extractor);
	void RecordFailStage(bool muleDied);
	void OnResourceChanged(UCappedResource* CappedResource, float amount);
	void OnRep_FullCanisters();
	void OnRep_EscortState();
	void OnRep_EscortMule();
	void OnRep_AreasToScan(int32_t prevAmount);
	void OnRep_AreasScanned(int32_t prevAmount);
	void OnMuleDied(UHealthComponentBase* HealthComponent);
	void OnHealthChanged(float Health);
	void OnFullCanistersChanged(int32_t amount);
	void OnEscortMuleSpawnedEvent();
	float GetShellBreakProgress();
	bool DoesPathExist(FVector Start, FVector End);
};

// Class FSD.EscortMule
// Size: 0x490 (Inherited: 0x2e8)
struct AEscortMule : AFSDPawn {
	FMulticastInlineDelegate OnMuleActivated; // 0x2f0(0x10)
	FMulticastInlineDelegate OnSpeedChanged; // 0x300(0x10)
	FMulticastInlineDelegate OnFullCanistersChanged; // 0x310(0x10)
	FMulticastInlineDelegate OnExitGaragePathSet; // 0x320(0x10)
	FMulticastInlineDelegate Cheat_SetMuleSpeed; // 0x330(0x10)
	FMulticastInlineDelegate Cheat_JumpToNextPhase; // 0x340(0x10)
	UFriendlyHealthComponent* HealthComponent; // 0x350(0x08)
	USimpleObjectInfoComponent* ObjectInfo; // 0x358(0x08)
	URestrictedResourceBank* ResourceBank; // 0x360(0x08)
	FTransform TargetTransform; // 0x370(0x30)
	FTransform PreviousTransform; // 0x3a0(0x30)
	FEscortMuleMovementState MovementState; // 0x3f0(0x50)
	float SpeedModifier; // 0x440(0x04)
	USkeletalMeshComponent* Mesh; // 0x448(0x08)
	UOutlineComponent* OutlineComponent; // 0x450(0x08)
	float HealPerTickNormal; // 0x458(0x04)
	float HealPerTickUnderAttack; // 0x45c(0x04)
	bool CannisterVisible_Left; // 0x460(0x01)
	bool CannisterVisible_Right; // 0x461(0x01)
	FVector NextStop; // 0x464(0x0c)
	bool IsCarvingTunnel; // 0x470(0x01)
	int32_t FullCanisters; // 0x474(0x04)
	TArray<FEscortMuleExtractorSlot> ExtractorSlots; // 0x478(0x10)

	bool TryHeal(APlayerCharacter* User, float amount);
	void SetTargetTransform(FTransform InTransform);
	void SetSpeedModifier(float inSpeedModifier);
	void SetFullExtracterAttached(UInstantUsable* Usable);
	void SetExtractorDetached(UInstantUsable* Usable);
	void SetExitGaragePath(TArray<FVector> Path);
	void ResetExtractors();
	void PathIsReady();
	void OnRep_SpeedModifier();
	void OnRep_MovementState();
	void OnRep_IsCarvingTunnel();
	void OnRep_ExtractorSlots();
	void OnObjectiveStateChanged(enum class EEscortMissionState NewState);
	void OnExtractorSlotChanged(FEscortMuleExtractorSlot Slot, int32_t Index);
	void OnExtractorDetached(AExtractorItem* Item);
	void ObjectiveStateChange(enum class EEscortMissionState NewState);
	enum class EEscortExtractorState GetExtractorState(UInstantUsable* Usable);
	void ActivateMule();
};

// Class FSD.EscortMuleTrack
// Size: 0x248 (Inherited: 0x220)
struct AEscortMuleTrack : AActor {
	FGameplayTagContainer GameplayTags; // 0x228(0x20)
};

// Class FSD.EscortDestination
// Size: 0x260 (Inherited: 0x220)
struct AEscortDestination : AActor {
	FMulticastInlineDelegate OnShellCracked; // 0x220(0x10)
	UDamageComponent* EndExplosionDamage; // 0x230(0x08)
	float NextBreakpoint; // 0x238(0x04)
	int32_t StageForAnalytics; // 0x23c(0x04)
	int32_t SecondsToDestroyHeartstone; // 0x240(0x04)
	TArray<float> BreakpointsPercent; // 0x248(0x10)
	float Radius; // 0x258(0x04)
	float ShellThickness; // 0x25c(0x04)

	void MeltPlatforms(ADeepCSGWorld* CSGWorld, TArray<FVector> meltPoints, float meltRadius);
	UTerrainMaterial* GetTerrainMaterialByHandle(ADeepCSGWorld* CSGWorld, int32_t materialHandle);
	int32_t GetSecondsToDestroyObjective();
	FVector GetClosestPointOnRadius(FVector CurrentLocation, int32_t numberOfShellsCracked, FVector dirFromCenter);
};

// Class FSD.FSDPhysicsActor
// Size: 0x230 (Inherited: 0x220)
struct AFSDPhysicsActor : AActor {
	int32_t MovementUpdateFrequency; // 0x220(0x04)
	int32_t MovementUpdateEventTriggeredFrequency; // 0x224(0x04)

	void ForceMovementUpdate();
};

// Class FSD.CarriableItem
// Size: 0x248 (Inherited: 0x230)
struct ACarriableItem : AFSDPhysicsActor {
	FMulticastInlineDelegate OnAttachedChangeDelegate; // 0x230(0x10)
	bool StrictDeposit; // 0x240(0x01)

	void Throw(FVector force);
	void Receive_OnDeposited(APlayerCharacter* fromPlayer);
	void OnAttachChanged(bool Attached);
};

// Class FSD.DorrettaHead
// Size: 0x258 (Inherited: 0x248)
struct ADorrettaHead : ACarriableItem {
	UCarriableInstantUsable* Usable; // 0x248(0x08)
	UCarriableComponent* CarriableComponent; // 0x250(0x08)
};

// Class FSD.FuelCannisterAttachedAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UFuelCannisterAttachedAnimInstance : UAnimInstance {
	bool CanBeTaken; // 0x268(0x01)

	void SetCanBeTaken(bool canBeTakenValue);
};

// Class FSD.FuelCannisterItemAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UFuelCannisterItemAnimInstance : UAnimInstance {
	bool IsOnGround; // 0x268(0x01)
	bool IsFull; // 0x269(0x01)
	bool IsShooting; // 0x26a(0x01)
};

// Class FSD.EscortMuleAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UEscortMuleAnimInstance : UAnimInstance {
	bool LeftCannistersVisible; // 0x268(0x01)
	bool RightCannistersVisible; // 0x269(0x01)
	bool IsEngineRunning; // 0x26a(0x01)
	bool IsBeingRefueled; // 0x26b(0x01)
	bool PlatformOut; // 0x26c(0x01)

	void OnTookDamage(UHealthComponent* Health);
};

// Class FSD.ExplosiveBarrelEvent
// Size: 0x360 (Inherited: 0x358)
struct AExplosiveBarrelEvent : AGameEvent {
	UDamageComponent* EndDamage; // 0x358(0x08)
};

// Class FSD.BarrelDispenser
// Size: 0x258 (Inherited: 0x220)
struct ABarrelDispenser : AActor {
	ACarriableItem* BarrelClass; // 0x228(0x08)
	USingleUsableComponent* Usable; // 0x238(0x08)
	USkeletalMeshComponent* Mesh; // 0x240(0x08)
	float FirstBarrelGenerationTime; // 0x248(0x04)
	float BarrelGenerationTime; // 0x24c(0x04)
	bool IsReady; // 0x250(0x01)
	bool HasBarrel; // 0x251(0x01)

	void SetPicked(APlayerCharacter* User);
	void OnUsed(APlayerCharacter* User);
	void OnSpawnedItem(AActor* spawned);
	void OnFolded();
	void OnDeployed();
	void FoldUp();
	void Deploy();
};

// Class FSD.BarrelDispenserAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UBarrelDispenserAnimInstance : UAnimInstance {
	bool IsReady; // 0x268(0x01)
	bool HasBarrel; // 0x269(0x01)
};

// Class FSD.ExtractorItem
// Size: 0x528 (Inherited: 0x368)
struct AExtractorItem : AAnimatedItem {
	FMulticastInlineDelegate OnCurrentLoadChangedEvent; // 0x370(0x10)
	FMulticastInlineDelegate OnCharacterEquipChange; // 0x380(0x10)
	UBoxComponent* DroppedCollider; // 0x390(0x08)
	USkeletalMeshComponent* DroppedMesh; // 0x398(0x08)
	UFirstPersonParticleSystemComponent* FP_DrillParticles; // 0x3a0(0x08)
	UAudioComponent* AudioComponent; // 0x3a8(0x08)
	UPointLightComponent* SurfaceLight; // 0x3b0(0x08)
	UParticleSystemComponent* MeltingParticles; // 0x3b8(0x08)
	UParticleSystemComponent* InvalidSurfaceParticles; // 0x3c0(0x08)
	UParticleSystemComponent* FPMuzzleParticles; // 0x3c8(0x08)
	UParticleSystemComponent* FPMuzzleInvalidParticles; // 0x3d0(0x08)
	UParticleSystemComponent* TPMuzzleParticles; // 0x3d8(0x08)
	UParticleSystemComponent* TPMuzzleInvalidParticles; // 0x3e0(0x08)
	UAnimMontage* FPMineMontage; // 0x3e8(0x08)
	UAnimMontage* TPMineMontage; // 0x3f0(0x08)
	UAnimMontage* FPGunsling; // 0x3f8(0x08)
	UAnimMontage* TPGunsling; // 0x400(0x08)
	FName MiningSpeedAudioParamterName; // 0x408(0x08)
	UParticleSystem* DrillParticles; // 0x410(0x08)
	UForceFeedbackEffect* DrillRumble; // 0x418(0x08)
	float BlockParticlesScaleFP; // 0x420(0x04)
	float BlockParticlesScaleTP; // 0x424(0x04)
	enum class EExtractorState State; // 0x428(0x01)
	float MovementPenalty; // 0x42c(0x04)
	float CarverRayCastLength; // 0x430(0x04)
	float CarveTerrainDistanceCheck; // 0x434(0x04)
	float CurrentDrillSpeed; // 0x438(0x04)
	float DrillParticlesDuration; // 0x450(0x04)
	UResourceData* ExtractetMaterial; // 0x458(0x08)
	float TimeBeforeInvalidShout; // 0x460(0x04)
	UDialogDataAsset* InvalidSurfaceShout; // 0x468(0x08)
	UDialogDataAsset* ShoutFull; // 0x470(0x08)
	USoundCue* DigSound; // 0x478(0x08)
	bool IsMining; // 0x480(0x01)
	bool IsGunslinging; // 0x481(0x01)
	bool ReadyToExtract; // 0x482(0x01)
	UParticleSystem* VacuumEffect; // 0x490(0x08)
	UParticleSystem* ChunkSplatEffect; // 0x498(0x08)
	USoundCue* ChunkSplatSound; // 0x4a0(0x08)
	float MaxDifference; // 0x4cc(0x04)
	float MeltingTime; // 0x4d4(0x04)
	float ChunkMultiplier; // 0x4d8(0x04)
	float CollectChunkCooldown; // 0x4dc(0x04)
	float CrossfadeSpeed; // 0x4e0(0x04)
	float VacuumEffectOffset; // 0x4f8(0x04)
	float MaxCapacity; // 0x4fc(0x04)
	float PlayerCountBonus; // 0x500(0x04)
	FColor SurfaceLightInitialColor; // 0x508(0x04)
	FColor SurfaceLightEndColor; // 0x50c(0x04)
	float SurfaceLightMinIntensity; // 0x510(0x04)
	float SurfaceLightMaxIntensity; // 0x514(0x04)
	float CurrentLoad; // 0x518(0x04)

	void SetCanPickup(bool canPickup);
	void Server_StopMining();
	void Server_StartMining();
	void Server_SetReadyToExtract(bool IsReady);
	void Server_DigBlock(FVector_NetQuantize Start, FVector_NetQuantize End);
	void Server_CollectChunk(AResourceChunk* chunk);
	void ResetCurrentLoad();
	void OnValidSurfaceChanged(bool IsValid);
	void OnThrown(FVector Direction);
	void OnStopDrilling();
	void OnStartDrilling();
	void OnRep_SimulatingMining();
	void OnRep_IsGunslinging();
	void OnRep_CurrentLoad();
	void OnCurrentLoadChanged(float Load);
	void OnChunkCooldownOver();
	bool IsFull();
	UBoxComponent* GetRootCollider();
	void All_SimulateDigBlock(FVector_NetQuantize Position, bool spawnParticles, int32_t Material);
	void All_ChunkSplat(AResourceChunk* chunk);
	void AddResource(float amount);
};

// Class FSD.ExtruderPlant
// Size: 0x248 (Inherited: 0x220)
struct AExtruderPlant : AActor {
	USkeletalMeshComponent* SkeletalMesh; // 0x220(0x08)
	UAnimationAsset* ExtrudeAnimation; // 0x228(0x08)
	UAnimationAsset* RetractAnimation; // 0x230(0x08)
	UAudioComponent* Audio; // 0x238(0x08)
};

// Class FSD.FacilityDrone
// Size: 0x5c8 (Inherited: 0x398)
struct AFacilityDrone : AEnemyDeepPathfinderCharacter {
	UPawnSensingComponent* PawnSensing; // 0x3a0(0x08)
	USphereComponent* CollisionSphere; // 0x3a8(0x08)
	USphereComponent* NearTargetSphere; // 0x3b0(0x08)
	UParticleSystemComponent* TearingGroundParticles; // 0x3b8(0x08)
	UParticleSystemComponent* AirTrailParticles; // 0x3c0(0x08)
	UEnemyComponent* EnemyComponent; // 0x3c8(0x08)
	UDamageComponent* Damage; // 0x3d0(0x08)
	UDamageComponent* BumpDamage; // 0x3d8(0x08)
	UPawnAlertComponent* Alert; // 0x3e0(0x08)
	UProjectileAttackComponent* RollingRangedAttack; // 0x3e8(0x08)
	UProjectileAttackComponent* FlyingRangedAttack; // 0x3f0(0x08)
	UHitscanComponent* HitScan; // 0x3f8(0x08)
	bool IsLockedOn; // 0x414(0x01)
	float DelayAfterLockOn; // 0x418(0x04)
	USoundCue* ImpactCue; // 0x420(0x08)
	USoundCue* JumpSound; // 0x428(0x08)
	float LaunchPower; // 0x430(0x04)
	FFloatInterval JumpInterval; // 0x434(0x08)
	bool CanJump; // 0x445(0x01)
	float ChanceForJump; // 0x448(0x04)
	float MinJumpCooldown; // 0x44c(0x04)
	float MaxJumpCooldown; // 0x450(0x04)
	float JumpForce; // 0x454(0x04)
	float TimeBeforeGroundCheck; // 0x458(0x04)
	float StartFlyingTimer; // 0x460(0x04)
	float MinRollingTime; // 0x468(0x04)
	float MaxRollingTime; // 0x46c(0x04)
	float MinFlyingTime; // 0x470(0x04)
	float MaxFlyingTime; // 0x474(0x04)
	float SpawnRocketsTime; // 0x478(0x04)
	UFakeMoverSettings* RollSettings; // 0x488(0x08)
	UFakeMoverSettings* JumpSettings; // 0x490(0x08)
	UFakeMoverSettings* SpawnRocketsSettings; // 0x498(0x08)
	UFakeMoverSettings* IdleSettings; // 0x4a0(0x08)
	enum class EFacilityDroneState State; // 0x4a8(0x01)
	float MinTurretAngle; // 0x4ac(0x04)
	float MaxTurretAngle; // 0x4b0(0x04)
	float SpawnRocketsCheckTime; // 0x4b4(0x04)
	float SpawnRocketsChance; // 0x4bc(0x04)
	float FlyingDampOmega; // 0x4f0(0x04)
	float RollingDampOmega; // 0x4f4(0x04)
	FRuntimeFloatCurve MuzzleLightCurve; // 0x4f8(0x88)
	float GunRange; // 0x588(0x04)
	float RollingAttackCooldown; // 0x58c(0x04)
	float FlyingAttackCooldown; // 0x590(0x04)
	float TurretLerpSpeed; // 0x598(0x04)
	bool FiringRockets; // 0x59c(0x01)
	float AimDownwardsOffset; // 0x5a4(0x04)
	AActor* CurrentTarget; // 0x5c0(0x08)

	void OnStateChangedEvent(enum class EFacilityDroneState CurrentState);
	void OnSpawnRocketsEvent();
	void OnRocketsEnded();
	void OnRep_Target();
	void OnRep_State();
	void OnRep_IsLockedOn();
	void OnRep_FiringRockets();
	void OnLockedOn();
	void OnLandedEvent();
	void OnJumpEvent();
	void OnFireRockets();
	void OnDroneAlerted();
	void OnDeath(UHealthComponentBase* aHealthComponent);
	void OnCollided(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult SweepResult);
	void Jumped();
	void ImpactSound();
	void EndFireRockets();
};

// Class FSD.SpiderAnimInstance
// Size: 0x410 (Inherited: 0x2c0)
struct USpiderAnimInstance : UEnemyAnimInstance {
	float Speed; // 0x2c0(0x04)
	FVector Velocity; // 0x2c4(0x0c)
	float WalkCycleSpeed; // 0x2d0(0x04)
	float StartMovingSpeed; // 0x2d4(0x04)
	float StopMovingSpeed; // 0x2d8(0x04)
	float WalkCycleMinRate; // 0x2dc(0x04)
	float WalkCyclePlayRate; // 0x2e0(0x04)
	float MeshScale; // 0x2e4(0x04)
	float Direction; // 0x2e8(0x04)
	float PathDirectionLerpSpeedIn; // 0x2ec(0x04)
	float PathDirectionLerpSpeedOut; // 0x2f0(0x04)
	float PathDirection; // 0x2f4(0x04)
	float HorizontalAngularSpeed; // 0x2f8(0x04)
	float HorizontalAngularSpeed_Abs; // 0x2fc(0x04)
	float VerticalAngularSpeed; // 0x300(0x04)
	enum class EMoveDirection MoveDirection; // 0x304(0x01)
	bool IsMoving; // 0x305(0x01)
	bool IsStrafing; // 0x306(0x01)
	bool IsMovingAndStrafing; // 0x307(0x01)
	bool IsFrozen; // 0x308(0x01)
	bool IsStaggered; // 0x309(0x01)
	float StaggerStrength; // 0x30c(0x04)
	bool IsAirborne; // 0x310(0x01)
	UParticleSystem* FootStepParticle; // 0x318(0x08)
	USoundCue* FootStepSound; // 0x320(0x08)
	FName FootStepLeftBoneName; // 0x328(0x08)
	FName FootStepRightBoneName; // 0x330(0x08)
	float FootStepParticleCullDistance; // 0x338(0x04)
	TMap<UEnemyPlaySoundKey*, USoundCue*> PlaySoundByKeyMap; // 0x340(0x50)
	TMap<UEnemySpawnEffectsKey*, UParticleSystem*> SpawnEffectsByKeyMap; // 0x390(0x50)
	int32_t RandomWalkCycleIndex; // 0x3e0(0x04)
	TArray<FRandomWalkCycleEntry> RandomWalkCycles; // 0x3e8(0x10)
	bool TurnToIdle; // 0x3f8(0x01)
	bool IdleToTurnLeft; // 0x3f9(0x01)
	bool IdleToTurnRight; // 0x3fa(0x01)
	bool TurnToWalk; // 0x3fb(0x01)
	bool WalkToTurnRight; // 0x3fc(0x01)
	bool WalkToTurnLeft; // 0x3fd(0x01)
	bool IsInFakePhysics; // 0x3fe(0x01)

	void SetMeshScale(float NewScale);
	void SetDeathAnimation(UAnimSequenceBase* Animation);
	void PlayForcedCycle(float Duration);
};

// Class FSD.FacilityDroneAnimInstnace
// Size: 0x430 (Inherited: 0x410)
struct UFacilityDroneAnimInstnace : USpiderAnimInstance {
	FRotator TurretRotation; // 0x408(0x0c)
	FRotator ModifiedTurretRotation; // 0x414(0x0c)
	enum class EFacilityDroneState DroneState; // 0x420(0x01)
};

// Class FSD.FacilityGeneratorLine
// Size: 0x2a0 (Inherited: 0x220)
struct AFacilityGeneratorLine : AActor {
	float HeightOffsetMin; // 0x220(0x04)
	float HeightOffsetMax; // 0x224(0x04)
	float MaxSegmentLength; // 0x228(0x04)
	USplineComponent* SplineComponent; // 0x230(0x08)
	TSoftObjectPtr<UStaticMesh> LineMeshPtr; // 0x238(0x28)
	ATetherStation* Station; // 0x260(0x08)
	AActor* Generator; // 0x268(0x08)
	UStaticMesh* MeshInstance; // 0x270(0x08)
	TArray<FVector> ReplicatedPath; // 0x288(0x10)

	void OnRep_Path();
};

// Class FSD.FacilityObjective
// Size: 0x2a8 (Inherited: 0x150)
struct UFacilityObjective : UObjective {
	TSoftClassPtr<UObject> GeneratorClass; // 0x150(0x28)
	TSoftClassPtr<UObject> GeneratorBeaconClass; // 0x178(0x28)
	int32_t GeneratorCount; // 0x1a0(0x04)
	FDelegate OnFirstEncounterDroneSpawned_Delegate; // 0x1a4(0x10)
	FDelegate OnSecondEncounterDroneSpawned_Delegate; // 0x1b4(0x10)
	TArray<UEnemyDescriptor*> TurretDescriptors; // 0x1f0(0x10)
	TArray<UEnemyDescriptor*> EncounterEnemies; // 0x200(0x10)
	float EncounterDifficulty; // 0x210(0x04)
	FRandInterval Diversity; // 0x218(0x10)
	FIRandRange EncountersPerRoom; // 0x228(0x08)
	FIRandRange TurretEncountersRange; // 0x230(0x08)
	int32_t MinimumTurretEncounters; // 0x238(0x04)
	TArray<AActor*> SmallGenerators; // 0x240(0x10)
	ATetherStation* mainFacility; // 0x250(0x08)
	AActor* ActiveTetherGenerator; // 0x258(0x08)
	TArray<int32_t> ShieldGeneratorRooms; // 0x260(0x10)
	int32_t MainFacilityRoom; // 0x270(0x04)
	TArray<AActor*> ShieldGenerators; // 0x278(0x10)
	UResourceData* GoalResource; // 0x288(0x08)
	float AmountRequired; // 0x290(0x04)
	float AmountCollected; // 0x294(0x04)
	int32_t GeneratorsActivated; // 0x298(0x04)

	void SpawnFacilityEncounters(AProceduralSetup* setup, UEncounterManager* Encounters, int32_t turretIndex);
	TArray<FTransform> SpawnEndBattleTurrets(int32_t amountOfTurrets, AProceduralSetup* setup, UDebrisPositioning* DebrisPositioning, AActor* terrainPlacement, bool success);
	void SetMainFacility(ATetherStation* mainFacility);
	void SetActiveTetherGenerator(AActor* tetherGenerator);
	void SecondGeneratorEncounterSpawn(APawn* spawned);
	AActor* PlaceObjectInRoom(AProceduralSetup* setup, int32_t roomIndex, FVector Origin, float Radius, UDebrisPositioning* Positioning, AActor* placementActor, UCurveFloat* debrisCurve);
	void OnResourceChanged(UCappedResource* Resource, float amount);
	void OnRep_GeneratorsActivated();
	void OnRep_AmountCollected();
	void OnCoreDeposited();
	void InitGeneratorCount(int32_t generators);
	FTransform GetTurretGoal(AProceduralSetup* setup, FVector Origin, float idealRange, UDebrisPositioning* DebrisPositioning, AActor* terrainPlacement, bool success);
	TArray<AActor*> GetOverChargers();
	bool GetGeneratorsDone();
	int32_t GetFacilityRoomIndex();
	FVector GetFacilityLocation();
	void GeneratorActivated();
	void FirstGeneratorEncounterSpawn(APawn* spawned);
	void DropOverCharger(AProceduralSetup* setup, int32_t roomIndex, FVector facilityLocation, float idealRange, UDebrisPositioning* DebrisPositioning, AActor* terrainPlacement);
	void ChangeObjective();
	void AddShieldGenerator(AActor* charger, int32_t roomIndex);
};

// Class FSD.FacilityShieldGenerator
// Size: 0x248 (Inherited: 0x220)
struct AFacilityShieldGenerator : AActor {
	FGameplayTagContainer GameplayTags; // 0x228(0x20)
};

// Class FSD.FacilityTurretController
// Size: 0x378 (Inherited: 0x358)
struct AFacilityTurretController : AFSDAIController {
	UAIPerceptionComponent* Perception; // 0x358(0x08)

	void OnTurretsAttackingChanged(bool IsAttacking);
	void OnTargetDied(UHealthComponentBase* Health);
	void OnPerceptionUpdated(AActor* sensedActor, FAIStimulus Stimulus);
};

// Class FSD.FacilityTurret
// Size: 0x3a0 (Inherited: 0x338)
struct AFacilityTurret : AEnemyPawn {
	USceneComponent* Root; // 0x340(0x08)
	UProjectileAttackComponent* Attack; // 0x348(0x08)
	UParticleSystemComponent* RangeIndicatorParticles; // 0x350(0x08)
	USoundCue* EngagedAudio; // 0x368(0x08)
	AProjectileBase* projectileClass; // 0x370(0x08)
	float Offset; // 0x38c(0x04)
	AActor* CurrentTarget; // 0x390(0x08)
	bool TurretEngaged; // 0x398(0x01)
	bool AlwaysActive; // 0x399(0x01)

	void SetIsAttacking(bool IsAttacking);
	void OnWeaponFired(FVector HitResult);
	void OnRep_TurretEngaged();
	void OnEngagedChanged(bool engaged);
	FRotator GetLookingDirection();
	FVector GetEyeLoc();
};

// Class FSD.SpinningFacilityturret
// Size: 0x3d0 (Inherited: 0x3a0)
struct ASpinningFacilityturret : AFacilityTurret {
	FRotator TargetRotation; // 0x3a0(0x0c)
	FRandRange AimAtTargetEveryTurn; // 0x3ac(0x08)
	float TurnCooldown; // 0x3b4(0x04)
	float TurnTimer; // 0x3b8(0x04)
	float Acceptance; // 0x3bc(0x04)
	float TurnSpeed; // 0x3c0(0x04)

	void OnAttack();
};

// Class FSD.AimingFacilityTurret
// Size: 0x3d0 (Inherited: 0x3a0)
struct AAimingFacilityTurret : AFacilityTurret {
	float LockonTime; // 0x3a0(0x04)
	float BurstInterval; // 0x3a4(0x04)
	float FireInterval; // 0x3a8(0x04)
	float TurretRotationSpeed; // 0x3ac(0x04)
	FInt32Interval BurstCount; // 0x3c4(0x08)
	bool IsLockedOn; // 0x3cc(0x01)
};

// Class FSD.FakeFallComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UFakeFallComponent : UActorComponent {

	void StartFakeFall();
};

// Class FSD.FakeMoverSettings
// Size: 0x90 (Inherited: 0x30)
struct UFakeMoverSettings : UDataAsset {
	enum class DeepPathFinderSize PathfinderColiSize; // 0x30(0x01)
	bool StickToSurface; // 0x31(0x01)
	bool AlignRotationToSurface; // 0x32(0x01)
	float AirFriction; // 0x34(0x04)
	float SurfaceFriction; // 0x38(0x04)
	float Gravity; // 0x3c(0x04)
	float AirGravity; // 0x40(0x04)
	FFakeMoverPropulsion Propulsion; // 0x44(0x14)
	FFakeMoverTarget NearestPlayerInfluence; // 0x58(0x1c)
	FFakeMoverTarget TargetInfluence; // 0x74(0x1c)
};

// Class FSD.FakePhysicsMover
// Size: 0x2c0 (Inherited: 0x220)
struct AFakePhysicsMover : AActor {
	USceneComponent* Root; // 0x220(0x08)
	FFakeMoverState MoverState; // 0x228(0x60)
	FFakeMoveState posVel; // 0x288(0x24)
	UFakeMoverSettings* MoveSettings; // 0x2b0(0x08)
	float SyncTime; // 0x2b8(0x04)

	void Teleport(FVector Pos, FVector Vel);
	void OnRep_PosVel(FFakeMoveState posVel);
	void OnRep_MoveSettings(UFakeMoverSettings* MoveSettings);
	void ApplyImpulse(FVector Impulse);
};

// Class FSD.FallingStateComponent
// Size: 0x1a0 (Inherited: 0xf8)
struct UFallingStateComponent : UCharacterStateComponent {
	float FallDamageStartVelocity; // 0xf8(0x04)
	float FallDamageModifier; // 0xfc(0x04)
	float AutoClimbMinDelay; // 0x100(0x04)
	float AutoClimbLookForwardDistance; // 0x104(0x04)
	float MaxClimbHeight; // 0x108(0x04)
	float MinClimbHeight; // 0x10c(0x04)
	float CapsuleCheckZOffset; // 0x110(0x04)
	float MinInputDotProduct; // 0x114(0x04)
	float JumpZVelocity; // 0x118(0x04)
	bool DebugAutoClimb; // 0x11c(0x01)
	UDialogDataAsset* FallingShout; // 0x120(0x08)
	float ShoutAfterDistance; // 0x128(0x04)
	UUseAnimationSetting* ClimbUseSettings; // 0x130(0x08)
	float HoverBootAirFriction; // 0x15c(0x04)
	float HoverBootAirControl; // 0x160(0x04)
	float HoverBootGravityScale; // 0x164(0x04)
	UDialogDataAsset* ShoutHoverBootsBegin; // 0x168(0x08)
	float HoverBootActivateDuration; // 0x170(0x04)
	bool bHoverBootsActive; // 0x174(0x01)
	float HoverBootMaxDuration; // 0x178(0x04)
	FVector2D JumpBootsVelocityWindow; // 0x17c(0x08)
	float JumpBootsZVelocity; // 0x184(0x04)
	bool JumpBootsActive; // 0x190(0x01)

	void ShowJumpBootsActivation();
	void Server_TakeFallDamage(float amount);
	void Server_ShowFallImpact(UFSDPhysicalMaterial* PhysMat);
	void Server_SetJumpPressed(bool Pressed);
	void Server_SetHoverBootsPressed(bool IsPressed);
	void Server_SetFallVelocity(float Velocity);
	void Server_ClimbLedge(bool shouldPlayAnimation);
	void Server_ActivateJumpBoots();
	void ReceiveHoverBootsTick(float DeltaSeconds);
	void ReceiveHoverBootsActiveChanged(bool IsActive);
	void OnRep_HoverBootsActive();
	void JumpReleased();
	void JumpPressed();
	void HoverBootsReleased();
	void HoverBootsPressed();
	void All_ShowJumpBootsActivation();
	void All_ShowFallImpact(UFSDPhysicalMaterial* PhysMat);
	void All_ShowClimbLedge();
};

// Class FSD.FindFriendSessionsBlueprintCallProxy
// Size: 0x80 (Inherited: 0x30)
struct UFindFriendSessionsBlueprintCallProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	UObject* WorldContextObject; // 0x50(0x08)

	UFindFriendSessionsBlueprintCallProxy* FindFriendSessions(UObject* WorldContextObject, FString FriendId);
};

// Class FSD.FirstPersonSkeletalMeshComponent
// Size: 0xac0 (Inherited: 0xac0)
struct UFirstPersonSkeletalMeshComponent : USkeletalMeshComponent {

	FVector CalcFirstPersonFOVPositionCorrection(APlayerController* PlayerController, FVector origPos);
};

// Class FSD.FirstPersonStaticMeshComponent
// Size: 0x490 (Inherited: 0x480)
struct UFirstPersonStaticMeshComponent : UStaticMeshComponent {
	bool EnabledFPFOV; // 0x480(0x01)
};

// Class FSD.FirstPersonWidgetComponent
// Size: 0x540 (Inherited: 0x540)
struct UFirstPersonWidgetComponent : UWidgetComponent {
};

// Class FSD.FirstPersonParticleSystemComponent
// Size: 0x650 (Inherited: 0x650)
struct UFirstPersonParticleSystemComponent : UParticleSystemComponent {

	UParticleSystemComponent* SpawnFirstPersonEmitterAttached(UParticleSystem* EmitterTemplate, USceneComponent* AttachToComponent, FName AttachPointName, FVector Location, FRotator Rotation, FVector Scale, enum class EAttachLocation LocationType, bool bAutoDestroy);
};

// Class FSD.FirstPersonPointLightComponent
// Size: 0x350 (Inherited: 0x350)
struct UFirstPersonPointLightComponent : UPointLightComponent {
};

// Class FSD.FlameThrowerItem
// Size: 0x850 (Inherited: 0x690)
struct AFlameThrowerItem : AAmmoDrivenWeapon {
	UParticleSystemComponent* FlameParticleComponent; // 0x690(0x08)
	UDamageComponent* DamageComponent; // 0x698(0x08)
	UStickyFlameSpawner* StickyFlames; // 0x6a0(0x08)
	UDamageComponent* AoEHeatDamageComponent; // 0x6a8(0x08)
	UDamageComponent* ExplodingTargetsDamageComponent; // 0x6b0(0x08)
	UMotionAudioController* MotionAudio; // 0x6b8(0x08)
	FDecalData ImpactDecal; // 0x6c0(0x18)
	float DecalDelay; // 0x6d8(0x04)
	float CurrentDecalDelay; // 0x6dc(0x04)
	UParticleSystem* ImpactParticles; // 0x6e0(0x08)
	UParticleSystemComponent* ImpactParticleInstance; // 0x6e8(0x08)
	UParticleSystem* FP_LongReachParticles; // 0x6f0(0x08)
	UParticleSystem* TP_LongReachParticles; // 0x6f8(0x08)
	float VeryLongReachThreshold; // 0x700(0x04)
	UParticleSystem* FP_VeryLongReachParticles; // 0x708(0x08)
	UParticleSystem* TP_VeryLongReachParticles; // 0x710(0x08)
	TArray<FName> FlameParameterNames; // 0x718(0x10)
	float DamageSphereRadius; // 0x728(0x04)
	float MaxFlameDistance; // 0x72c(0x04)
	float FlameGrowthPerSecond; // 0x730(0x04)
	float FlameEndPointResponsiveness; // 0x734(0x04)
	float FlameIntensityPerSecond; // 0x738(0x04)
	UStatusEffect* OnFireStatusEffect; // 0x740(0x08)
	float ChanceToFleeOnDamage; // 0x748(0x04)
	float MeltPointRadius; // 0x74c(0x04)
	float MeltPointBuildTime; // 0x750(0x04)
	float MeltCarveTime; // 0x754(0x04)
	UParticleSystem* MeltSteamParticle; // 0x758(0x08)
	TArray<UItemUpgrade*> Upgrades; // 0x760(0x10)
	bool LongReachEnabled; // 0x770(0x01)
	bool AoEHeatEnabled; // 0x780(0x01)
	float KilledTargetsExplosionChance; // 0x784(0x04)
	float ShowDamageParticle; // 0x788(0x04)
	UParticleSystem* DamangeTargetsParticles; // 0x790(0x08)
	UParticleSystem* KilledTargetsExplodingParticles; // 0x798(0x08)
	USoundCue* KilledTargetsExplodingSound; // 0x7a0(0x08)

	void TriggerAoEHeat();
	void ServerMeltIce(TArray<FVector> meltPoints);
	void ServerDoDamage(FVector_NetQuantize Start, FVector_NetQuantize End);
	void OnTargetKilled(AActor* Target, UFSDPhysicalMaterial* PhysMat);
	void OnTargetDamaged(UHealthComponentBase* Health, float amount, UFSDPhysicalMaterial* PhysicalMaterial);
	void All_ShowTargetBurstIntoFire(FVector_NetQuantize Location, FRotator Rotation);
	void All_FlameFeedback(FVector_NetQuantize Location, FRotator Rotation);
};

// Class FSD.Flare
// Size: 0x2b0 (Inherited: 0x230)
struct AFlare : AFSDPhysicsActor {
	float InitialSpeed; // 0x248(0x04)
	float InitialAngularImpulse; // 0x24c(0x04)
	float InitialAngularImpulseRandomScale; // 0x250(0x04)
	int32_t MaxFlares; // 0x254(0x04)
	float ProductionTime; // 0x258(0x04)
	float Duration; // 0x25c(0x04)
	FLinearColor ChromaColor; // 0x260(0x10)
	bool IsFlareOn; // 0x270(0x01)
	AActor* DamageCauser; // 0x278(0x08)
	AActor* WeaponPreviewClass; // 0x280(0x08)
	AItem* LoadoutItem; // 0x288(0x08)
	UItemID* ItemID; // 0x298(0x08)
	USoundCue* ImpactGroundSound; // 0x2a0(0x08)

	void OnUpdateShadowRadius();
	void OnRep_IsFlareOn();
	void OnFlareSpawnCompleted();
	void OnFlareIgnite();
	void OnFlareExtinguish();
	void Inhibit();
	AActor* GetWeaponViewClass();
	AFlare* GetFlareDefaultObject(AFlare* flareClass);
	void ActorWasHit(AActor* SelfActor, AActor* OtherActor, FVector NormalImpulse, FHitResult Hit);
	void ActivateFlare();
};

// Class FSD.FlareGunProjectile
// Size: 0x300 (Inherited: 0x2f0)
struct AFlareGunProjectile : AProjectile {
	float Duration; // 0x2f0(0x04)
	bool IsFlareOn; // 0x2f4(0x01)

	void OnUpdateShadowRadius();
	void OnRep_IsFlareOn();
	void OnProjectileSpawnCompleted();
	void OnFlareIgnite();
	void OnFlareExtinguish();
	void OnDroppodImpact(AMiningPod* DropPod);
	void Inhibit();
	void ActivateFlare();
};

// Class FSD.FlareController
// Size: 0xd8 (Inherited: 0xb0)
struct UFlareController : UActorComponent {
	FMulticastInlineDelegate OnShadowQualityChanged; // 0xb0(0x10)
	TArray<FFlareMeta> FlaresMeta; // 0xc0(0x10)

	void UnregisterFlareGunProjectile(AFlareGunProjectile* flareprj);
	void UnregisterFlare(AFlare* Flare);
	void RegisterFlareGunProjectile(AFlareGunProjectile* flareprj);
	void RegisterFlare(AFlare* Flare);
	AActor* FindFlareNear(UObject* WorldContextObject, FVector Pos, bool allowMoving, float maxLightRadiusFraction);
};

// Class FSD.NegPointLightComponent
// Size: 0x350 (Inherited: 0x350)
struct UNegPointLightComponent : UPointLightComponent {
};

// Class FSD.PerkAsset
// Size: 0xc8 (Inherited: 0x30)
struct UPerkAsset : UDataAsset {
	FGuid SavegameID; // 0x30(0x10)
	FText Title; // 0x40(0x18)
	UTexture2D* Icon; // 0x58(0x08)
	bool bIsEquippable; // 0x60(0x01)
	UDialogDataAsset* ShoutOnUseCharge; // 0x68(0x08)
	TArray<TSoftClassPtr<UObject>> PerkLogicClasses; // 0x70(0x10)
	TSoftClassPtr<UObject> HudIconWidgetClass; // 0x80(0x28)
	TArray<TSoftClassPtr<UObject>> HudActivationWidgets; // 0xa8(0x10)
	int32_t MaxUseCharges; // 0xb8(0x04)
	float CoolDownBetweenUse; // 0xbc(0x04)
	bool bIsHighlighted; // 0xc0(0x01)

	bool UseCharge(APlayerController* PlayerController);
	bool Unequip(UObject* WorldContext, UPlayerCharacterID* characterID);
	void SetHighlighted(UObject* WorldContext, bool IsHighlighted);
	void SetCharacterPerks(UObject* WorldContext, UPlayerCharacterID* characterID, TArray<UPerkAsset*> perks);
	bool IsUsageType(enum class EPerkUsageType InType);
	bool IsPerkAvailableInTier(int32_t Tier);
	bool IsEquippedBy(UObject* WorldContext, UPlayerCharacterID* characterID);
	float GetUseCoolDownTimeLeft(APlayerController* PlayerController);
	float GetUseCoolDownProgress(APlayerController* PlayerController);
	float GetUseCoolDownDuration(APlayerController* PlayerController);
	enum class EPerkUsageType GetUsageType();
	enum class EPerkTierState GetStateAtTier(UObject* WorldContext, int32_t Tier);
	int32_t GetRemainingUseCharges(APlayerController* PlayerController);
	int32_t GetRankTier(int32_t Rank);
	FText GetRankDescription(int32_t Rank);
	int32_t GetRankCost(int32_t Rank);
	bool GetRankAtTier(int32_t Tier, int32_t Rank);
	int32_t GetMaxUseCharges(APlayerController* PlayerController);
	UPerkHUDIconWidget* GetHudIconWidgetClass();
	TArray<UPerkHUDActivationWidget*> GetHudActivationWidgets(enum class EPerkHUDActivationLocation Location);
	UPerkDelegateItem* GetDelegates(UObject* WorldContext);
	int32_t GetCurrentRank(UObject* WorldContext);
	int32_t GetChargesUsed(APlayerController* PlayerController);
	FString GetAdditionalRankDescription(int32_t Rank);
	bool Equip(UObject* WorldContext, UPlayerCharacterID* characterID);
	bool CanUseCharge(APlayerController* PlayerController);
	bool BuyPerkAtTier(UObject* WorldContext, int32_t Tier);
};

// Class FSD.FloatPerkAsset
// Size: 0xe8 (Inherited: 0xc8)
struct UFloatPerkAsset : UPerkAsset {
	TArray<FFloatPerkRank> Ranks; // 0xc8(0x10)
	TArray<FFloatPerkEffect> Effects; // 0xd8(0x10)

	float GetPerkValue(UObject* WorldContext);
	float GetLastTierValue();
	float GetFloatPerkValue(UObject* WorldContext, UFloatPerkAsset* Perk, float UnclaimedValue);
};

// Class FSD.FloatPerkActivation
// Size: 0x30 (Inherited: 0x30)
struct UFloatPerkActivation : UDataAsset {

	void Receive_ActivatePerk(APlayerCharacter* Character, float Value);
};

// Class FSD.StatPerkActivation
// Size: 0x40 (Inherited: 0x30)
struct UStatPerkActivation : UFloatPerkActivation {
	UPawnStat* PawnStat; // 0x30(0x08)
	enum class EPawnStatType StatType; // 0x38(0x01)
};

// Class FSD.FloatPerkComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UFloatPerkComponent : UActorComponent {
	float FloatValue; // 0xb0(0x04)
	APlayerCharacter* PlayerCharacter; // 0xb8(0x08)

	void Receive_OnInitialized();
};

// Class FSD.CreateComponentPerkActivation
// Size: 0x58 (Inherited: 0x30)
struct UCreateComponentPerkActivation : UFloatPerkActivation {
	TSoftClassPtr<UObject> ComponentClass; // 0x30(0x28)
};

// Class FSD.EscapableGrabberEnemyActivation
// Size: 0x58 (Inherited: 0x30)
struct UEscapableGrabberEnemyActivation : UFloatPerkActivation {
	TSoftClassPtr<UObject> EnemyGrabberClass; // 0x30(0x28)
};

// Class FSD.SetCooldownPerkActivation
// Size: 0x30 (Inherited: 0x30)
struct USetCooldownPerkActivation : UFloatPerkActivation {
};

// Class FSD.SetMaxUsesPerkActivation
// Size: 0x30 (Inherited: 0x30)
struct USetMaxUsesPerkActivation : UFloatPerkActivation {
};

// Class FSD.KillNearbyCreaturePerkComponent
// Size: 0xe8 (Inherited: 0xc0)
struct UKillNearbyCreaturePerkComponent : UFloatPerkComponent {
	TSoftClassPtr<UObject> EnemyClass; // 0xc0(0x28)
};

// Class FSD.BezerkPerkComponent
// Size: 0xd0 (Inherited: 0xc0)
struct UBezerkPerkComponent : UFloatPerkComponent {
	UPawnStat* BoostedStat; // 0xc0(0x08)
	float AmountPerValue; // 0xc8(0x04)

	void OnHealthChanged(float Health);
};

// Class FSD.EyeForEyePerkComponent
// Size: 0x100 (Inherited: 0xc0)
struct UEyeForEyePerkComponent : UFloatPerkComponent {
	float Cooldown; // 0xc0(0x04)
	TSoftClassPtr<UObject> EyeForEyeSTE; // 0xc8(0x28)
	UStatusEffect* LoadedSTE; // 0xf8(0x08)

	void OnHit(float Damage, UDamageClass* inDamageClass, AActor* DamageCauser, bool anyHealthLost);
};

// Class FSD.ThornsPerkComponent
// Size: 0xe0 (Inherited: 0xc0)
struct UThornsPerkComponent : UFloatPerkComponent {
	UDamageClass* DamageClass; // 0xc0(0x08)
	float Cooldown; // 0xc8(0x04)
	UStatusEffect* ThornsSTE; // 0xd0(0x08)

	void OnHit(float Damage, UDamageClass* inDamageClass, AActor* DamageCauser, bool anyHealthLost);
};

// Class FSD.SalutePerkComponent
// Size: 0xd0 (Inherited: 0xc0)
struct USalutePerkComponent : UFloatPerkComponent {
	float Cooldown; // 0xc0(0x04)
	float FleeRadius; // 0xc4(0x04)

	void OnSalute();
};

// Class FSD.ShieldLinkComponent
// Size: 0x138 (Inherited: 0xc0)
struct UShieldLinkComponent : UFloatPerkComponent {
	UStatusEffect* BoostedStatusEffect; // 0xc0(0x08)
	UStatusEffect* BoostedStatusEffectInstance; // 0xc8(0x08)
	float LinkDistance; // 0xd0(0x04)
	TSet<APlayerCharacter*> LinkedCharacters; // 0xd8(0x50)
	UStatusEffect* LinkStatusEffect; // 0x128(0x08)

	void TimerFunction();
};

// Class FSD.BeastMasterComponent
// Size: 0xc8 (Inherited: 0xc0)
struct UBeastMasterComponent : UFloatPerkComponent {
	bool ShowCanCharmIcon; // 0xc0(0x01)

	void SetDamage(UDamageComponent* cmp, float dmg);
	UActorComponent* AddPetComponent(UActorComponent* ComponentClass, AFSDPawn* targetPet, APlayerCharacter* petOwner);
};

// Class FSD.PetComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UPetComponent : UActorComponent {
	TWeakObjectPtr<APlayerCharacter> OwningPlayer; // 0xb0(0x08)

	void ReceiveOwningPlayerChanged();
};

// Class FSD.BeastMasterUseSphere
// Size: 0x410 (Inherited: 0x410)
struct UBeastMasterUseSphere : USphereComponent {
};

// Class FSD.FloodFillSettings
// Size: 0x68 (Inherited: 0x30)
struct UFloodFillSettings : UDataAsset {
	FVector NoiseSize; // 0x30(0x0c)
	float FreqMultiplier; // 0x3c(0x04)
	float AmplitudeMultiplier; // 0x40(0x04)
	float MinValue; // 0x44(0x04)
	float MaxValue; // 0x48(0x04)
	bool Turbulence; // 0x4c(0x01)
	bool Invert; // 0x4d(0x01)
	int32_t Octaves; // 0x50(0x04)
	TArray<FLayeredNoise> NoiseLayers; // 0x58(0x10)
};

// Class FSD.DetailNoise
// Size: 0x70 (Inherited: 0x68)
struct UDetailNoise : UFloodFillSettings {
	float NoiseRange; // 0x68(0x04)
};

// Class FSD.FlyingStateComponent
// Size: 0xf8 (Inherited: 0xf8)
struct UFlyingStateComponent : UCharacterStateComponent {
};

// Class FSD.ForgingFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UForgingFunctionLibrary : UBlueprintFunctionLibrary {

	void SortSchematicDelegate__DelegateSignature(USchematic* Schematic1, USchematic* Schematic2, bool FirstIsLarger);
	USchematic* GiveForginMasteryReward(UObject* WorldContextObject);
	bool GiveForgingXP(UObject* WorldContextObject);
	TArray<USchematic*> GetOwnedSchematicsSorted(UObject* WorldContextObject, bool SmallestFirst, FDelegate IsLargerThan);
	TArray<USchematic*> GetOwnedSchematics(UObject* WorldContextObject);
	enum class ESchematicType GetNextForgingMasterRewardType(UObject* WorldContextObject);
	int32_t GetForgingXP(UObject* WorldContextObject);
	float GetForgingLevelProgress(UObject* WorldContextObject);
	int32_t GetForgingLevel(UObject* WorldContextObject);
	TArray<USchematic*> GetForgedSchematics(UObject* WorldContextObject);
	TArray<USchematic*> GetAllSchematicsSorted(UObject* WorldContextObject, bool SmallestFirst, FDelegate IsLargerThan);
	TArray<USchematic*> GetAllSchematics(UObject* WorldContextObject);
};

// Class FSD.FormationData
// Size: 0xd0 (Inherited: 0x30)
struct UFormationData : UDataAsset {
	TArray<FFormationDataItem> FormationItems; // 0x30(0x10)
	FGameplayTagQuery LeaderQuery; // 0x40(0x48)
	FGameplayTagQuery MemberQuery; // 0x88(0x48)
};

// Class FSD.GroundFormationData
// Size: 0xe0 (Inherited: 0xd0)
struct UGroundFormationData : UFormationData {
	int32_t FormationSize; // 0xd0(0x04)
	float FormationSpread; // 0xd4(0x04)
	float RandomSpread; // 0xd8(0x04)
};

// Class FSD.FlyingFormationData
// Size: 0xe0 (Inherited: 0xd0)
struct UFlyingFormationData : UFormationData {
	int32_t FormationSize; // 0xd0(0x04)
	float FormationSpread; // 0xd4(0x04)
	float RandomSpread; // 0xd8(0x04)
};

// Class FSD.FormationsManagerComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UFormationsManagerComponent : UActorComponent {
	UEnemySpawnManager* SpawnManager; // 0xb0(0x08)
	TArray<UFormationData*> FormationData; // 0xb8(0x10)
};

// Class FSD.FragileDebrisCleaner
// Size: 0x200 (Inherited: 0x1f0)
struct UFragileDebrisCleaner : USceneComponent {
	float CleanRadius; // 0x1f0(0x04)
};

// Class FSD.FriendlyHealthComponent
// Size: 0x288 (Inherited: 0x248)
struct UFriendlyHealthComponent : UHealthComponent {
	float MaxHealth; // 0x24c(0x04)
	float friendlyFireModifier; // 0x250(0x04)
	float NeutralDamageModifier; // 0x254(0x04)
	float BigHitDamageModifier; // 0x258(0x04)
	float BigHitDamageReductionThreshold; // 0x25c(0x04)
	UParticleSystem* GenericImpactParticles; // 0x260(0x08)

	float GetMaxHealth();
};

// Class FSD.FrozenStateComponent
// Size: 0x128 (Inherited: 0xf8)
struct UFrozenStateComponent : UCharacterStateComponent {
	FRandRange DeFrostAmount; // 0xf8(0x08)
	USoundBase* AudioFreeFromIce; // 0x100(0x08)
	UFSDPhysicalMaterial* IcePhysicalMaterial; // 0x108(0x08)
	UFSDPhysicalMaterial* DwarfFleshMaterial; // 0x110(0x08)
	float SlowAnimationSpeed; // 0x11c(0x04)

	void Server_ThawPlayer();
	void ReceiveOnDefrosting();
};

// Class FSD.FSDAchievement
// Size: 0x158 (Inherited: 0x58)
struct UFSDAchievement : USavableDataAsset {
	FString SteamAPIAchievementName; // 0x88(0x10)
	FString SteamAPIStatName; // 0x98(0x10)
	FString XboxAchievementID; // 0xa8(0x10)
	float AchievementTargetValue; // 0xb8(0x04)
	enum class EFSDAchievementType AchievementType; // 0xc0(0x01)

	void SetAchievementProgressForEntireServer(float Progress, UObject* WorldContext);
	void SetAchievementProgress(float Progress, AFSDPlayerController* Player, UObject* WorldContext);
	void ResetStatForAchievement(UFSDAchievement* AchievementToReset, AFSDPlayerController* Player);
	float GetAchievementTargetValue();
};

// Class FSD.AchievementList
// Size: 0x1a0 (Inherited: 0x30)
struct UAchievementList : UDataAsset {
	UFSDAchievement* WeakspotAchievement; // 0x30(0x08)
	UFSDAchievement* MissionTimeAchievement; // 0x38(0x08)
	UFSDAchievement* MissionHosterAchievement; // 0x40(0x08)
	UFSDAchievement* RollerCoasterAchievement; // 0x48(0x08)
	UFSDAchievement* DrillByShootingAchievement; // 0x50(0x08)
	UFSDAchievement* BarrelKickerAchievement; // 0x58(0x08)
	UFSDAchievement* Hazard3CompletedAchievement; // 0x60(0x08)
	UFSDAchievement* Hazard3StreakAchievement; // 0x68(0x08)
	UFSDAchievement* Hazard4CompletedAchievement; // 0x70(0x08)
	UFSDAchievement* Hazard4StreakAchievement; // 0x78(0x08)
	UFSDAchievement* Hazard5CompletedAchievement; // 0x80(0x08)
	UFSDAchievement* Hazard5StreakAchievement; // 0x88(0x08)
	UFSDAchievement* Hazard3NoKillNoSupplyAchievement; // 0x90(0x08)
	UFSDAchievement* Hazard4NoKillNoSupplyAchievement; // 0x98(0x08)
	UFSDAchievement* Hazard5NoKillNoSupplyAchievement; // 0xa0(0x08)
	UFSDAchievement* PlayedWithLowerRankAchievement; // 0xa8(0x08)
	UFSDAchievement* MilestoneAchievementPerfMatters; // 0xb0(0x08)
	UFSDAchievement* MilestoneAchievement; // 0xb8(0x08)
	UFSDAchievement* OwnedPerkAchievement; // 0xc0(0x08)
	UFSDAchievement* MovingOnUpAchievement; // 0xc8(0x08)
	UFSDAchievement* CorporateClimberAchievement; // 0xd0(0x08)
	UFSDAchievement* HatTrickAchievement; // 0xd8(0x08)
	UFSDAchievement* FullTeamAchievement; // 0xe0(0x08)
	UFSDAchievement* SilverTierEmployeeAchievement; // 0xe8(0x08)
	UFSDAchievement* ProTeamAchievement; // 0xf0(0x08)
	UFSDAchievement* GoldTierEmployeeAchievement; // 0xf8(0x08)
	UFSDAchievement* LegendaryTeamAchievement; // 0x100(0x08)
	UFSDAchievement* AllVanityEquippedAchievement; // 0x108(0x08)
	UFSDAchievement* MoustacheBuyerAchievement; // 0x110(0x08)
	UFSDAchievement* MutatorAchievement; // 0x118(0x08)
	UFSDAchievement* StateOfTheArtAchievement; // 0x120(0x08)
	UFSDAchievement* ExploringMyOptionsAchievement; // 0x128(0x08)
	UFSDAchievement* AdvancedRoboticsAchievement; // 0x130(0x08)
	UFSDAchievement* WithoutAPaddleAchievement; // 0x138(0x08)
	UFSDAchievement* FirstMissionCompleted; // 0x140(0x08)
	UFSDAchievement* HundredMissionsCompleted; // 0x148(0x08)
	UFSDAchievement* TenSoloMissionsCompleted; // 0x150(0x08)
	UFSDAchievement* SupplyPodsCalledStat; // 0x158(0x08)
	UFSDAchievement* LootbugsKilledStat; // 0x160(0x08)
	UFSDAchievement* PraetoriansKilledStat; // 0x168(0x08)
	UFSDAchievement* NormalDeepDiveCompleted; // 0x170(0x08)
	UFSDAchievement* EliteDeepDiveCompleted; // 0x178(0x08)
	UFSDAchievement* DeepDiveCompletedUnderTime; // 0x180(0x08)
	UFSDAchievement* DeepDivesCompleted; // 0x188(0x08)
	TArray<UFSDAchievement*> AllAchievements; // 0x190(0x10)
};

// Class FSD.FSDAdvancedLabel
// Size: 0x268 (Inherited: 0x230)
struct UFSDAdvancedLabel : UUserWidget {
	FText FormattedText; // 0x230(0x18)
	FText ControllerOverrideText; // 0x248(0x18)
	bool UpperCase; // 0x260(0x01)
	enum class EFSDInputSource PreviewAs; // 0x261(0x01)

	void SetText(FText NewText, FText OverrideControllerText);
	void SetAlwaysShowAs(enum class EFSDInputSource InPreferredSource);
	void Refresh();
	void OnReset();
	void OnNewLine(int32_t Index);
	void OnLanguageChanged(FString NewCulture);
	void OnInputSourceChanged(enum class EFSDInputSource Source);
	void OnAddString(FString Value);
	void OnAddKeyName(FString Name);
	void OnAddIcon(FString Name, FActionIconMapping Icon);
	FText GetText();
	bool GetIsDesignTime();
	enum class EFSDInputSource GetCurrentInputSource();
	UTextBlock* CreateTextBlock(FString Text, FSlateFontInfo InFontInfo, FLinearColor Color);
	UImage* CreateImageSized(UTexture2D* Texture, int32_t Width, int32_t Height);
	UImage* CreateImage(UTexture2D* Texture, bool MatchSize);
	UHorizontalBox* CreateHorizontalBox();
};

// Class FSD.GamepadCursorSettings
// Size: 0x48 (Inherited: 0x38)
struct UGamepadCursorSettings : UDeveloperSettings {
	float MaxSpeed; // 0x38(0x04)
	float Acceleration; // 0x3c(0x04)
	float StickySlowDown; // 0x40(0x04)
	float DeadZone; // 0x44(0x04)
};

// Class FSD.AnimNotify_PlaySound2D
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PlaySound2D : UAnimNotify {
	USoundBase* Sound; // 0x38(0x08)
	float VolumeMultiplier; // 0x40(0x04)
	float PitchMultiplier; // 0x44(0x04)
};

// Class FSD.AnimNotifyState_PlaySound
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	USoundCue* Sound; // 0x30(0x08)
	FName SocketName; // 0x38(0x08)
	FVector LocationOffset; // 0x40(0x0c)
	FRotator RotationOffset; // 0x4c(0x0c)
};

// Class FSD.AnimNotify_FSDPlayParticleEffect
// Size: 0x90 (Inherited: 0x38)
struct UAnimNotify_FSDPlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38(0x08)
	FVector LocationOffset; // 0x40(0x0c)
	FRotator RotationOffset; // 0x4c(0x0c)
	bool AlwaysZUp; // 0x58(0x01)
	FVector Scale; // 0x5c(0x0c)
	char Attached : 1; // 0x80(0x01)
	FName SocketName; // 0x84(0x08)
	bool IsFirstPerson; // 0x8c(0x01)
	bool UseTerainMaterial; // 0x8d(0x01)
};

// Class FSD.EnemyPlaySoundKey
// Size: 0x30 (Inherited: 0x30)
struct UEnemyPlaySoundKey : UDataAsset {
};

// Class FSD.EnemyPlaySoundByKeyAnimNotify
// Size: 0x58 (Inherited: 0x38)
struct UEnemyPlaySoundByKeyAnimNotify : UAnimNotify {
	UEnemyPlaySoundKey* SoundKey; // 0x38(0x08)
	float VolumeMultiplier; // 0x40(0x04)
	float PitchMultiplier; // 0x44(0x04)
	char bFollow : 1; // 0x48(0x01)
	FName AttachName; // 0x4c(0x08)
};

// Class FSD.AnimNotify_PushSoundMix
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PushSoundMix : UAnimNotify {
	USoundMix* SoundMix; // 0x38(0x08)
	float MaxDistance; // 0x40(0x04)
};

// Class FSD.AnimNotifyState_SoundMix
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_SoundMix : UAnimNotifyState {
	USoundMix* SoundMix; // 0x30(0x08)
	float MaxDistance; // 0x38(0x04)
};

// Class FSD.EnemySpawnEffectsKey
// Size: 0x30 (Inherited: 0x30)
struct UEnemySpawnEffectsKey : UDataAsset {
};

// Class FSD.EnemySpawnEffectsByKeyAnimNotify
// Size: 0x50 (Inherited: 0x38)
struct UEnemySpawnEffectsByKeyAnimNotify : UAnimNotify {
	UEnemySpawnEffectsKey* EffectKey; // 0x38(0x08)
	char Attached : 1; // 0x40(0x01)
	FName SocketName; // 0x44(0x08)
};

// Class FSD.AnimNotifyState_EnemyPlaySoundByKey
// Size: 0x60 (Inherited: 0x30)
struct UAnimNotifyState_EnemyPlaySoundByKey : UAnimNotifyState {
	UEnemyPlaySoundKey* SoundKey; // 0x30(0x08)
	float FadeOut; // 0x38(0x04)
	FName SocketName; // 0x3c(0x08)
	FVector LocationOffset; // 0x44(0x0c)
	FRotator RotationOffset; // 0x50(0x0c)
};

// Class FSD.AnimNotify_CameraShake
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_CameraShake : UAnimNotify {
	float InnerRadius; // 0x38(0x04)
	float OuterRadius; // 0x3c(0x04)
	bool ControllerOnly; // 0x40(0x01)
	UCameraShake* CameraShake; // 0x48(0x08)
};

// Class FSD.AnimNotify_Shout
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_Shout : UAnimNotify {
	UDialogDataAsset* Shout; // 0x38(0x08)
	bool ShoutNetworked; // 0x40(0x01)
	float LocalShoutVolumeMultiplier; // 0x44(0x04)
};

// Class FSD.AnimNotify_FootStep
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_FootStep : UAnimNotify {
	bool IsLeft; // 0x38(0x01)
};

// Class FSD.AnimNotify_MessageOwner
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_MessageOwner : UAnimNotify {
	FName Message; // 0x38(0x08)
};

// Class FSD.AnimNotify_TerrainFootStep
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_TerrainFootStep : UAnimNotify {
	UParticleSystem* ParticleTemplate; // 0x38(0x08)
	FName BoneName; // 0x40(0x08)
};

// Class FSD.AnimNotify_SpawnActor
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotify_SpawnActor : UAnimNotify {
	AActor* Actor; // 0x38(0x08)
	FName SocketName; // 0x40(0x08)
	FVector LocationOffset; // 0x48(0x0c)
	FRotator RotationOffset; // 0x54(0x0c)
};

// Class FSD.AnimNotifyState_SpawnMesh
// Size: 0x68 (Inherited: 0x30)
struct UAnimNotifyState_SpawnMesh : UAnimNotifyState {
	UStaticMesh* Mesh; // 0x30(0x08)
	bool UseFirstPersonComponent; // 0x38(0x01)
	FName SocketName; // 0x3c(0x08)
	FVector ScaleOverride; // 0x44(0x0c)
	FVector LocationOffset; // 0x50(0x0c)
	FRotator RotationOffset; // 0x5c(0x0c)
};

// Class FSD.AnimNotifyState_SpawnSkeletalMesh
// Size: 0x70 (Inherited: 0x30)
struct UAnimNotifyState_SpawnSkeletalMesh : UAnimNotifyState {
	USkeletalMesh* Mesh; // 0x30(0x08)
	UAnimSequenceBase* AnimationToPlay; // 0x38(0x08)
	bool UseFirstPersonComponent; // 0x40(0x01)
	FName SocketName; // 0x44(0x08)
	FVector ScaleOverride; // 0x4c(0x0c)
	FVector LocationOffset; // 0x58(0x0c)
	FRotator RotationOffset; // 0x64(0x0c)
};

// Class FSD.AnimNotifyState_SpawnSkinnedMesh
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_SpawnSkinnedMesh : UAnimNotifyState {
	enum class EItemCategory ItemCategory; // 0x30(0x01)
	bool UseFirstPersonComponent; // 0x31(0x01)
	FName SocketName; // 0x34(0x08)
	FVector LocationOffset; // 0x3c(0x0c)
	FRotator RotationOffset; // 0x48(0x0c)
};

// Class FSD.AnimNotifyState_HideBone
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_HideBone : UAnimNotifyState {
	FName BoneName; // 0x30(0x08)
};

// Class FSD.AnimNotifyState_Salute
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_Salute : UAnimNotifyState {
	FName BoneName; // 0x30(0x08)
	bool FirstPerson; // 0x38(0x01)
};

// Class FSD.AnimNotifyState_InputWindow
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_InputWindow : UAnimNotifyState {
};

// Class FSD.SpawnReleasedActor
// Size: 0x28 (Inherited: 0x28)
struct USpawnReleasedActor : UInterface {

	bool Released();
	bool Attached(AActor* Parent);
};

// Class FSD.AnimNotifyState_SpawnAndReleaseActor
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_SpawnAndReleaseActor : UAnimNotifyState {
	AActor* Actor; // 0x30(0x08)
	FName SocketName; // 0x38(0x08)
	FVector LocationOffset; // 0x40(0x0c)
	FRotator RotationOffset; // 0x4c(0x0c)
};

// Class FSD.AnimNotifyState_HideEquippedItem
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_HideEquippedItem : UAnimNotifyState {
};

// Class FSD.AnimNotifyState_OverrideItemOffset
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_OverrideItemOffset : UAnimNotifyState {
	FVector CameraOffset; // 0x30(0x0c)
};

// Class FSD.AnimNotifyState_WeaponReload
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_WeaponReload : UAnimNotifyState {
};

// Class FSD.AnimNotifyState_ConstrainItem
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_ConstrainItem : UAnimNotifyState {
	FName OldConstraint; // 0x30(0x08)
	FName NewConstraint; // 0x38(0x08)
};

// Class FSD.GameAnimationsSettings
// Size: 0x68 (Inherited: 0x38)
struct UGameAnimationsSettings : UDeveloperSettings {
	FSoftObjectPath FootstepTestingSound; // 0x38(0x18)
	FSoftObjectPath FootstepTestingParticles; // 0x50(0x18)
};

// Class FSD.DynamicMeshScaler
// Size: 0xc0 (Inherited: 0xb0)
struct UDynamicMeshScaler : UActorComponent {
};

// Class FSD.AnimNotifyState_TimedParticleEffectWithImpactDecals
// Size: 0x80 (Inherited: 0x60)
struct UAnimNotifyState_TimedParticleEffectWithImpactDecals : UAnimNotifyState_TimedParticleEffect {
	UMaterialInterface* DecalMaterial; // 0x60(0x08)
	float DecalSize; // 0x68(0x04)
	float FadeStartDelay; // 0x6c(0x04)
	float FadeDuration; // 0x70(0x04)

	void OnParticleCollision(FName EventName, float EmitterTime, int32_t ParticleTime, FVector Location, FVector Velocity, FVector Direction, FVector Normal, FName BoneName, UPhysicalMaterial* PhysMat);
};

// Class FSD.FSDAnimationFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFSDAnimationFunctionLibrary : UBlueprintFunctionLibrary {

	float GetAnimSequenceLength(UAnimSequence* AnimSequence);
};

// Class FSD.FSDAssetManager
// Size: 0x438 (Inherited: 0x438)
struct UFSDAssetManager : UAssetManager {
};

// Class FSD.FSDBehaviorTreeComponent
// Size: 0x270 (Inherited: 0x270)
struct UFSDBehaviorTreeComponent : UBehaviorTreeComponent {
};

// Class FSD.FSDCheatManager
// Size: 0xb8 (Inherited: 0x78)
struct UFSDCheatManager : UCheatManager {
	int32_t RoomJumpCount; // 0x78(0x04)
	float PreviousMaxDistanceBeforeCleanup; // 0x7c(0x04)
	bool UnlimitedScoutFlareDuration; // 0x80(0x01)
	FMulticastInlineDelegate ToggleHoopGameMovement; // 0x88(0x10)
	AActor* SpawnPosMarker; // 0x98(0x08)
	bool EscortShowSmartRockDebug; // 0xa0(0x01)
	bool IsUsingSavedCheats; // 0xa1(0x01)

	void SwitchCharacter(APlayerCharacter* NewCharacter);
	void SpawnEnemies(UEnemyDescriptor* desscriptor, int32_t count);
	void SpawnCritters(UCritterDescriptor* descriptor, int32_t count);
	void SpawnBosco(TSoftClassPtr<UObject> droneClass, AFSDAIController* aControllerClass);
	void ShowTutorialDebug();
	void SetStandingDown(bool standingDown);
	void SetSpawnEnemies(bool SpawnEnemies);
	void SetQuadPickAxe(bool quad);
	void SetHUDVisible(bool ShowHUD);
	void SetGodMode(bool God);
	void SetFastMovement(bool fast);
	void ResetTutorials();
	void ResetSpacerigIntroMessage();
	void R_RemoveResources(int32_t Number);
	void R_RemoveCredits(int32_t Number);
	void R_AddResources(int32_t Number);
	void R_AddPerkPoints(int32_t amount);
	void R_AddNitra(float amount);
	void R_AddMorkite(float amount);
	void R_AddMatrixCores(int32_t Number);
	void R_AddHollomite(float amount);
	void R_AddGold(float amount);
	void R_AddDystrum(float amount);
	void R_AddCredits(int32_t Number);
	void R_AddCraftingResource(int32_t amount, int32_t Type);
	void R_Add_BitterGem(int32_t amount);
	void R_Add_Aquarq(int32_t amount);
	bool IsInGodMode();
	void GetListOfRoomNames(TArray<FString> roomNames);
	void DestroyAllInstances(AActor* destroy);
	void Cheat_UnlockAllWeapons(UObject* WorldContextObject);
	void Cheat_UnlockAllUpgrades(UObject* WorldContextObject);
	void Cheat_UnlockAll_Poses(UObject* WorldContextObject);
	void Cheat_UnlockAll_Beers(UObject* WorldContextObject);
	void Cheat_SetSpawnPosMarker(AActor* Actor);
	void Cheat_SetHealth(float newHealthValue, APlayerCharacter* Player);
	void Cheat_Schematic_UnlockAll(UObject* WorldContextObject);
	void Cheat_Schematic_ResetAll(UObject* WorldContextObject);
	void Cheat_Schematic_GiveRandom(UObject* WorldContextObject);
	void Cheat_Schematic_ForgeAll(UObject* WorldContextObject);
	void Cheat_Resources(UObject* WorldContextObject, int32_t amount);
	void Cheat_ResetEquippedUpgrades(UObject* WorldContextObject);
	void Cheat_RemoveResources(UObject* WorldContextObject, int32_t amount);
	void Cheat_PickAxeVanity_UnlockAll(UObject* WorldContextObject);
	void Cheat_PickAxeVanity_ResetAll(UObject* WorldContextObject);
	void Cheat_MinersManual_ShowAll(UObject* WorldContextObject);
	void Cheat_GenerateNewMissionSeed(UObject* WorldContextObject, bool Enabled);
	void Cheat_ForceTreasure(UObject* WorldContextObject);
	void Cheat_ForceLostPack(UObject* WorldContextObject);
	void Cheat_DeepDives_Refresh(UObject* WorldContextObject);
	void Cheat_Campaign_Complete(UObject* WorldContextObject);
	void Cheat_Campaign_Advance(UObject* WorldContextObject);
	void Cheat_AddXP(UObject* WorldContextObject, int32_t amount);
	void Cheat_AddPerkPoints(UObject* WorldContextObject, int32_t amount);
	void Cheat_AddCredits(UObject* WorldContextObject, int32_t amount);
	void C_UnlockOverclocking();
	void C_UnlockAll_WeaponUpgrades();
	void C_UnlockAll_WeaponSkins_Paintjobs();
	void C_UnlockAll_WeaponSkins_Frameworks();
	void C_UnlockAll_WeaponSkins();
	void C_UnlockAll_Weapons();
	void C_UnlockAll_StoreVanity();
	void C_UnlockAll_Poses_ForAll();
	void C_UnlockAll_Poses();
	void C_UnlockAll_PickaxeParts();
	void C_UnlockAll_Perks();
	void C_UnlockAll_Drinks();
	void C_UnlockAll_Beers();
	void C_UnlockAll_ArmorMats();
	void C_UnlockAll();
	void C_Treasures_Track(bool Track);
	void C_Treasures_Reward(int32_t count);
	void C_ToggleHoopGameMovement();
	void C_ToggleFadingEnabled();
	void C_ToggleFadingDebug();
	void C_ToggleCanShowBlood();
	void C_SpawnScriptedWaveIndex(int32_t Index);
	void C_SpawnScriptedWave();
	void C_SpawnNormalWave();
	void C_SpawnEvenRewarder();
	void C_SpawnBarrelOnPlayer(int32_t amount);
	void C_SetUseSavedCheatsByDefault(bool useSavedCheats);
	void C_SetTestMission(int32_t missionIndex);
	void C_SetSavedCheats();
	void C_SetPlayers(int32_t Number);
	void C_SetHealth(float Health);
	void C_SetFlyMode(bool flyEnabled);
	void C_SetFastFlares();
	void C_SetEnglish(int32_t Val);
	void C_SetDancing(bool shouldDance);
	void C_SetAmmoCostEnabled(bool Enabled);
	void C_ScoutFlareInfiniteDuration(bool Enabled);
	void C_Schematics_UnlockAll();
	void C_Schematics_ResetAll();
	void C_Schematics_ForgeAll();
	void C_Schematics_ClearHasSeenFirstMessage();
	void C_Schematic_GiveRandom();
	void C_Revive();
	void C_Resupply();
	void C_ResetSteamAchievementStats();
	void C_ResetForgingXP();
	void C_ResetCheatedResources(int32_t newAmount);
	void C_ResetAchievements();
	void C_Reset_YearTwoGifts();
	void C_Reset_WeaponSkinsAndUpgrades();
	void C_Reset_WeaponSkins_Paintjobs();
	void C_Reset_WeaponSkins_Framworks();
	void C_Reset_WeaponSkins();
	void C_Reset_PickaxeParts();
	void C_Reset_Perks();
	void C_Reset_MinersManual();
	void C_Reset_EnemyKillCount();
	void C_Reset_Drinks();
	void C_RemovePlayerRanks(int32_t Number);
	void C_RemoveAllWidgets();
	void C_RefreshDailyDeal(int32_t Seed);
	void C_Refinery_BreakPipes();
	void C_RecordMode();
	void C_Promotion_SetLevelSpecific(APlayerCharacter* onCharacter, int32_t Number);
	void C_Promotion_SetLevel(int32_t Number);
	void C_Promotion_SetCampaignComplete();
	void C_Promotion_ClearRewardsSeen();
	void C_ProjectileDebugPrintToggle();
	void C_MissionMap_ForceWarning(int32_t Index);
	void C_MissionMap_ForceAnomaly(int32_t Index);
	void C_MissionMap_DoubleWarning(int32_t indexA, int32_t indexB);
	void C_MinersManual_EnableWorkInProgress(UObject* WorldContextObject);
	void C_MachineEvents_Track(bool Track);
	void C_MachineEvents_FinishCurrent();
	void C_LevelUpCharacter(int32_t amount);
	void C_KillAll();
	void C_JumpToNextRoom();
	void C_IncrementAllMissionStats(int32_t amount);
	void C_GodMode();
	void C_GiveAllGenericHeroItems();
	void C_GameDLC_ResetAnnouncements();
	void C_FSDEvent_SetDebugEvent(FString EventName);
	void C_FSDEvent_ClearSeenRewards();
	void C_FixedPLSSeed(int32_t Seed);
	void C_FixedMissionSeed(int32_t Seed);
	void C_FailMission();
	void C_FadeFromBlack(UObject* WorldContextObject);
	void C_Facility_DisableShields();
	void C_Escort_ShowSmartRockDebug(bool shouldShow);
	void C_Escort_SetMuleSpeed(UObject* WorldContextObject, float Speed);
	void C_Escort_JumpToNextPhase(UObject* WorldContextObject);
	void C_Escort_AddOilShale(int32_t Number);
	void C_DeepDives_UnlockAll();
	void C_DeepDives_SetSeed(int32_t Seed);
	void C_DeepDives_Reset();
	void C_DeepDives_Refresh();
	void C_DeepDives_List();
	void C_CompleteObjectives();
	void C_CompleteMission();
	void C_ClearAllMissionStats();
	void C_ClearAllMilestones();
	void C_ChangeIntoxication(int32_t Percent);
	void C_Campaign_ResetProgress();
	void C_Campaign_ResetCompleted();
	void C_Campaign_CompleteCurrent();
	void C_Campaign_Advance();
	void C_AutoRotateMissionMap(bool Enabled);
	void C_AddXP(int32_t Number);
	void C_AddUncappedXP(int32_t amount);
	void C_AddForgingXP(int32_t Number);
};

// Class FSD.FSDCloudLoadSave
// Size: 0x60 (Inherited: 0x28)
struct UFSDCloudLoadSave : UObject {
	FMulticastInlineDelegate OnCloudLoadAll; // 0x28(0x10)
	FMulticastInlineDelegate OnCloudLoadAllFailed; // 0x38(0x10)
	FString SteamBranch; // 0x48(0x10)
	int32_t NumFailedSaves; // 0x58(0x04)

	void StartCloudLoadAll(UObject* WorldContextObject, int32_t Index);
};

// Class FSD.FSDCreateSessionCallbackProxy
// Size: 0x98 (Inherited: 0x30)
struct UFSDCreateSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	FMulticastInlineDelegate OnFailure; // 0x40(0x10)

	UFSDCreateSessionCallbackProxy* FSDCreateSession(UObject* WorldContextObject, APlayerController* PlayerController, int32_t PublicConnections, bool bUseLAN, bool bFriendsOnly);
};

// Class FSD.FSDCustomDPIScalingRule
// Size: 0x28 (Inherited: 0x28)
struct UFSDCustomDPIScalingRule : UDPICustomScalingRule {
};

// Class FSD.FSDEvent
// Size: 0x100 (Inherited: 0x30)
struct UFSDEvent : UDataAsset {
	FMulticastInlineDelegate OnActiveChanged; // 0x30(0x10)
	FName EventName; // 0x40(0x08)
	FGuid SavegameID; // 0x48(0x10)
	bool bHasClaimableRewards; // 0x58(0x01)
	bool bFreeBeerEvent; // 0x59(0x01)
	TArray<TSoftClassPtr<UObject>> EventDebris; // 0x60(0x10)
	TArray<TSoftObjectPtr<UWorld>> SpacerigSublevels; // 0x70(0x10)
	FClaimableRewardView ClaimableRewards; // 0x80(0x70)
	TArray<TSoftClassPtr<UObject>> Campaigns; // 0xf0(0x10)

	void MarkClaimableRewardsSeen(UObject* WorldContext);
	bool IsFsdEventActive(UObject* WorldContext, UFSDEvent* FSDEvent);
	bool HasUnseenClaimableRewards(UObject* WorldContext);
	bool GiveRewards(APlayerController* PlayerController);
	bool GetIsActive(UObject* WorldContext);
};

// Class FSD.FSDEventCollection
// Size: 0x90 (Inherited: 0x30)
struct UFSDEventCollection : UDataAsset {
	TSet<UFSDEvent*> Events; // 0x30(0x50)
	FMulticastInlineDelegate OnEventActiveChanged; // 0x80(0x10)

	UFSDEvent* FindEventHandler(FName EventName);
	TArray<UFSDEvent*> FindAllEventHandlers(FName EventName);
};

// Class FSD.FSDEventManager
// Size: 0x120 (Inherited: 0x30)
struct UFSDEventManager : UGameInstanceSubsystem {
	FMulticastInlineDelegate OnFSDEventsRefresh; // 0x30(0x10)
	FMulticastInlineDelegate OnEventActiveChanged; // 0x40(0x10)
	TSet<FName> PendingActiveEvents; // 0x50(0x50)
	TSet<FName> ActiveEvents; // 0xa0(0x50)
	int32_t NumFailedRequests; // 0xf0(0x04)
	bool BackendDataValid; // 0xf4(0x01)
	FDateTime LastRequestTime; // 0xf8(0x08)
	float NextCheckTime; // 0x100(0x04)

	bool IsEventActive(UFSDEvent* FSDEvent);
	TArray<UFSDEvent*> GetActiveEventHandlers();
	void FSDEventsRefreshDelegate__DelegateSignature();
	bool FSDEventsReady();
};

// Class FSD.FSDFindSessionsCallbackProxy
// Size: 0xb0 (Inherited: 0x30)
struct UFSDFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	FMulticastInlineDelegate OnRefresh; // 0x50(0x10)
	UObject* WorldContextObject; // 0x98(0x08)
	UFSDFindSteamSessions* FSDFindSteamSessions; // 0xa0(0x08)

	void OnFSDCompleted(bool bSuccess, TArray<FBlueprintSessionResult> Results);
	void ManualRefreshServerList();
	UFSDFindSessionsCallbackProxy* FSDFindSessions(UObject* WorldContextObject, APlayerController* PlayerController, int32_t MaxResults, bool bUseLAN);
	UFSDFindSessionsCallbackProxy* FSDFindFullSessions(UObject* WorldContextObject, APlayerController* PlayerController, int32_t MaxResults);
};

// Class FSD.FSDFlyingBugController
// Size: 0x390 (Inherited: 0x358)
struct AFSDFlyingBugController : AFSDAIController {
	UBehaviorTree* BehaviourTree; // 0x370(0x08)
	float UpdateLosInterval; // 0x380(0x04)
	bool SetTargetOnAlert; // 0x384(0x01)
	bool SyncTargetWithBB; // 0x385(0x01)

	void OnFlyingBugAlerted();
};

// Class FSD.DashingFlyingBugController
// Size: 0x390 (Inherited: 0x390)
struct ADashingFlyingBugController : AFSDFlyingBugController {
};

// Class FSD.FSDFriendsAndInvites
// Size: 0x78 (Inherited: 0x28)
struct UFSDFriendsAndInvites : UObject {
	FMulticastInlineDelegate OnFriendsChanged; // 0x28(0x10)
	FMulticastInlineDelegate OnFriendInvitesChanged; // 0x38(0x10)
	FMulticastInlineDelegate OnRequestRefresh; // 0x48(0x10)
	TArray<FBlueprintFriend> Friends; // 0x58(0x10)
	TArray<FBlueprintFriend> FriendInvites; // 0x68(0x10)

	void Init();
};

// Class FSD.MissionResultInfo
// Size: 0xa8 (Inherited: 0x28)
struct UMissionResultInfo : UObject {
	bool HasInfo; // 0x28(0x01)
	float MissionTime; // 0x2c(0x04)
	float MissionTotalHazBonus; // 0x30(0x04)
	FText MissionHazName; // 0x38(0x18)
	float MissionHazBonus; // 0x50(0x04)
	float ComplexityBonus; // 0x54(0x04)
	int32_t ComplexityDots; // 0x58(0x04)
	float LenghtBonus; // 0x5c(0x04)
	int32_t LenghtDots; // 0x60(0x04)
	TArray<FText> WarningTitles; // 0x68(0x10)
	TArray<UTexture2D*> WarningIcons; // 0x78(0x10)
	TArray<float> WarningBonusses; // 0x88(0x10)
	float TotalCreditsSum; // 0x98(0x04)
	float TotalXPSum; // 0x9c(0x04)
	bool WasSuccess; // 0xa0(0x01)

	float GetWarningBonusSum();
};

// Class FSD.CampaignNotification
// Size: 0x40 (Inherited: 0x28)
struct UCampaignNotification : UObject {
	UCampaign* Campaign; // 0x28(0x08)
	UCampaignMission* mission; // 0x30(0x08)
	int32_t Progress; // 0x38(0x04)
	bool bIsCampaignCompleted; // 0x3c(0x01)
};

// Class FSD.FSDGameInstance
// Size: 0xd70 (Inherited: 0x198)
struct UFSDGameInstance : UGameInstance {
	FMulticastInlineDelegate OnTemporaryBuffChanged; // 0x1a0(0x10)
	FMulticastInlineDelegate OnGameSettingsChanged; // 0x1b0(0x10)
	FMulticastInlineDelegate OnGraphicsSettingsChanged; // 0x1c0(0x10)
	FMulticastInlineDelegate OnPressStart; // 0x1d0(0x10)
	FMulticastInlineDelegate OnJoinPendingInvite; // 0x1e0(0x10)
	FMulticastInlineDelegate OnSkinChangedEvent; // 0x1f0(0x10)
	FMulticastInlineDelegate OnLoaderStart; // 0x200(0x10)
	FMulticastInlineDelegate OnPlayLevelSequenceInCharacterWorld; // 0x210(0x10)
	FMulticastInlineDelegate OnLoaderStop; // 0x220(0x10)
	FMulticastInlineDelegate OnCharacterSelectionStart; // 0x230(0x10)
	FMulticastInlineDelegate OnStartForging; // 0x240(0x10)
	FMulticastInlineDelegate OnForgingDone; // 0x250(0x10)
	FMulticastInlineDelegate OnCharacterSelectionStop; // 0x260(0x10)
	FMulticastInlineDelegate OnShowCharacterSelectionRefresh; // 0x270(0x10)
	FMulticastInlineDelegate OnTutorialManagerSet; // 0x280(0x10)
	FMulticastInlineDelegate OnLocalPlayerCharacterSet; // 0x290(0x10)
	FMulticastInlineDelegate OnShowReconnectScreen; // 0x2a0(0x10)
	FMulticastInlineDelegate OnXBoxAccountPickerClosed; // 0x2b0(0x10)
	FMulticastInlineDelegate OnXBoxChangeUser; // 0x2c0(0x10)
	FMulticastInlineDelegate OnHDRGammaChanged; // 0x2d0(0x10)
	FMulticastInlineDelegate OnGravityChanged; // 0x2e0(0x10)
	FMulticastInlineDelegate OnNewPostProcessingManager; // 0x2f0(0x10)
	FMulticastInlineDelegate OnPreviewSkinChanged; // 0x300(0x10)
	bool ShowingReconnectScreen; // 0x310(0x01)
	FPendingRewards PendingMissionRewards; // 0x318(0x190)
	TArray<FClaimableRewardEntry> PendingPromotionRewards; // 0x4a8(0x10)
	TWeakObjectPtr<UMouseCursorWidget> MouseCursorWidget; // 0x4b8(0x08)
	FMulticastInlineDelegate OnShowCharacterSelector; // 0x4c0(0x10)
	FMulticastInlineDelegate OnShowViewer3D; // 0x4d0(0x10)
	FMulticastInlineDelegate OnShowCharacterSelectorEquipSlot; // 0x4e0(0x10)
	FMulticastInlineDelegate OnShowCharacterSelectorEquip; // 0x4f0(0x10)
	FMulticastInlineDelegate OnShowCharacterSelectorRotate; // 0x500(0x10)
	FMulticastInlineDelegate OnShowEndScreen; // 0x510(0x10)
	AProceduralSetup* ProceduralSetup; // 0x520(0x08)
	bool HasStartedAMission; // 0x528(0x01)
	FString FSDPassword; // 0x530(0x10)
	bool FSDPrivateServer; // 0x540(0x01)
	bool SoloSession; // 0x541(0x01)
	bool IsJoiningInvite; // 0x542(0x01)
	bool FirstTimeInFrontend; // 0x543(0x01)
	bool SessionFirstStartOnSpaceRig; // 0x544(0x01)
	bool ShowFirstCharacterSelector; // 0x545(0x01)
	bool ShowSaveWarning; // 0x546(0x01)
	AActor* WorldViewTargetDummy; // 0x548(0x08)
	UMissionResultInfo* MissionResultInfo; // 0x550(0x08)
	bool LoaderSequencePlaying; // 0x558(0x01)
	FString LastPerksLoadout; // 0x560(0x10)
	AActor* CharacterSelectionLastViewTarget; // 0x570(0x08)
	bool HasSeenInfoScreen; // 0x578(0x01)
	FTransform CharacterSelectionViewTargetTransform; // 0x580(0x30)
	FTransform LoaderViewTargetTransform; // 0x5b0(0x30)
	FMulticastInlineDelegate OnGeneratedMissionChanged; // 0x5e0(0x10)
	FGameStateSeamlessTravelStorage GameStateSeamlessTravelStorage; // 0x5f0(0x150)
	TWeakObjectPtr<ADonkeyCharacter> Donkey; // 0x740(0x08)
	FMulticastInlineDelegate OnBoscoChanged; // 0x748(0x10)
	bool DEBUGSpawnRandomMissions; // 0x758(0x01)
	int32_t DEBUGSeedOverride; // 0x774(0x04)
	bool CanPlayOnline; // 0x778(0x01)
	bool CanCommunicateOnline; // 0x779(0x01)
	FMulticastInlineDelegate OnSteamSearchRegionChanged; // 0x780(0x10)
	FMulticastInlineDelegate OnSteamServerJoinStatusChanged; // 0x790(0x10)
	FMulticastInlineDelegate OnStartSearchForFriendsComplete; // 0x7a0(0x10)
	TMap<FString, FString> FriendSessions; // 0x7b0(0x50)
	FMulticastInlineDelegate OnNewSpaceRigNotification; // 0x800(0x10)
	UDiscordWrapper* DiscordWI; // 0x818(0x08)
	UCommunityGoalWrapper* CommunityWI; // 0x820(0x08)
	UGoogleAnalyticsWrapper* GoogleAnalyticsWI; // 0x828(0x08)
	USpecialEvent* ForcedSpecialEvent; // 0x830(0x08)
	bool ShowMinerManualWorkInProgress; // 0x83a(0x01)
	FMulticastInlineDelegate OnCampaignNotification; // 0x840(0x10)
	FMulticastInlineDelegate OnMinersManualNotification; // 0x850(0x10)
	FMulticastInlineDelegate OnNewHUDWarning; // 0x860(0x10)
	FMulticastInlineDelegate OnNewBossFight; // 0x870(0x10)
	FMulticastInlineDelegate OnBossFightRemoved; // 0x880(0x10)
	TArray<TScriptInterface<IBossFightInterface>> ActiveBossFights; // 0x890(0x10)
	float LastDreadnaughtKillTime; // 0x8d8(0x04)
	TWeakObjectPtr<UWindowWidget> ActiveEscapeMenu; // 0x8dc(0x08)
	UCampaignNotification* CampaignNotification; // 0x8e8(0x08)
	TWeakObjectPtr<APostProcessingManager> PostProcessingManager; // 0x900(0x08)
	FFadeData Fading; // 0x908(0x48)
	TArray<FSpaceRigNotification> SpaceRigNotifications; // 0x950(0x10)
	TWeakObjectPtr<ABosco> Drone; // 0x960(0x08)
	TWeakObjectPtr<APlayerCharacter> LocalPlayerCharacter; // 0x968(0x08)
	TWeakObjectPtr<ATutorialManager> TutorialManager; // 0x970(0x08)
	ACharacterSelectionSwitcher* CharacterSelectionSwitcher; // 0x978(0x08)
	bool bGameSettingsChanged; // 0x980(0x01)
	FFSDServerSearchOptions ServerSearchOptions; // 0x988(0x50)
	bool ServerSearchActive; // 0x9d8(0x01)
	bool IsOnPressStartScreen; // 0xa00(0x01)
	bool HasSeenStartScreen; // 0xa01(0x01)
	AProceduralSetup* ProceduralLevel; // 0xa08(0x08)
	UIconGenerationManager* IconGenerationManagerClass; // 0xa10(0x08)
	UIconGenerationManager* IconGenerationManager; // 0xa18(0x08)
	UCampaignManager* CampaignManager; // 0xa28(0x08)
	UDeepDiveManager* DeepDiveManager; // 0xa30(0x08)
	UGeneratedMission* GeneratedMission; // 0xa38(0x08)
	UDifficultySetting* DesiredDifficulty; // 0xa40(0x08)
	UFSDSaveGame* SaveGame; // 0xa48(0x08)
	enum class EDisconnectReason DisconnectReason; // 0xa50(0x01)
	TArray<UWorld*> AlwaysLoadedWorlds; // 0xa58(0x10)
	bool ShowCharacterSelectionWorld; // 0xa68(0x01)
	AActor* Viewer3DClass; // 0xa70(0x08)
	bool ShowLoaderWorld; // 0xa78(0x01)
	bool CharacterSelectionWorldActive; // 0xa79(0x01)
	bool MixerInteractivityEnabled; // 0xa7a(0x01)
	bool LoaderWorldActive; // 0xa7b(0x01)
	bool ResetHUDWhenReturning; // 0xa7c(0x01)
	UStatHat* StatHat; // 0xa80(0x08)
	USchematic* ActiveForgeSchematic; // 0xa88(0x08)
	UFSDCloudLoadSave* FSDCloudLoadSave; // 0xa90(0x08)
	UFSDSessionUpdater* SessionUpdater; // 0xa98(0x08)
	UFSDSendToURL* SendToURL; // 0xaa0(0x08)
	UFSDFriendsAndInvites* FriendsAndInvites; // 0xaa8(0x08)
	double SessionStartTime; // 0xab0(0x08)
	int32_t SessionStartTimestamp; // 0xab8(0x04)
	float InKBytesPerSecond; // 0xabc(0x04)
	float OutKBytesPerSecond; // 0xac0(0x04)
	UTemporaryBuff* TemporaryBuff; // 0xac8(0x08)
	TSoftObjectPtr<ULevelSequence> NextLoaderSequence; // 0xad0(0x28)
	enum class EAlwaysLoadedWorlds NextLoaderLevel; // 0xaf8(0x01)
	TSoftObjectPtr<ULevelSequence> DeepDiveLoaderSequence; // 0xb00(0x28)
	TSoftObjectPtr<ULevelSequence> DeepDiveLoaderSequence2; // 0xb28(0x28)

	void UpdateGlobelMissionSeed();
	void StopPhotographyInputProcessor();
	void StopPersonalAnalytics();
	void SteamServerJoinStatusDelegate__DelegateSignature(enum class ESteamServerJoinStatus Status);
	void SteamSearchRegionDelegate__DelegateSignature(enum class ESteamSearchRegion Region);
	void StartPhotographyInputProcessor();
	void StartPersonalAnalytics();
	AProceduralSetup* SpawnProcedural();
	bool ShouldPendingRewardsBeShown();
	bool ShouldPendingRewardsBeGiven();
	void SetViewer3DClassWithLocation(AActor* NewClass, enum class ECharselectionCameraLocation Location);
