// Class LuminRuntimeSettings.LuminRuntimeSettings
// Size: 0x148 (Inherited: 0x28)
struct ULuminRuntimeSettings : UObject {
	FString PackageName; // 0x28(0x10)
	FString ApplicationDisplayName; // 0x38(0x10)
	enum class ELuminFrameTimingHint FrameTimingHint; // 0x48(0x01)
	bool bProtectedContent; // 0x49(0x01)
	bool bManualCallToAppReady; // 0x4a(0x01)
	bool bUseMobileRendering; // 0x4b(0x01)
	bool bUseVulkan; // 0x4c(0x01)
	FFilePath Certificate; // 0x50(0x10)
	FDirectoryPath IconModelPath; // 0x60(0x10)
	FDirectoryPath IconPortalPath; // 0x70(0x10)
	FLocalizedIconInfos LocalizedIconInfos; // 0x80(0x10)
	int32_t VersionCode; // 0x90(0x04)
	int32_t MinimumAPILevel; // 0x94(0x04)
	TArray<enum class ELuminPrivilege> AppPrivileges; // 0x98(0x10)
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8(0x10)
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8(0x10)
	FString SpatializationPlugin; // 0xc8(0x10)
	FString ReverbPlugin; // 0xd8(0x10)
	FString OcclusionPlugin; // 0xe8(0x10)
	int32_t SoundCueCookQualityIndex; // 0xf8(0x04)
	bool bRemoveDebugInfo; // 0xfc(0x01)
	FDirectoryPath VulkanValidationLayerLibs; // 0x100(0x10)
	bool bFrameVignette; // 0x110(0x01)
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118(0x10)
};

