// UserDefinedStruct SpawnProfile.SpawnProfile
// Size: 0x104 (Inherited: 0x00)
struct FSpawnProfile {
	FGuid ID_109_36E1D4EF42501F3B3B23CB9A99EAAD47; // 0x00(0x10)
	FString Name_79_650AA2E8437AA0216241F49388A91426; // 0x10(0x10)
	FString NotificationText_85_806024974B56E115B4488EBFCDF7DDC4; // 0x20(0x10)
	FSpawnConfig SpawnConfig_101_9FEBF7C643DF36A9837567A540192E94; // 0x30(0x44)
	bool RandomPooled_120_9A517394494D89C66A88BEA4706FECE4; // 0x74(0x01)
	FString ChainProfile_124_CF7558A64EF12BD5AE34E7865F0D8B8D; // 0x78(0x10)
	FString NameplateTemplate_129_DFDB7E944CD2D02B9B240D929132C0B3; // 0x88(0x10)
	FString NameplateWithMessageTemplate_130_3116BA314F2FBEA497B84386358AEF75; // 0x98(0x10)
	float NameplateHeight_133_DA2623CA4AD37B4E59E8A883A66FB3B4; // 0xa8(0x04)
	float RandomWeight_136_5554A2834873D9C9C85C74BE4D1C80F7; // 0xac(0x04)
	int32_t RandomRerolls_139_A1FD1B44435C3C7453EE2D97693726A8; // 0xb0(0x04)
	int32_t SpawnCountVariance_142_D65BE90347AEEA158BB54989C9600F08; // 0xb4(0x04)
	float OffsetVariance_151_BFA2B13A496B6A9304BEA59A8AE20E88; // 0xb8(0x04)
	float RotationVariance_150_5A058AA9474F49F4C2D1E9B875558B84; // 0xbc(0x04)
	float ScaleVariance_149_F0E88C984B30B2DAC9E57FBB758B2344; // 0xc0(0x04)
	FString DespawnChain_157_B7EEF168432C8DC8D09AD3BE0DB4D9C9; // 0xc8(0x10)
	FLinearColor NameplateColor_161_0EDE4FE54C039437BD1442961D8203AF; // 0xd8(0x10)
	bool LoadoutA_165_E1EDC0704B074A8B29EBD3850D1D8086; // 0xe8(0x01)
	bool LoadoutB_166_BF2D75A14FBD6BE0D52FD9B151B09EA4; // 0xe9(0x01)
	bool LoadoutC_167_80E752E9439B3766F496BC815DBB9183; // 0xea(0x01)
	float TimeDilationVariance_170_B875E72D460382E5151B60B790F23CAC; // 0xec(0x04)
	FName GameObjectID_173_BF98AE5C49E544EFDE7994BE1C76EB9D; // 0xf0(0x08)
	bool TargetHost_181_62441A5D4ADF5B5BE09584B5C9ACF00A; // 0xf8(0x01)
	bool TargetRandom_184_BD62721E417F69D5799AA2BD14F966F1; // 0xf9(0x01)
	bool TargetAll_185_B139D4E14F546664DBEFF9ABE29DEA04; // 0xfa(0x01)
	bool TargetDriller_186_F4E4ACE2444951FE49C4509E4FA70410; // 0xfb(0x01)
	bool TargetEngineer_187_50573554410C2C2E47D85A8C8179481A; // 0xfc(0x01)
	bool TargetGunner_188_1E162947447E3D6DF1718EB39F760CA6; // 0xfd(0x01)
	bool TargetScout_189_623E8CE6459F875408218A8890CC0AB4; // 0xfe(0x01)
	float Property_MineralChunkValue_199_088BE5C7415343DDF325E8A4B3CDCEC4; // 0x100(0x04)
};

