// UserDefinedStruct SpawnConfig.SpawnConfig
// Size: 0x44 (Inherited: 0x00)
struct FSpawnConfig {
	int32_t SpawnCount_84_72AA6C294020356B7F15D6A97221E99C; // 0x00(0x04)
	float MinDistance_93_83D55C434A7E005AABD7B6ADCAF31366; // 0x04(0x04)
	float MaxDistance_96_78EB60694833D1BBF94276B5578BFF48; // 0x08(0x04)
	float MinSlopeDegrees_99_1B33CEFC4D907E7E3CB8BAB3DA6B6738; // 0x0c(0x04)
	float MaxSlopeDegrees_100_1B8DFAFF4C651C61726083ADDB6E817E; // 0x10(0x04)
	FVector Scale_92_9FEF259E49F85122416F55877140EB96; // 0x14(0x0c)
	FVector LocalOffset_132_CA2C66134D237AEE35F07BAE62AC6986; // 0x20(0x0c)
	FRotator LocalRotation_131_E2D4CC7844838A44851A97B20B320062; // 0x2c(0x0c)
	float InitialDelay_120_8D1758BD4918123DCF462E92898C403B; // 0x38(0x04)
	float Lifetime_122_81E1319D453994286C37F0A2D6143035; // 0x3c(0x04)
	float TimeDilation_138_AB8678EA494A1470D8056A8612CE5A05; // 0x40(0x04)
};

