// BlueprintGeneratedClass SpawnMenuSettingsSave.SpawnMenuSettingsSave_C
// Size: 0xb9 (Inherited: 0x28)
struct USpawnMenuSettingsSave_C : USaveGame {
	TArray<FSpawnProfile> Spawn Profiles; // 0x28(0x10)
	int32_t Spawn Count; // 0x38(0x04)
	float Min Distance; // 0x3c(0x04)
	float Max Distance; // 0x40(0x04)
	float Min Slope; // 0x44(0x04)
	float Max Slope; // 0x48(0x04)
	FVector Scale; // 0x4c(0x0c)
	FVector Local Offset; // 0x58(0x0c)
	FRotator Local Rotation; // 0x64(0x0c)
	float Initial Delay; // 0x70(0x04)
	float LifeTime; // 0x74(0x04)
	bool Spawn On Host; // 0x78(0x01)
	bool Spawn On Driller; // 0x79(0x01)
	bool Spawn On Engineer; // 0x7a(0x01)
	bool Spawn On Gunner; // 0x7b(0x01)
	bool Spawn On Scout; // 0x7c(0x01)
	bool Spawn On Random Player; // 0x7d(0x01)
	bool Spawn On All Players; // 0x7e(0x01)
	bool Allow Destroy Natural Objects; // 0x7f(0x01)
	bool Prevent Natural Creature Spawns; // 0x80(0x01)
	bool Interactivity Enabled; // 0x81(0x01)
	bool Allow Interactivity In Space Rig; // 0x82(0x01)
	bool Show Interactivity Notifications; // 0x83(0x01)
	float Queue Interval Rate; // 0x84(0x04)
	float Queue Initial Delay; // 0x88(0x04)
	int32_t Queue Pause Downed Players; // 0x8c(0x04)
	bool LoadoutA; // 0x90(0x01)
	bool LoadoutB; // 0x91(0x01)
	bool LoadoutC; // 0x92(0x01)
	int32_t Max Active Critters; // 0x94(0x04)
	int32_t Max Active Swarmers; // 0x98(0x04)
	int32_t Max Active Enemies; // 0x9c(0x04)
	bool Enable Natural Spawning; // 0xa0(0x01)
	FString TwitchURL; // 0xa8(0x10)
	bool Enable Chat Spawn Notifications; // 0xb8(0x01)
};

