// BlueprintGeneratedClass UpgradedDorettaSaveGame.UpgradedDorettaSaveGame_C
// Size: 0x33 (Inherited: 0x28)
struct UUpgradedDorettaSaveGame_C : USaveGame {
	bool Turret 1; // 0x28(0x01)
	bool Turret 2; // 0x29(0x01)
	bool Turret 3; // 0x2a(0x01)
	bool Turret 4; // 0x2b(0x01)
	bool Deposit 1; // 0x2c(0x01)
	bool Deposit 2; // 0x2d(0x01)
	bool Pipe 1; // 0x2e(0x01)
	bool Pipe 2; // 0x2f(0x01)
	bool Light 1; // 0x30(0x01)
	bool Waste 1; // 0x31(0x01)
	bool Defense 1; // 0x32(0x01)
};

