// WidgetBlueprintGeneratedClass W_ProfileEditForm.W_ProfileEditForm_C
// Size: 0x3b0 (Inherited: 0x230)
struct UW_ProfileEditForm_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	UEditableTextBox* ChainProfileTextBox; // 0x238(0x08)
	USpinBox* Delay_SpinBox; // 0x240(0x08)
	UEditableTextBox* DespawnChainTextbox; // 0x248(0x08)
	UComboBoxString* GameObjectCombobox; // 0x250(0x08)
	USpinBox* LifeTime_SpinBox; // 0x258(0x08)
	UCheckBox* LoadoutA_CheckBox; // 0x260(0x08)
	UCheckBox* LoadoutB_CheckBox; // 0x268(0x08)
	UCheckBox* LoadoutC_CheckBox; // 0x270(0x08)
	USpinBox* MaxDistance_SpinBox; // 0x278(0x08)
	USpinBox* MaxSlope_SpinBox; // 0x280(0x08)
	USpinBox* MinDistance_SpinBox; // 0x288(0x08)
	USpinBox* MineralChunkValueSpinBox; // 0x290(0x08)
	USpinBox* MinSlope_SpinBox; // 0x298(0x08)
	UEditableTextBox* NameplateColorTextbox; // 0x2a0(0x08)
	USpinBox* NameplateHeight_SpinBox; // 0x2a8(0x08)
	UEditableTextBox* NameplateMsgTextBox; // 0x2b0(0x08)
	UEditableTextBox* NameplateTextBox; // 0x2b8(0x08)
	UEditableTextBox* NotificationTextBox; // 0x2c0(0x08)
	USpinBox* OffsetV_SpinBox; // 0x2c8(0x08)
	USpinBox* OffsetX_SpinBox; // 0x2d0(0x08)
	USpinBox* OffsetY_SpinBox; // 0x2d8(0x08)
	USpinBox* OffsetZ_SpinBox; // 0x2e0(0x08)
	UCheckBox* OnAll_Checkbox; // 0x2e8(0x08)
	UCheckBox* OnDriller_Checkbox; // 0x2f0(0x08)
	UCheckBox* OnEngineer_Checkbox; // 0x2f8(0x08)
	UCheckBox* OnGunner_CheckBox; // 0x300(0x08)
	UCheckBox* OnHost_CheckBox; // 0x308(0x08)
	UCheckBox* OnRandom_Checkbox; // 0x310(0x08)
	UCheckBox* OnScout_CheckBox; // 0x318(0x08)
	UEditableTextBox* ProfileNameTextBox; // 0x320(0x08)
	UCheckBox* Random_CheckBox; // 0x328(0x08)
	USpinBox* Rerolls_Spinbox; // 0x330(0x08)
	USpinBox* RotationV_SpinBox; // 0x338(0x08)
	USpinBox* RotationX_SpinBox; // 0x340(0x08)
	USpinBox* RotationY_SpinBox; // 0x348(0x08)
	USpinBox* RotationZ_SpinBox; // 0x350(0x08)
	USpinBox* ScaleV_SpinBox; // 0x358(0x08)
	USpinBox* ScaleX_SpinBox; // 0x360(0x08)
	USpinBox* ScaleY_SpinBox; // 0x368(0x08)
	USpinBox* ScaleZ_SpinBox; // 0x370(0x08)
	USpinBox* SpawnCount_SpinBox; // 0x378(0x08)
	USpinBox* SpawnCountV_SpinBox; // 0x380(0x08)
	USpinBox* TimeDilation_SpinBox; // 0x388(0x08)
	USpinBox* TimeDilationVariance_SpinBox; // 0x390(0x08)
	USpinBox* Weight_Spinbox; // 0x398(0x08)
	FGuid Profile ID; // 0x3a0(0x10)

	void Set Profile(FSpawnProfile Spawn Profile);
	void Get Profile(FSpawnProfile Profile);
	void OnInitialized();
	void ExecuteUbergraph_W_ProfileEditForm(int32_t EntryPoint);
};

